<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
  <title>Guía del curso</title>
  <meta content="Ra&uacute;l Luna" name="author">
  <link rel="stylesheet" type="text/css" href="nvu2005.css">
<!-- parche de compatibilización con CSS 2 para navegadores microsoft --><!--[if lt IE 7]>
<script src="ie7/ie7-standard-p.js" type="text/javascript"></script>
<![endif]-->
</head>

<body>
<div id="localizador">
<p>Gu&iacute;a del alumno</p>

</div>
<div id="contenido">
<p>A continuaci&oacute;n encontrar&aacute;s un conjunto de p&aacute;ginas WEB
  en las que se ha pretendido combinar la teor&iacute;a necesaria con
  el m&aacute;ximo posible de pr&aacute;ctica, de forma que se genere un proceso
  de experimentaci&oacute;n que te permita un aprendizaje aut&oacute;nomo. </p>
<p>Los <strong>objetivos</strong> que se plantean son:&nbsp; </p>
<ul>
  <li> Que conozcas la estructura b&aacute;sica de un documento HTML.&nbsp;</li>
  <li> Que aprendas a construir una p&aacute;gina HTML utilizando los recursos
    elementales y algunos de nivel intermedio.&nbsp;</li>
  <li> Que adquieras las bases necesarias para poder continuar de forma aut&oacute;noma
    el aprendizaje sobre elementos avanzados de lenguaje HTML.&nbsp;</li>
</ul>
<p>El presente curso, aunque puede ser utilizado como herramienta autoformativa
  con prop&oacute;sito general, est&aacute; concebido para el profesorado, por lo que los objetivos
  planteados se apoyan en un tema central de trabajo: <strong>construir
    y publicar un sitio WEB de contenido educativo</strong> compuesto de varias p&aacute;ginas
    con sus correspondientes enlaces. Los recursos para llevar a cabo esta tarea
    los iremos trabajando paso a paso, pero deber&iacute;as tenerla presente
    desde el momento de iniciar el curso.</p>
<p>Los <strong>materiales</strong> que encontrar&aacute;s recogen una serie de explicaciones
  sobre los diferentes elementos que constituyen las p&aacute;ginas WEB y un
  conjunto de ejercicios intercalados para ir practicando los conceptos explicados.
  Dispones de un total de 103 actividades guiadas, que te permitir&aacute;n practicar
  los conceptos y t&eacute;cnicas abordadas en la parte m&aacute;s descriptiva
  del curso.</p>
<p>La <strong>navegaci&oacute;n</strong> por los contenidos del curso puede hacerse siguiendo
  una secuencia lineal, igual que si se fueran pasando una a una las p&aacute;ginas
  de un manual o bien de forma no secuencial para lo que se utilizar&aacute; el
  men&uacute; que tendr&aacute;s presente de forma constante en la zona izquierda
  de la pantalla. Puedes plantearte una divisi&oacute;n de los contenidos en
  dos fases: </p>
<ul>
  <li>Una fase de de iniciaci&oacute;n te permitir&aacute; tomar contacto con
    los elementos b&aacute;sicos del lenguaje HTML para crear las primeras p&aacute;ginas.
    Incluye los contenidos correspondientes a los apartados Introducci&oacute;n,
    La base,  Tablas, Multimedia (Im&aacute;genes), V&iacute;nculos, Validaci&oacute;n
    y Publicaci&oacute;n.</li>
  <li>Para adquirir una visi&oacute;n m&aacute;s completa se a&ntilde;adir&iacute;an
    el resto de los m&oacute;dulos: Multimedia (Sonidos), Formularios, Plantillas,
    Marcos, XHTML, Accesibilidad y, especialmente, Estilos. </li>
</ul>
<p>La secci&oacute;n de Recursos te brinda una selecci&oacute;n de t&eacute;cnicas,
  herramientas y enlaces a algunas p&aacute;ginas
  desde las cuales puedes encontrar  fuentes con las que completar
  y enriquecer tu aprendizaje.</p>
<p>Las <strong>herramientas</strong> utilizadas para el curso son, en todos los
  casos bajo licencia GPL o de tipo freeware. En los casos de herramientas de
  c&oacute;digo abierto tendr&aacute;s en la carpeta de programas del CD las versiones disponibles
  en el momento de elaborar esta documentaci&oacute;n, aunque siempre podr&aacute;s consultar
  los sitios originales para comprobar si existe alguna actualizaci&oacute;n.</p>
<p>En los casos en los que no existe una autorizaci&oacute;n para la distribuci&oacute;n dispones
  del enlace a las p&aacute;ginas de descarga para poder obtener los programas.</p>
<p>Aunque no son demasiados se incluyen en la documentaci&oacute;n algunos <strong>enlaces</strong> a
  sitios web. Aunque se trata de sitios muy estables cabe la posibilidad de que,
  en un futuro, pudieran haber modificado la direcci&oacute;n de acceso o, en el peor
  de los casos, desaparecido. Aunque estas situaciones, especialmente la segunda,
  son poco probables tendr&iacute;as entonces que recurrir a una b&uacute;squeda en la web
  para localizar la nueva ubicaci&oacute;n. </p>
<p>El programa b&aacute;sico para el desarrollo de las p&aacute;ginas ser&aacute; N|VU. A pesar de
  disponer de gran cantidad de funcionalidades y ser bastante estable tambi&eacute;n
  sufre de algunos problemas que se han podido documentar en base a la experiencia
  de otros usuarios o la propia durante el desarrollo del curso, por lo que es
  conveniente que, si te encuentras con alguna situaci&oacute;n an&oacute;mala intentes
  localizarla en la secci&oacute;n de <strong>errores</strong> para ver cu&aacute;l
  es la posible soluci&oacute;n. </p>
</div>
</body>
</html>
