<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html lang="es-es">
<head>

  <meta content="text/html; charset=ISO-8859-1" http-equiv="content-type">
  <title>Plantillas</title>


<!-- parche de compatibilización con CSS 2 para navegadores microsoft --><!--[if lt IE 7]> <script src="../ie7/ie7-standard-p.js" type="text/javascript"></script> <![endif]-->
  <link rel="stylesheet" href="../nvu2005.css" type="text/css">

</head>


<body>
<div id="localizador">
<p>Plantillas</p>

</div>
<div id="flechadcha">
<a href="../formularios/formularios1.htm" title="avanzar"><img src="../Images/flechadcha.gif" border="0"></a>
</div>
<div id="flechaizq">
<a href="../validacion/validacion.html" title="retroceder"><img src="../Images/flechaizq.gif" border="0"></a>
</div>


<div id="contenido"
<p></p>

<h2>Qu&eacute; es una plantilla</h2>

<p>Como puedes imaginar por el nombre una plantilla es un modelo
que nos
permite aprovechar una estructura base. Gracias a ellas
podremos&nbsp;
crear de forma r&aacute;pida p&aacute;ginas que comparten esa
estructrura com&uacute;n, modificando &uacute;nicamente
aquellos
contenidos que particularizan cada una de ellas. Por ejemplo, si
estamos creando una p&aacute;gina de centro y queremos
&nbsp;establecer un patr&oacute;n com&uacute;n para que las
p&aacute;ginas principales de cada ciclo o departamento tengan
caracter&iacute;sticas comunes podr&iacute;amos recurrir a una
plantilla.</p>

<p>Con estas perspectivas nos encontramos ante una herramienta
que
podr&iacute;a ser muy &uacute;til, pero lo cierto es que, en el
estado actual del programa es una de los componentes&nbsp;que
necesitan m&aacute;s revisi&oacute;n para hacerlo realmente
funcional: a d&iacute;a de hoy el comportamiento es en algunas
ocasiones poco l&oacute;gico y en otras, sencillamente
impredecible, con un entorno de creaci&oacute;n&nbsp;que no
acaba de ser intuitivo, especialmente porque los resultados que se
obtienen pueden distanciarse de lo previsto.</p>

<p>A pesar de ello haremos una breve descripci&oacute;n de la
herramienta por si puede sacarle partido en alg&uacute;n momento y,
sobre todo, porque es previsible que las funcionalidades que ahora
mismo no se comportan correctamente puedan corregirse en futuras
versiones.
</p>

<h2>Crear una plantilla</h2>

<img class="flotder" style="width: 440px; height: 277px;" alt="Panel de creaci&oacute;n de nuevo documento con la opci&oacute;n Plantilla vac&iacute;a marcada" title="Panel de creaci&oacute;n de nuevo documento con la opci&oacute;n Plantilla vac&iacute;a marcada" src="imagenes/plantillavacia.png">Para crear una plantilla
utilizaremos:<br>

<ul>

  <li>la opci&oacute;n de men&uacute; <span class="refmenu">archivo&nbsp;</span><img class="refmenu" style="width: 14px; height: 13px;" alt="a continuaci&oacute;n" src="../imagenes/flechamenu.png"><span class="refmenu"> nuevo</span>&nbsp;</li>

  <li>la pulsaci&oacute;n de teclas&nbsp; <img style="width: 36px; height: 26px;" alt="Ctrl" src="../imagenes/teclactrl.png"> + <img style="width: 26px; height: 27px;" alt="ENE" src="../imagenes/teclan.png">&nbsp;</li>

  <li>la posibilidad <span class="refmenu">m&aacute;s
opciones</span> en el desplegable que acompa&ntilde;a al
icono <img style="width: 58px; height: 40px;" alt="Nuevo" src="../imagenes/botonnuevo.png"> de la barra de
herramientas.&nbsp;</li>

</ul>

<p>Con cualquiera de ellas obtendremos un panel para seleccionar
el tipo de archivo que se desea crear, e indicaremos que queremos una
plantilla vac&iacute;a.</p>

<p>A partir de este momento dispondremos de una nueva
pesta&ntilde;a en la que podremos ir tecleando los elementos
comunes de la p&aacute;gina.&nbsp;</p>

<p>Vamos a ver a continuaci&oacute;n una pr&aacute;ctica
guiada en la que vamos a utilizar una plantilla.&nbsp;<span class="refmenu"></span></p>

<p>La situaci&oacute;n de la que partimos es que hemos
realizado una salida en la que se han recogido muestras de hojas de
diversas plantas para&nbsp;practicar la clasificaci&oacute;n
mediante consulta de claves dicot&oacute;micas. Hemos hecho fotos
de cada ejemplar y pretendemos que los alumnos dejen constancia de su
trabajo elaborando cada uno un par de fichas de
identificaci&oacute;n.</p>

<p>La primera condici&oacute;n es que compruebes que tienes
activada la opci&oacute;n en <span class="refmenu">herramientas&nbsp;</span><img class="refmenu" style="width: 14px; height: 13px;" alt="a continuaci&oacute;n" src="../imagenes/flechamenu.png"><span class="refmenu"> preferencias&nbsp;</span><img class="refmenu" style="width: 14px; height: 13px;" alt="a continuaci&oacute;n" src="../imagenes/flechamenu.png"><span class="refmenu"> usar estilos css en lugar de elementos y
atributos html</span>. Si has llegado aqu&iacute; con un
recorrido de iniciaci&oacute;n o est&aacute;s inciando el de
profundizaci&oacute;n es tomar&aacute;s un primer contacto con
los estilos en l&iacute;nea o incrustados (M&aacute;s adelante
ver&aacute;s que existen formas mucho m&aacute;s productivas de
aplicar estilos, pero por el momento puede servirnos.</p>

<p>Empezamos por crear una plantilla vac&iacute;a con el
procedimiento que hemos comentado y le adjudicamos una serie de
propiedades comunes. Para hacerlo iremos seleccionando las etiquetas en
la <span style="font-weight: bold;">barra de estado</span>
y pulsando con el <span style="font-weight: bold;">bot&oacute;n
derecho</span> para
elegir los estilos incrustados.</p>

<div class="practicas">
<img class="numact" style="width: 29px; height: 29px; float: left;" alt="Actividad 59" title="Actividad 59" src="../imagenes/numeracion/cincuentaynueve.gif">
<ul>

  <li>Pulsa sobre la etiqueta<code> &lt;body&gt;</code>
con el bot&oacute;n derecho&nbsp;y elige <span class="refmenu">estilos incrustados&nbsp;</span><img class="refmenu" style="width: 14px; height: 13px;" alt="a continuaci&oacute;n" src="../imagenes/flechamenu.png"><span class="refmenu"> propiedades del fondo</span> y
selecciona un color para el fondo.</li>

  <li>Vuelve a pulsar el bot&oacute;n derecho sobre<code>
&lt;body&gt;</code> para elegir <span class="refmenu">estilos
incrustados&nbsp;</span><img class="refmenu" style="width: 14px; height: 13px;" alt="a continuaci&oacute;n" src="../imagenes/flechamenu.png"><span class="refmenu">
propiedades del texto</span> y seleccionar una fuente
predeterminada sans-serif</li>

  <li>Escribe el texto "Identificaci&oacute;n de hojas"
y haz que su formato sea <span class="refmenu">T&iacute;tulo
1&nbsp;</span></li>

  <li>Pulsa la tecla&nbsp;<img style="width: 34px; height: 36px;" alt="Intro" title="Intro" src="../imagenes/teclaintro.png"> y
cerci&oacute;rate que este siguente bloque tiene el formato de
p&aacute;rrafo. Escribe el texto "La foto se ha tomado en:
"&nbsp;</li>

</ul>

</div>

<p><span class="refmenu"></span> <img class="flotder" style="width: 277px; height: 317px;" alt="Panel para insertar &aacute;reas editables" title="Panel para insertar &aacute;reas editables" src="imagenes/panelareaseditables.png">Hasta
el momento hemos adjudicado estilos y hemos escrito textos que
pretendemos que se mantengan de forma invariable en los documentos que
se creen basados en esta plantilla. A partir de
ahora&nbsp;empezaremos
a utilizar el panel para la creaci&oacute;n de &aacute;reas
editables
en la plantilla y combinaremos estas zonas con otras que
permanecer&aacute;n fijas.&nbsp;</p>

<p>El nombre del &aacute;rea que ser&aacute; la etiqueta
que la identificar&aacute;, no puede contener espacios.&nbsp;</p>

<p>El tipo <span class="refmenu">texto fluido</span>
se inserta como
una cadena de caracteres a continuaci&oacute;n de lo que se
est&eacute;
escribiendo. Cuando tengamos intenci&oacute;n de insertar una
imagen
para que el texto fluya a su izquierda o su derecha habr&aacute;
que
utilizar este tipo.</p>

<p>El tipo <span class="refmenu">bloque</span>
crea un nuevo bloque independiente de lo que ten&iacute;amos hasta
el momento: equivaldr&iacute;a a insertar un p&aacute;rrafo <code>&lt;p&gt;</code>
o una divisi&oacute;n <code>&lt;div&gt;</code>&nbsp;</p>

<p>En cuanto a las opciones, su sentido es evidente pero, en la
actual versi&oacute;n el funcionamiento es bastante inestable y, de
hecho, la opci&oacute;n de que el &aacute;rea se pueda mover no
parece operativa en la versi&oacute;n 1.0 con la que se ha
trabajado y la de que el &aacute;rea pueda repetirse tampoco
est&aacute; operativa hasta que no se separa el documento de la
plantilla. As&iacute; pues, la recomendaci&oacute;n, hasta que
no se mejore este apartado es no hacer uso de las opciones.&nbsp;<br clear="all">

</p>

<div class="practicas">
<img class="numact" style="width: 29px; height: 29px; float: left;" alt="Actividad 59" title="Actividad 59" src="../imagenes/numeracion/cincuentaynueve.gif">
<p>Continuamos
con la actividad. Utiliza la opci&oacute;n <span class="refmenu">insertar
plantillas&nbsp;</span><img class="refmenu" style="width: 14px; height: 13px;" alt="a continuaci&oacute;n" src="../imagenes/flechamenu.png"><span class="refmenu">
insertar &aacute;rea editable</span>
y elige <span class="refmenu">texto fluido</span>.</p>

<ul>

  <li>Nombra el &aacute;rea como "lugar".
&nbsp;Comprobar&aacute;s que el
texto dentro del &aacute;rea es igual que la etiqueta; si te parece
necesario ed&iacute;talo poniendo un texto explicativo, p.ej:
"indica
el lugar en que se tom&oacute; la foto"</li>

  <li>Cuando pulses la tecla <img style="width: 34px; height: 36px;" alt="Intro" title="Intro" src="../imagenes/teclaintro.png">
se crear&aacute; un nuevo p&aacute;rrafo, pero ver&aacute;s
que se ha
heredado tambi&eacute;n el &aacute;rea editable. Acude a la
barra de
estado, selecciona la etiqueta <code>&lt;span&gt;</code>
que corresponde al &aacute;rea editable y pulsa&nbsp;<img style="width: 38px; height: 27px;" alt="Suprimir" src="../imagenes/teclasupr.png"> para eliminarla.</li>

  <li>A&ntilde;adiremos ahora el texto "Fecha: " y crearemos
nuevamente un
&aacute;rea editable para introducirla igual que acabamos de hacer
para
el lugar. Finalizamos pulsando&nbsp;<img style="width: 34px; height: 36px;" alt="Intro" title="Intro" src="../imagenes/teclaintro.png"> un
par de veces.</li>

</ul>

<p class="avisos">La edici&oacute;n de plantillas en
la pesta&ntilde;a <img style="width: 65px; height: 20px;" alt="Normal" src="../imagenes/pestananormal.png"> es
bastante inc&oacute;moda, por lo que te recomiendo que pases a la
pesta&ntilde;a <img style="width: 105px; height: 20px;" alt="Etiquetas HTML" src="../imagenes/pestanaetiquetashtml.png">
donde te ser&aacute; mucho m&aacute;s sencillo seleccionar los
diferentes elementos de la p&aacute;gina e insertar nuevas
&aacute;reas editables.</p>

<ul>

  <li>Inserta ahora una l&iacute;nea horizontal y
comprobar&aacute;s que autom&aacute;ticamente se ha insertado
un nuevo p&aacute;rrafo que ha heredado el area editable "fecha"
encerrada dentro de un par de etiquetas <code>&lt;span&gt;.
    </code>Si has seguido los pasos que hemos propuesto hasta
ahora
la apariencia ser&aacute; similar a lo que muestra la siguiente
imagen:</li>

</ul>

<p class="centrado"><img style="width: 607px; height: 299px;" alt="Apariencia de la plantilla que se est&aacute; elaborando" title="Apariencia de la plantilla que se est&aacute; elaborando" src="imagenes/plantillapaso1.png"></p>

<ul>

  <li>Pulsa sobre la etiqueta <img style="width: 16px; height: 20px;" alt="P" src="imagenes/etiquetap.png"> que se acaba de crear y
despliega el selector de formatos de p&aacute;rrafo para
convertirla en un <span class="refmenu">contenedor
gen&eacute;rico (div)</span></li>

  <li>Se&ntilde;ala ahora la etiqueta&nbsp;<img style="width: 38px; height: 16px;" alt="span" src="imagenes/etiquetaspan.png"> que ha quedado junto
a&nbsp;<img style="width: 16px; height: 24px;" alt="div" src="imagenes/etiquetadiv.png"> y elim&iacute;nala.
Deber&iacute;a quedar s&oacute;lo la etiqueta&nbsp;<img style="width: 16px; height: 24px;" alt="div" src="imagenes/etiquetadiv.png">. Con esto hemos creado un
contenedor gen&eacute;rico en el que vamos a situar en la zona
izquierda un espacio para la foto, haciendo que los comentarios
respecto a la misma fluyan por la zona derecha.</li>

  <li>Para diferenciar esta zona del resto de la
p&aacute;gina
le adjudicaremos un color de fondo como ya sabemos: bot&oacute;n
derecho sobre <code>&lt;div&gt;</code> en la barra
de estado<span style="font-weight: bold;">&nbsp;</span><span class="refmenu">estilos incrustados&nbsp;</span><img class="refmenu" style="width: 14px; height: 13px;" alt="a continuaci&oacute;n" src="../imagenes/flechamenu.png"><span class="refmenu"> propiedades del fondo</span> y
seleccionar un color para el fondo.</li>

  <li><img class="flotder" style="width: 425px; height: 393px;" alt="Panel de propiedades de caja" src="imagenes/propiedadesdecaja.png">Ahora creamos una nueva
&aacute;rea editable para incluir la foto. Como se
tratar&aacute; de una imagen utilizaremos el tipo <span class="refmenu">texto fluido</span>.&nbsp;</li>

  <li>Vamos a suponer que nuestras im&aacute;genes van a
tener
un tama&ntilde;o de 180 p&iacute;xeles de alto x 240 de alto,
as&iacute; que vamos a aplicarle estilos al &aacute;rea que se
acaba de crear.&nbsp;</li>

  <li>Como ya sabemos pulsamos sobre la etiqueta <code>&lt;span&gt;</code>
de la barra de estado con el bot&oacute;n derecho y elegiremos <span style="font-weight: bold;"></span><span class="refmenu">estilos incrustados&nbsp;</span><img class="refmenu" style="width: 14px; height: 13px;" alt="a continuaci&oacute;n" src="../imagenes/flechamenu.png"><span class="refmenu"> propiedades de la caja</span> para
indicar all&iacute; los&nbsp;valores que se muestran en la
imagen y que har&aacute;n que, adem&aacute;s de fijar las
dimensiones, la zona flote en a la izquierda y deje un margen de 10
p&iacute;xeles por su derecha que la separen del texto que luego
iremos escribiendo.</li>

  <li>Ahora saldremos fuera de la zona definida por <code>&lt;span&gt;</code>.
La forma m&aacute;s c&oacute;moda de hacerlo es
se&ntilde;alando la etiqueta <img style="width: 38px; height: 16px;" alt="span" src="imagenes/etiquetaspan.png"> para que se marque toda la
zona y pulsando la tecla de cursor <img style="width: 26px; height: 27px;" alt="hacia la derecha" title="hacia la derecha" src="../imagenes/tecladerecha.png">.</li>

  <li>Nos cercioramos de que el tipo de p&aacute;rrafo
seleccionado es p&aacute;rrafo y tecleamos la palabra
"Caracter&iacute;sticas: ". No estar&iacute;a de m&aacute;s
que utiliz&aacute;ramos alguna opci&oacute;n de la barra de
formato para resaltarla visualmente ya que ser&aacute; el
encabezamiento de los datos que tendr&aacute;n que cumplimentar los
alumnos.&nbsp;</li>

  <li>A&ntilde;adimos un &aacute;rea editable que, en
este
caso ser&aacute; de tipo bloque para que aparezca separada del
encabezamiento que acabamos de escribir. La llamamos
caracter&iacute;sticas y, cuando la tengamos creada, modificamos el
texto para que indique claramente lo que se tiene que escribir en esta
zona, p.ej.:&nbsp; "Describe
aqu&iacute; las caracter&iacute;sticas que nos sirven para
identificar esta hoja y diferenciarla de otras especies."</li>

  <li>Siguiendo el mismo procedimiento que en estos dos
&uacute;ltimos pasos a&ntilde;adimos otros dos bloques que
recojan los ep&iacute;grafes para identificaci&oacute;n y
especies similares.</li>

  <li>Por si acaso los textos que se escriben quedan demasiado
cortos podemos tener la precauci&oacute;n de a&ntilde;adir, al
final del texto en el que se indica lo que hay que escribir en la zona
de especies similares un salto de l&iacute;nea absoluto que olvide
la flotaci&oacute;n de la imagen y coloque el siguiente elemento
por debajo de ella. Lo haremos mediante <span class="refmenu">insertar
    </span><img class="refmenu" style="width: 14px; height: 13px;" alt="a continuaci&oacute;n" src="../imagenes/flechamenu.png"><span class="refmenu">
    </span><span class="refmenu">ruptura tras las
im&aacute;genes (&lt;br clear="all"&gt;)</span></li>

  <li><span class="refmenu"></span>La
apariencia
de este bloque ser&iacute;a similar a lo siguiente:</li>

</ul>

<p class="centrado"><img style="width: 650px; height: 333px;" alt="Apariencia de la plantilla tras lo realizado hasta el momento" title="Apariencia de la plantilla tras lo realizado hasta el momento" src="imagenes/plantillapaso2.png"></p>

<ul>

  <li>Para a&ntilde;adir una nueva l&iacute;nea
horizontal
que sirva de separador visual seleccionaremos la etiqueta <img style="width: 16px; height: 24px;" alt="div" src="imagenes/etiquetadiv.png"> que encierra todo el bloque
y pulsaremos&nbsp;<img style="width: 26px; height: 27px;" alt="hacia la derecha" title="hacia la derecha" src="../imagenes/tecladerecha.png"> para colocarnos a
continuaci&oacute;n. Una vez fuera de la divisi&oacute;n
principal utilizaremos <span class="refmenu">insertar </span><img class="refmenu" style="width: 14px; height: 13px;" alt="a continuaci&oacute;n" src="../imagenes/flechamenu.png"><span class="refmenu"> </span><span class="refmenu">l&iacute;nea&nbsp;horizontal</span>.</li>

  <li>Por fin, para completar a&ntilde;adimos un nuevo
p&aacute;rrafo donde teclearemos "Identificaci&oacute;n
realizada por: " y completaremos con un <span class="refmenu">&aacute;rea
editable</span> de tipo <span class="refmenu">texto
fluido</span> a la que podemos denominar "nombre"</li>

  <li>Puedes ver un <a href="javascript:void(0)" onclick="window.open('identificaciondehojas.html','','statusbar=0,menubar=0,toolbar=0,top=0,left=0,width=780,height=620')">ejemplo</a>
de p&aacute;gina html creada apartir de una plantilla como la que
se ha creado en esta actividad.</li>

</ul>

</div>

<p>Una vez que se ha creado una plantilla podemos utilizarla para
crear
nuevos documentos, para lo que tendremos que utilizar cualquiera de los
m&eacute;todos que nos permiten abrir el panel de opciones.</p>

<ul>

  <li>la opci&oacute;n de men&uacute; <span class="refmenu">archivo&nbsp;</span><img class="refmenu" style="width: 14px; height: 13px;" alt="a continuaci&oacute;n" src="../imagenes/flechamenu.png"><span class="refmenu"> nuevo</span>&nbsp;</li>

  <li>la pulsaci&oacute;n de teclas&nbsp; <img style="width: 36px; height: 26px;" alt="Ctrl" src="../imagenes/teclactrl.png"> + <img style="width: 26px; height: 27px;" alt="ENE" src="../imagenes/teclan.png">&nbsp;</li>

  <li>la posibilidad <span class="refmenu">m&aacute;s
opciones</span> en el desplegable que acompa&ntilde;a al
icono <img style="width: 58px; height: 40px;" alt="Nuevo" src="../imagenes/botonnuevo.png"> de la barra de
herramientas.&nbsp;</li>

</ul>

<p>Elegiremos entonces un nuevo documento basado en una plantilla
y
seleccionaremos la plantilla que queremos utilizar tras lo cual se
abrir&aacute; una pesta&ntilde;a en la que podremos realizar
modificaciones en las &aacute;reas editables que se hayan
introducido.
Si las &aacute;reas editables son del tipo <span class="refmenu">texto
fluido</span> y se pulsa la tecla <img style="width: 34px; height: 36px;" alt="Intro" title="Intro" src="../imagenes/teclaintro.png"> se
duplicar&aacute; el &aacute;rea editable independientemente de
que hayamos seleccionado o no la opci&oacute;n <span class="refmenu">el area&nbsp;puede repetirse</span>
al crear la plantilla. En caso de que se tratara de un &aacute;rea
de
tipo bloque se producir&aacute; un salto de l&iacute;nea si el
formato
del p&aacute;rrafo era <span class="refmenu">texto
del cuerpo</span>.</p>

<p>Cuando se completa el contenido de la nueva p&aacute;gina
basada en
la plantilla puede guardarse la p&aacute;gina con el nombre que
deseemos adjudicarle sin preocuparnos de m&aacute;s.
&nbsp;Aunque esto
no tendr&aacute; ninguna repercusi&oacute;n en los navegadores
se
mantendr&aacute;n las etiquetas que marcan las &aacute;reas
editables.
Realmente ser&iacute;a m&aacute;s correcto, una vez completado
el
contenido, utilizar la opci&oacute;n de men&uacute; <span class="refmenu">editar&nbsp;</span><img class="refmenu" style="width: 14px; height: 13px;" alt="a continuaci&oacute;n" src="../imagenes/flechamenu.png"><span class="refmenu"> separar de la plantilla</span></p>

<h3><a name="plantillasprologos"></a>Aplicar
las plantillas para corregir un error de N|VU</h3>

<p>En la versi&oacute;n actual del programa (1.0) hay un
error de
cierta importancia en la creaci&oacute;n de documentos <acronym title="HyperText Markup Language">HTML</acronym>: el
pr&oacute;logo donde se indica la&nbsp;<acronym title="Definici&oacute;n del Tipo de Documento">DTD</acronym>
est&aacute; incompleto porque no
incluye el <acronym title="Uniform Resource Locator (localizador uniforme de recurso)">URL</acronym>
de referencia. Esto puede tener repercusi&oacute;n en la
forma que algunos navegadores puedan construir la p&aacute;gina por
lo
que ser&iacute;a necesario corregirlo, pero el problema
est&aacute; en
que N|VU no permite modificar ese pr&oacute;logo (aunque se
modifique
en la pesta&ntilde;a <img style="width: 99px; height: 21px;" alt="C&oacute;digo fuente" src="../imagenes/pestanacodigofuente.png">
los cambios se pierden aunque guardemos la p&aacute;gina)</p>

<p>Una forma de corregirlo es crear una plantilla nueva y
guardarla
para modificar&nbsp;el c&oacute;digo del documento base con un
editor
de texto externo. Una vez corregido el error podemos
guardar&nbsp;el archivo con la extensi&oacute;n <acronym title="mozilla template">mzt</acronym> para poder
utilizarlo como plantilla.</p>

<p>Si aplicamos esta correcci&oacute;n, la forma adecuada de
crear
nuevos documentos ser&iacute;a hacerlo a partir de la plantilla que
acabamos de crear.</p>

<p class="avisos">Como en este caso no hemos definido
&aacute;reas editables ser&iacute;a muy recomendable empezar
utilizando&nbsp;<span class="refmenu">editar&nbsp;</span><img class="refmenu" style="width: 14px; height: 13px;" alt="a continuaci&oacute;n" src="../imagenes/flechamenu.png"><span class="refmenu"> separar de la plantilla</span>.
Aunque se podr&iacute;a trabajar sin hacerlo podr&iacute;amos
encontrar alg&uacute;n problema para especificar el tipo de
p&aacute;rrafo de lo primero que escribi&eacute;ramos si no lo
cambiamos antes de empezar a teclear.&nbsp;</p>

<p>En la carpeta plantillas del curso tienes dos plantillas
denominadas <a href="html4transitional.mzt">html4transitional.mzt</a>
y <a href="html4strict.mzt">html4strict.mzt</a> que
tienen corregido ese error. Para los documentos <acronym title="acr&oacute;nimo de eXtensible HiperText Markup Language">XHTML</acronym>,
tanto si la <acronym title="Definici&oacute;n del Tipo de Documento">DTD</acronym>
es de tipo&nbsp;<span lang="en">transitional</span>
como&nbsp;<span lang="en">strict</span> no
ha sido necesario elaborar plantillas alternativas porque los
pr&oacute;logos son correctos seg&uacute;n las especificaciones
del <acronym title="World Wide Web Consortium">W3C</acronym>.</p>

<div class="practicas">
<img class="numact" style="width: 29px; height: 29px; float: left;" alt="Actividad 60" title="Actividad 60" src="../imagenes/numeracion/sesenta.gif">
<ul>

  <li>Crea un documento
nuevo de tipo&nbsp;<acronym title="HyperText Markup Language">HTML</acronym>
    <span lang="en">transitional</span> utilizando
el procedimiento habitual</li>

  <li>Crea ahora otro documento nuevo utilizando la plantilla
    <em>html4transitional.mzt</em> que encontrar&aacute;s en el CD. Compara los c&oacute;digos de ambas
p&aacute;ginas y localiza la diferencia en el pr&oacute;logo
del documento.</li>

</ul>

</div>

<br>

</body>
</html>
