<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html lang="es-es">
<head>

  <meta content="text/html; charset=ISO-8859-1" http-equiv="content-type">
  <title>Accesibilidad</title>


  <meta content="Ra&uacute;l Luna" name="author">

  <link rel="stylesheet" type="text/css" href="../nvu2005.css">

<!-- parche de compatibilización con CSS 2 para navegadores microsoft --><!--[if lt IE 7]> <script src="../ie7/ie7-standard-p.js" type="text/javascript"></script> <![endif]-->
</head>


<body>

<div id="localizador">
<p>Accesibilidad</p>

</div>
<div id="flechadcha">
<a href="directrices.htm" title="avanzar"><img src="../Images/flechadcha.gif" border="0"></a>
</div>
<div id="flechaizq">
<a href="../recursos/recursos8.html" title="retroceder"><img src="../Images/flechaizq.gif" border="0"></a>
</div>


<div id="contenido">
<h2>Accesibilidad</h2>
<p>El crecimiento de la WEB ha hecho que se convierta,
posiblemente, en una de las principales fuentes de
informaci&oacute;n de las que disponemos en el momento actual.
Ahora bien, no estar&iacute;a de m&aacute;s pararnos a pensar
que el plural que acabo de utilizar engloba, especialmente en el
contexto en que se escribe este documento, a un grupo de
poblaci&oacute;n al que podr&iacute;amos atribuirle las
siguientes caracter&iacute;sticas:</p>

<ul>

  <li> dispone de unas m&aacute;quinas relativamente potentes
y actualizadas.</li>

  <li>posee igualmente unos conocimientos previos que le permiten
suplir las posibles deficiencias que afecten a la claridad de la
informaci&oacute;n presentada, tanto en lo referente a contenido
como en cuanto a estructura.</li>

  <li>nuestras capacidades perceptivas, tanto en el aspecto
auditivo como visual, no est&aacute;n deterioradas m&aacute;s
all&aacute; de lo que el propio paso del tiempo las pueda haber
afectado teniendo en cuenta que la edad oscilar&aacute;, en la
mayor&iacute;a de los casos, entre 30 y 50 a&ntilde;os.</li>

  <li>algo similar podemos afirmar respecto a las capacidades
motoras y manipulativas.</li>

</ul>

<p>Como suele ocurrir habitualmente tendemos a establecer los
par&aacute;metros que pueden definir nuestra situaci&oacute;n
como lo habitual, olvidando en muchos casos la existencia de otros
grupos humanos afectados por situaciones que pueden llegar a ser muy
distantes de nuestros criterios cotidianos.</p>

<p>Bastar&aacute; con formular las condiciones anteriores en
negativo para darnos cuenta de que el acceso a los contenidos de la WEB
puede convertirse en una tarea bastante m&aacute;s dificultosa de
lo que pod&iacute;amos imaginar.</p>

<p>La siguientes palabras de Tim Berners Lee, creador de Internet
y director del World Wide Web Consortium (W3C) encabezan la
secci&oacute;n de accesibilidad de dicho organismo (WAI-Web
Accessibility Initiative):</p>

<blockquote>
  <q>El poder de la red est&aacute; en su
universalidad. El acceso de todos y cada uno sin que influyan las
deficiencias es un aspecto esencial.</q>
</blockquote>

<p>Del trabajo de la WAI han surgido una serie de documentos que
establecen unas pautas y unos criterios de comprobaci&oacute;n de
las mismas para obtener webs accesibles. Dichos documentos constituyen
una especificaci&oacute;n que se encuentra en su versi&oacute;n
1.0 cuyas siglas son WCAG (Web Content Accessibility Guidelines -
Directrices de Accesibilidad para el Contenido WEB)</p>

<p>No todas las pautas afectan en el mismo grado a la
accesibilidad, por lo que se aplican con tres diferentes prioridades,
de forma que los criterios de prioridad 1 ser&iacute;an de
cumplimiento pr&aacute;cticamente obligatorio para aumentar de
forma muy significativa el grado de accesibilidad de la
p&aacute;gina en la que se cumplen. En grado decreciente en cuanto
a su incidencia est&aacute;n los criterios de prioridad 2 y, por
&uacute;ltimo los de prioridad 3 que garantizar&iacute;an que
la p&aacute;gina ser&iacute;a accesible para la totalidad de
los visitantes independientemente de los dispositivos que utilicen o
las discapacidades motoras o sensoriales que puedan padecer. </p>

<p>En funci&oacute;n del cumplimiento de dichas pautas se han
creado unos logotipos de certificaci&oacute;n de conformidad con la
especificaci&oacute;n</p>

<p><img class="imgcentr" style="width: 88px; height: 31px;" src="../imagenes/wcag1A.gif" alt="Logotipo de conformidad WAI Nivel A">Nivel "A" de
Conformidad: Se han satisfecho todos los
puntos de verificaci&oacute;n de Prioridad 1.</p>

<p><img class="imgcentr" style="width: 88px; height: 31px;" src="../imagenes/wcag1AA.gif" alt="Logotipo de conformidad WAI Nivel Doble A">Nivel
"Doble-A" de Conformidad: Se han satisfecho todos
los puntos de verificaci&oacute;n de Prioridad 1 y 2</p>

<p><img class="imgcentr" style="width: 88px; height: 31px;" src="../imagenes/wcag1AAA.gif" alt="Logotipo de conformidad WAI Nivel Triple A">Nivel
"Triple-A" de Conformidad: Se han satisfecho todos
los puntos de verificaci&oacute;n de Prioridad 1, 2, y 3</p>

<br>

<p>&nbsp;</p>

<p>&nbsp;</p>

<blockquote>&nbsp;</blockquote>

<p>&nbsp;</p>

<p></p>

</body>
</html>
