<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN"> 
<html lang="es">

<head>

<title>Algunos recursos en la red</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">

<link href="../estilo.css" rel="stylesheet" type="text/css">
<script type="text/javascript" language="JavaScript">
<!-- 
  function cargalogo(nombre) {
   parent.arriba.location.href=nombre;
}
// -->
</script>
<noscript><p>
<br />Muestra una pestaña superior para indicar que estamos en la sección que muestra las Directrices de Accesibilidad<br />
</p></noscript>

</head>
<body onload="cargalogo('t29.htm');">
<p>Directrices de Accesibilidad para el Contenido en la Web 
</p>
<dl>
  <dt><strong>1 - Proporcione alternativas equivalentes para el contenido visual 
    y sonoro </strong> </dt>
  <dd>Incorporando un contenido que, cuando sea presentado al usuario, cumpla 
    esencialmente la misma función o propósito que el contenido visual o sonoro. 
    En ocasiones tendr&aacute; un car&aacute;cter primordialmente descriptivo 
    del contenido (Ej.: descripci&oacute;n de una imagen o transcripci&oacute;n 
    de un texto) mientras que en otras los esencial ser&aacute; informar de la 
    funci&oacute;n (D&eacute;: Notificar el destino al que se dirigir&aacute; 
    la pulsaci&oacute;n sobre un enlace soportado por un gr&aacute;fico)</dd>
  <dt><strong>2 - No conf&iacute;e s&oacute;lo en el color</strong></dt>
  <dd>Habr&aacute; que asegurarse de que los textos y gráficos son comprensibles 
    cuando se vean sin color.</dd>
  <dt><strong>3 - Utilice marcadores y hojas de estilo, y h&aacute;galo apropiadamente</strong></dt>
  <dd>Marque los documentos con los elementos estructurales apropiados. Controle 
    la presentación con hojas de estilo en vez de con atributos y elementos de 
    presentación. (Los puntos de verificaci&oacute;n de esta directriz son de 
    prioridad 2)</dd>
  <dt><strong>4 - Aclare el lenguaje natural usado</strong></dt>
  <dd>Indicar con las etiquetas adecuadas para facilitar la pronunciación o interpretación 
    del texto abreviado o en idioma extranjero.</dd>
  <dt><strong>5 - Cree tablas que se transformen airosamente</strong></dt>
  <dd>Asegúrese de que las tablas tienen el marcado necesario para ser transformadas 
    por navegadores accesibles y otras aplicaciones de usuario.</dd>
  <dt><strong>6 - Aseg&uacute;rese de que las p&aacute;ginas que incluyen nuevas 
    tecnolog&iacute;as se transfiguran airosamente</strong></dt>
  <dd>Asegúrese de que las páginas son accesibles incluso cuando las tecnologías 
    más recientes no son soportadas o se deshabilitan, para lo que habr&iacute;a 
    que proporcionar versiones alternativas en el caso de que ello no sea posible.</dd>
  <dt><strong>7 - Garantice al usuario el control sobre los cambios del contenido 
    tempo-sensible</strong></dt>
  <dd>Se trata de proporcionar al usuario procedimientos accesibles para que puedan 
    ser pausados o detenidos los contenidos o páginas que se mueven, parpadean, 
    se desplazan o se actualizan automáticamente. </dd>
  <dt><strong>8 - Garantice la accesibilidad directa de las interfaces de usuario 
    incrustadas </strong> </dt>
  <dd>Asegúrese de que las interfaces de usuario siguen los principios del diseño 
    accesible: acceso a la funcionalidad independiente del tipo de dispositivo, 
    operabilidad a través del teclado, interfaz por voz, etc. (Esta directriz 
    se considera de prioridad 1 cuando afecta a funcionalidades importantes no 
    presentadas de forma alternativa. Si se trata de funciones poco importantes 
    pasa a ser de prioridad 2)</dd>
  <dt><strong>9 - Dise&ntilde;e para la independencia del tipo de dispositivo</strong></dt>
  <dd>Use características que permitan la activación de los elementos de la página 
    a través de diversos dispositivos de entrada.</dd>
  <dt><strong>10 - Utilice soluciones provisionales</strong></dt>
  <dd>Use soluciones de accesibilidad provisionales de manera que las ayudas técnicas 
    y los navegadores antiguos puedan funcionar correctamente.(Directriz de prioridad 
    2 y 3)</dd>
  <dt><strong>11 - Utilice las tecnolog&iacute;as y directrices del W3C</strong></dt>
  <dd>Utilice las tecnologías del W3C (de acuerdo con la especificación) y siga 
    las directrices de accesibilidad. Cuando no sea posible utilizar una tecnología 
    del W3C, o hacerlo da como resultado un material que no se transforma airosamente, 
    proporcione una versión alternativa del contenido que sea accesible.</dd>
  <dt><strong>12 - Proporcione informaci&oacute;n de contexto y orientaci&oacute;n</strong></dt>
  <dd>La funci&oacute;n de la información de contexto y orientación ser&aacute; 
    ayudar a los usuarios a entender los elementos o páginas complejas. </dd>
  <dt><strong>13 - Proporcione mecanismos de navegaci&oacute;n claros</strong></dt>
  <dd>El objetivo es incrementar la probabilidad de que una persona encuentre 
    lo que está buscando en el sitio para lo que se recomienda incorporar información 
    orientativa, barras de navegación, un mapa del sitio, etc. (Se trata de una 
    directriz de prioridad 2 y 3)</dd>
  <dt><strong>14 - Aseg&uacute;rese de que los documentos sean claros y sencillos</strong></dt>
  <dd>La utilización de el lenguaje más claro y sencillo posible, unida a la aplicación del mismo principio en cuanto al estilo y diseño general son las bases de esta directriz.</dd>
</dl>
<p>La documentación al respecto, incluyendo las pautas de comprobación para cada 
  una de las directrices y las técnicas necesarias se encuentra publicada en Internet. 
  Obviamente puedes recurrir a las fuentes <a href="http://www.w3.org/WAI/" target="_blank">originales</a> 
  que son las &uacute;nicas que tienen el respaldo pleno del W3C, pero que tendr&aacute;s 
  que leer en ingl&eacute;s. Si lo prefieres puedes recurrir a las traducciones 
  de los diferentes documentos que se han ido realizando que, si bien no tienen 
  autorizaci&oacute;n oficial del W3C, pueden considerarse plenamente fiables. 
  De hecho puedes encontrarlas a partir de la p&aacute;gina del Seminario de Iniciativas 
  sobre Discapacidad y Accesibilidad en la Red <a href="http://www.sidar.org">(SIDAR)</a> 
  impulsado y patrocinado por el Real Patronato sobre Discapacidad, de donde se 
  han obtenido las referencias para elaborar esta introducci&oacute;n a la accesibilidad.</p>
<p>Una primera aproximaci&oacute;n para el trabajo puedes ser la siguiente gu&iacute;a 
</p>
<p>Gu&iacute;a breve para crear sitios Web accesibles.</p>
<ol>
  <li>Im&aacute;genes y animaciones: Use texto alternativo (atributo alt) para 
    describir la funci&oacute;n de los elementos visuales. </li>
  <li>Mapas de imagen: Use mapas de cliente y texto alternativo para las zonas 
    activas. </li>
  <li>Multimedia: Facilite subt&iacute;tulos y trascripci&oacute;n de los ficheros 
    de sonido, descripci&oacute;n de los v&iacute;deos y versiones accesibles 
    en el caso de usar formatos no accesibles. </li>
  <li>Enlaces de hipertexto: Use texto que tenga sentido cuando se lea fuera de 
    contexto. Por ejemplo, no usar &quot;pincha aqu&iacute;&quot;. </li>
  <li>Organizaci&oacute;n de las p&aacute;ginas: Use encabezados (H1, H2, H3,...), 
    listas y estructura consistente. Use Hojas de Estilo en Cascada (CSS) para 
    maquetaci&oacute;n y estilo, donde sea posible. </li>
  <li>Gr&aacute;ficos de datos: Resuma o use el atributo longdesc. </li>
  <li>Scripts, applets y plug-ins: Ofrezca alternativas accesibles en el caso 
    de que las caracter&iacute;sticas activas no sean accesibles o no tengan soporte. 
  </li>
  <li>Marcos (Frames): Etiquete con los atributos title o name. </li>
  <li>Tablas: Real&iacute;celas de manera que se puedan leer l&iacute;nea a l&iacute;nea. 
    Incluya un resumen. Evite el uso de tablas para dar formato a las p&aacute;ginas. 
  </li>
  <li>Revise su trabajo: Valide el c&oacute;digo HTML. Use herramientas de evaluaci&oacute;n 
    y navegadores s&oacute;lo-texto para verificar la accesibilidad. </li>
</ol>
<p>&nbsp;</p>
<p>&nbsp;</p>
</body>

</html>


<body>

</body>
</html>
