<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html lang="es-es">
<head>

  <meta content="text/html; charset=ISO-8859-1" http-equiv="content-type">
  <title>Directrices</title>


  <meta content="Ra&uacute;l Luna" name="author">

  <link rel="stylesheet" type="text/css" href="../nvu2005.css">

<!-- parche de compatibilización con CSS 2 para navegadores microsoft --><!--[if lt IE 7]> <script src="../ie7/ie7-standard-p.js" type="text/javascript"></script> <![endif]-->
</head>


<body>

<div id="localizador">
<p>Accesibilidad&gt;&gt;Directrices</p>

</div>
<div id="flechadcha">
<a href="pautas.htm" title="avanzar"><img src="../Images/flechadcha.gif" border="0"></a>
</div>
<div id="flechaizq">
<a href="accesibilidad.htm" title="retroceder"><img src="../Images/flechaizq.gif" border="0"></a>
</div>


<div id="contenido">
<h2>Directrices de Accesibilidad para el Contenido en la Web </h2>

<dl>

  <dt><strong>1 - Proporcione alternativas equivalentes
para el contenido visual y sonoro </strong> </dt>

  <dd>Incorporando un contenido que, cuando sea presentado al
usuario, cumpla esencialmente la misma funci&oacute;n o
prop&oacute;sito que el contenido visual o sonoro. En ocasiones
tendr&aacute; un car&aacute;cter primordialmente descriptivo
del contenido (Ej.: descripci&oacute;n de una imagen o
transcripci&oacute;n de un texto) mientras que en otras los
esencial ser&aacute; informar de la funci&oacute;n (Ej.:
Notificar el destino al que se dirigir&aacute; la
pulsaci&oacute;n sobre un enlace soportado por un
gr&aacute;fico)</dd>

  <dt><strong>2 - No conf&iacute;e s&oacute;lo en
el color</strong></dt>

  <dd>Habr&aacute; que asegurarse de que los textos y
gr&aacute;ficos son comprensibles cuando se vean sin color.</dd>

  <dt><strong>3 - Utilice marcadores y hojas de estilo, y
h&aacute;galo apropiadamente</strong></dt>

  <dd>Marque los documentos con los elementos estructurales
apropiados. Controle la presentaci&oacute;n con hojas de estilo en
vez de con atributos y elementos de presentaci&oacute;n. (Los
puntos de verificaci&oacute;n de esta directriz son de prioridad 2)</dd>

  <dt><strong>4 - Aclare el lenguaje natural usado</strong></dt>

  <dd>Marcar con las etiquetas adecuadas para facilitar la
pronunciaci&oacute;n o interpretaci&oacute;n del texto
abreviado o en idioma extranjero.</dd>

  <dt><strong>5 - Cree tablas que se transformen airosamente</strong></dt>

  <dd>Aseg&uacute;rese de que las tablas tienen el marcado
necesario para ser transformadas por navegadores accesibles y otras
aplicaciones de usuario.</dd>

  <dt><strong>6 - Aseg&uacute;rese de que las
p&aacute;ginas que incluyen nuevas tecnolog&iacute;as se
transfiguran airosamente</strong></dt>

  <dd>Aseg&uacute;rese de que las p&aacute;ginas son
accesibles incluso cuando las tecnolog&iacute;as m&aacute;s
recientes no son soportadas o se deshabilitan, para lo que
habr&iacute;a que proporcionar versiones alternativas en el caso de
que ello no sea posible.</dd>

  <dt><strong>7 - Garantice al usuario el control sobre los
cambios del contenido tempo-sensible</strong></dt>

  <dd>Se trata de proporcionar al usuario procedimientos
accesibles para que puedan ser pausados o detenidos los contenidos o
p&aacute;ginas que se mueven, parpadean, se desplazan o se
actualizan autom&aacute;ticamente. </dd>

  <dt><strong>8 - Garantice la accesibilidad directa de las
interfaces de usuario incrustadas </strong> </dt>

  <dd>Aseg&uacute;rese de que las interfaces de usuario
siguen los principios del dise&ntilde;o accesible: acceso a la
funcionalidad independiente del tipo de dispositivo, operabilidad a
trav&eacute;s del teclado, interfaz por voz, etc. (Esta directriz
se considera de prioridad 1 cuando afecta a funcionalidades importantes
no presentadas de forma alternativa. Si se trata de funciones poco
importantes pasa a ser de prioridad 2)</dd>

  <dt><strong>9 - Dise&ntilde;e para la independencia
del tipo de dispositivo</strong></dt>

  <dd>Use caracter&iacute;sticas que permitan la
activaci&oacute;n de los elementos de la p&aacute;gina a
trav&eacute;s de diversos dispositivos de entrada.</dd>

  <dt><strong>10 - Utilice soluciones provisionales</strong></dt>

  <dd>Use soluciones de accesibilidad provisionales de manera que
las ayudas t&eacute;cnicas y los navegadores antiguos puedan
funcionar correctamente.(Directriz de prioridad 2 y 3)</dd>

  <dt><strong>11 - Utilice las tecnolog&iacute;as y
directrices del <acronym title="World Wide Web Consortium">W3C</acronym></strong></dt>

  <dd>Utilice las tecnolog&iacute;as del <acronym title="World Wide Web Consortium">W3C</acronym> (de
acuerdo con la especificaci&oacute;n) y siga las directrices de
accesibilidad. Cuando no sea posible utilizar una tecnolog&iacute;a
del&nbsp;<acronym title="World Wide Web Consortium">W3C</acronym>,
o hacerlo da como resultado un material que no se transforma
airosamente, proporcione una versi&oacute;n alternativa del
contenido que sea accesible.</dd>

  <dt><strong>12 - Proporcione informaci&oacute;n de
contexto y orientaci&oacute;n</strong></dt>

  <dd>La funci&oacute;n de la informaci&oacute;n de
contexto y orientaci&oacute;n ser&aacute; ayudar a los usuarios
a entender los elementos o p&aacute;ginas complejas. </dd>

  <dt><strong>13 - Proporcione mecanismos de
navegaci&oacute;n claros</strong></dt>

  <dd>El objetivo es incrementar la probabilidad de que una
persona encuentre lo que est&aacute; buscando en el sitio para lo
que se recomienda incorporar informaci&oacute;n orientativa, barras
de navegaci&oacute;n, un mapa del sitio, etc. (Se trata de una
directriz de prioridad 2 y 3)</dd>

  <dt><strong>14 - Aseg&uacute;rese de que los
documentos sean claros y sencillos</strong></dt>

  <dd>La
utilizaci&oacute;n de el lenguaje m&aacute;s claro y sencillo
posible, unida a la
aplicaci&oacute;n del mismo principio en cuanto al estilo y
dise&ntilde;o general son
las bases de esta directriz.</dd>

</dl>

<p>La documentaci&oacute;n al respecto, incluyendo las pautas
de comprobaci&oacute;n para cada una de las directrices y las
t&eacute;cnicas necesarias se encuentra publicada en Internet.
Obviamente puedes recurrir a las fuentes <a href="http://www.w3.org/WAI/" target="_blank">originales</a>
que son las &uacute;nicas que tienen el respaldo pleno del&nbsp;<acronym title="World Wide Web Consortium">W3C</acronym>, pero
que tendr&aacute;s que leer en ingl&eacute;s. Si lo prefieres
puedes recurrir a las traducciones de los diferentes documentos que se
han ido realizando que, si bien no tienen autorizaci&oacute;n
oficial del&nbsp;<acronym title="World Wide Web Consortium">W3C</acronym>,
pueden considerarse plenamente fiables. De hecho puedes encontrarlas a
partir de la p&aacute;gina del Seminario de Iniciativas sobre
Discapacidad y Accesibilidad en la Red <a href="http://www.sidar.org/">(SIDAR)</a> impulsado y
patrocinado por el Real Patronato sobre Discapacidad, de donde se han
obtenido las referencias para elaborar esta introducci&oacute;n a
la accesibilidad.</p>

<p>Una primera aproximaci&oacute;n para el trabajo puedes ser
la siguiente gu&iacute;a </p>

<h3>Gu&iacute;a breve para crear sitios Web accesibles</h3>

<ol>

  <li>Im&aacute;genes y animaciones: Use texto alternativo
(atributo <code>alt</code>) para describir la
funci&oacute;n de los elementos visuales. </li>

  <li>Mapas de imagen: Use mapas de cliente y texto alternativo
para las zonas activas. </li>

  <li>Multimedia: Facilite subt&iacute;tulos y
trascripci&oacute;n de los ficheros de sonido,
descripci&oacute;n de los v&iacute;deos y versiones accesibles
en el caso de usar formatos no accesibles. </li>

  <li>Enlaces de hipertexto: Use texto que tenga sentido cuando
se lea fuera de contexto. Por ejemplo, no usar "pincha
aqu&iacute;". </li>

  <li>Organizaci&oacute;n de las p&aacute;ginas: Use
encabezados (<code>h1</code>, <code>h2</code>,
    <code>h3</code>,...), listas y estructura consistente.
Use Hojas de Estilo en Cascada (<acronym title="Cascading Style Sheets">CSS</acronym>) para
maquetaci&oacute;n y estilo, donde sea posible. </li>

  <li>Gr&aacute;ficos de datos: Resuma o use el atributo <code>longdesc</code>.
  </li>

  <li><span lang="en">Scripts, applets</span> y <span lang="en">plug-ins</span>: Ofrezca alternativas
accesibles en el caso de que las caracter&iacute;sticas activas no
sean accesibles o no tengan soporte. </li>

  <li>Marcos (<span lang="en">Frames</span>):
Etiquete con los atributos title o name. </li>

  <li>Tablas: Real&iacute;celas de manera que se puedan leer
l&iacute;nea a l&iacute;nea. Incluya un resumen. Evite el uso
de tablas para dar formato a las p&aacute;ginas. </li>

  <li>Revise su trabajo: Valide el c&oacute;digo <acronym title="HyperText Markup Language">HTML</acronym>. Use
herramientas de evaluaci&oacute;n y navegadores
s&oacute;lo-texto para verificar la accesibilidad. </li>

</ol>

<p>&nbsp;</p>

<p>&nbsp;</p>
</div>
</body>
</html>
