<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html lang="es-es">
<head>


  
  <meta content="text/html; charset=ISO-8859-1" http-equiv="content-type">

  


  
  <title>Programas y recursos</title>
  <meta content="Ra&uacute;l Luna" name="author">


  
  <link rel="stylesheet" type="text/css" href="../nvu2005.css">
<!-- parche de compatibilización con CSS 2 para navegadores microsoft --><!--[if lt IE 7]> <script src="../ie7/ie7-standard-p.js" type="text/javascript"></script> <![endif]-->
</head>


<body>

<div id="localizador" style="margin:top ">
<p>Accesibilidad&gt;&gt;Programas y recursos</p>

</div>
<div id="flechadcha">
<a href="../bugs/errores.html" title="avanzar"><img src="../Images/flechadcha.gif" border="0"></a>
</div>
<div id="flechaizq">
<a href="directrices.htm" title="retroceder"><img src="../Images/flechaizq.gif" border="0"></a>
</div>


<div id="contenido">

<h2>Programas y recursos sobre accesibilidad web</h2>

<p>Una de las recomendaciones que se incluye en los textos del <acronym title="Web Accessibility Initiative">WAI</acronym> es la de complementar 
  las herramientas autom&aacute;ticas de revisi&oacute;n con un an&aacute;lisis 
  manual. Esto se debe a que las herramientas de revisi&oacute;n autom&aacute;tica 
  no tienen capacidad para asegurar categ&oacute;ricamente si un determinado componente 
  de la p&aacute;gina cumple o no ciertos puntos de verificaci&oacute;n de las 
  directrices. Un programa de este tipo localizar&aacute; inequ&iacute;vocamente 
  la ausencia del atributo <strong>alt </strong> en una imagen y lo marcar&aacute; 
  para su correcci&oacute;n. No podr&aacute;, sin embargo, valorar si el texto 
  incluido en un atributo <strong>alt</strong> cumple su funci&oacute;n descriptiva 
  y dar&aacute; como v&aacute;lida el elemento respecto a ese criterio por el 
  mero hecho de la existencia. Ser&iacute;a lo que ocurrir&iacute;a si las im&aacute;genes 
  de unas flechas que se utilicen como indicadores de v&iacute;nculos para navegar 
  por un conjunto de p&aacute;ginas llevan un atributo alt del tipo "pincha 
  aqu&iacute;", lo cual no parece que aclare mucho a quien no puede ver el 
  sentido de cadad una de las flechas. </p>



<p>A pesar de ello la utilizaci&oacute;n de alguno de estos programas puede simplificar 
  considerablemente el trabajo de adaptaci&oacute;n de un sitio web para hacerlo 
  accesible, puesto que llamar&aacute; nuestra atenci&oacute;n sobre una parte 
  importante de los posibles puntos conflictivos.</p>



<p>Aunque se podr&iacute;an consultar algunas utilidades en l&iacute;nea parece 
  que resulta m&aacute;s c&oacute;modo poder disponer de una herramienta que trabaje 
  en modo local y nos permita realizar las correcciones en la fase previa a la 
  publicaci&oacute;n.</p>



<p>En la categor&iacute;a de analizador cabe destacar el programa Test de Accesibilidad 
  Web (TAW). Se trata de una aplicaci&oacute;n basada en Java que se puede descargar 
  gratuitamente e instalar en nuestra m&aacute;quina para poder analizar las p&aacute;ginas 
  en modo local. Al tratarse de una aplicaci&oacute;n Java est&aacute; disponible 
  en dos versiones: una versi&oacute;n ligera (3,2 MB) para quienes ya tienen 
  instalada en su ordenador los componentes de la m&aacute;quina virtual Java 
  y otra versi&oacute;n completa (18,4 MB)que incluye la m&aacute;quina virtual 
  Java para quienes no la tengan instalada. En la carpeta de <a href="../programas/taw" title="acceso a la carpeta de programas del CD-ROM">programas</a> 
  se han incluido los instaladores para Windows de la versi&oacute;n 3 (Existen 
  tambi&eacute;n versiones del programa que corren sobre Linux, Solaris, AIX, 
  Unix y HP-UX).</p>



<p>Un paso m&aacute;s all&aacute; va otra aplicaci&oacute;n denominada A-prompt. 
  Adem&aacute;s de realizar la comprobaci&oacute;n de criterios apunta toda una 
  serie de comprobaciones que se deber&aacute;n realizar manualmente para poder 
  certificar la accesibilidad. El propio programa va haciendo las preguntas pertinentes 
  y nos permite modificar directametne el c&oacute;digo de la p&aacute;gina cuando 
  las estamos revisando en modo local. El problema con el que nos encontramos 
  es que la aplicaci&oacute;n est&aacute; en ingl&eacute;s, aunque dado su inter&eacute;s 
  supongo que transcurrido un cierto plazo encontraremos una versi&oacute;n en 
  castellano. Se trata de una aplicaci&oacute;n gratuita cuya versi&oacute;n 1.0.6 
  se puede obtener desde <a href="http://aprompt.snow.utoronto.ca/download.html" title="Enlace para descargar la aplicaci&oacute;n">esta 
  p&aacute;gina</a> del proyecto A-prompt.</p>



<p>Por &uacute;ltimo, no estar&iacute;a de m&aacute;s contar con un navegador 
  que nos permitiera enfrentarnos a las p&aacute;ginas web con la misma herramienta 
  con que podr&iacute;a hacerlo un invidente: un lector de p&aacute;ginas web. Algunas&nbsp;alternativas pueden ser:&nbsp; </p>



<ul>

  <li>una versi&oacute;n de demostraci&oacute;n de <a href="http://www-3.ibm.com/able/dwnlds/index.html" title="Acceso para iniciar la descarga de Home Page Reader">Home 
    Page Reader</a> de IBM, que tiene el inconveniente de su gran tama&ntilde;o y que requiere trabajar con Internet Explorer 6.0, 
    pero que resulta muy interesante. </li>

  <li>una programa freeware para uso personal BrailleSurf 4. Aunque en la web 
    de los creadores afirman que existe versi&oacute;n en castellano no he podido 
    encontrar en ella, ni en ninguna de las webs dedicadas en Espa&ntilde;a a 
    la accesibilidad las referencias de descarga de dicha versi&oacute;n. Habr&aacute; 
    por tanto que visitar las p&aacute;ginas para descargar las versiones en <a href="http://www.snv.jussieu.fr/inova/bs4/telechargement.htm" title="Instrucciones para la descarga de la versi&oacute;n en franc&eacute;s">franc&eacute;s</a> 
    o <a href="http://www.snv.jussieu.fr/inova/bs4/uk/telechargement.htm" title="Instrucciones para la descarga de la versi&oacute;n en ingl&eacute;s">ingl&eacute;s</a>.</li>

  <li><span style="color: rgb(255, 0, 0);">A&ntilde;adir referencia de <a href="http://mozbraille.mozdev.org/">mozBraille</a></span></li>

</ul>



<p>Otro recurso muy interesante es el libro Dise&ntilde;o accesible de p&aacute;ginas 
  Web, de <a href="http://usuarios.discapnet.es/disweb2000/carlos.htm" title="Acceso a la p&aacute;gina con informaci&oacute;n sobre trabajos y aportaciones de Carlos Egea Garc&iacute;a relacionados con la accesibilidad">Carlos 
  Egea Garc&iacute;a</a> y <a href="http://usuarios.discapnet.es/disweb2000/ali.htm" title="Acceso a la p&aacute;gina con informaci&oacute;n sobre trabajos y aportaciones de Alicia Sarabia S&aacute;nchez relacionados con la accesibilidad">Alicia 
  Sarabia S&aacute;nchez</a>, publicado por el Ministerio de Trabajo y Asuntos 
  Sociales y la Consejer&iacute;a de Trabajo y Pol&iacute;tica Social de la Regi&oacute;n 
  de Murcia, que puede descargarse en formato pdf desde <a href="http://usuarios.discapnet.es/disweb2000/PautaWAI/LibroDisWeb.pdf">http://usuarios.discapnet.es/disweb2000/PautaWAI/LibroDisWeb.pdf</a></p>



<p>Precisamente de estos autores se ha obtenido la siguiente tabla de verificaci&oacute;n 
  de prioridades para poder tenerla como gu&iacute;a impresa.</p>



<h2>Puntos de verificaci&oacute;n Prioridad 1</h2>



<div class="table"> 
  
<table summary="Tabla de Puntos de verificaci&oacute;n de prioridad 1, organizados por categor&iacute;as y clasificacos por n&uacute;mero de punto de verificaci&oacute;n." border="1">



    <tbody>



      <tr class="checkhead" bgcolor="#33bbdd">


 
        <th> 
          
      
      
      <div align="left">En general</div>



        </th>


      <th>S&iacute; 
        </th>


      <th>No 
        </th>


      <th>N/A</th>


    </tr>



      <tr class="checkinfo">


 
        <td>Proporcione un texto equivalente para todo elemento no textual (por 
          ejemplo, a trav&eacute;s de "alt", "longdesc" o en el contenido del elemento). 
          <em>Esto incluye:</em> im&aacute;genes, representaciones gr&aacute;ficas del texto, 
          mapas de imagen, animaciones (por ejemplo, GIFs animados), "applets" 
          y objetos programados, "<abbr title="American Standard Code for Information Interchange">ASCII</abbr> 
          art", marcos, scripts, im&aacute;genes usadas como vi&ntilde;etas en las listas, espaciadores, 
          botones gr&aacute;ficos, sonidos (utilizados con o sin interacci&oacute;n), archivos 
          exclusivamente auditivos, banda sonora del v&iacute;deo y v&iacute;deos. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td>Asegure que toda la informaci&oacute;n transmitida a trav&eacute;s de los colores 
          tambi&eacute;n est&eacute; disponible sin color, por ejemplo mediante el contexto 
          o por marcadores. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td>Identifique claramente los cambios en el idioma original del texto 
          del documento y en cualquier texto equivalente (por ejemplo, leyendas). 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td> Organice el documento de forma que pueda ser le&iacute;do sin hoja de estilo. 
          Por ejemplo, cuando un documento HTML es interpretado sin asociarlo 
          a una hoja de estilo, tiene que ser posible leerlo. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td> Asegure que los equivalentes de un contenido din&aacute;mico son actualizados 
          cuando cambia el contenido din&aacute;mico. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td>Hasta que las aplicaciones de usuario permitan controlarlo, evite 
          provocar parpadeo en la pantalla. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td>Utilice el lenguaje apropiado m&aacute;s claro y simple para el contenido 
          de un sitio. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkhead" bgcolor="#33bbcc">


 
        <th> 
          
      
      
      <div align="left">Y si utiliza im&aacute;genes y mapas de imagen</div>



        </th>


      <th>S&iacute; 
        </th>


      <th>No 
        </th>


      <th>N/A</th>


    </tr>



      <tr class="checkinfo">


 
        <td> Proporcione v&iacute;nculos de texto redundantes con cada zona activa de 
          un mapa de imagen del servidor. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td> Proporcione mapas de imagen controlados por el cliente en lugar de 
          por el servidor, excepto donde las zonas sensibles no puedan ser definidas 
          con una forma geom&eacute;trica. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkhead" bgcolor="#33bbcc">


 
        <th> 
          
      
      
      <div align="left">Y si utiliza tablas</div>



        </th>


      <th>S&iacute; 
        </th>


      <th>No 
        </th>


      <th>N/A</th>


    </tr>



      <tr class="checkinfo">


 
        <td>En las tablas de datos, identifique los encabezamientos de fila y 
          columna. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td>Para las tablas de datos que tienen dos o m&aacute;s niveles l&oacute;gicos de encabezamientos 
          de fila o columna, utilice marcadores para asociar las celdas de encabezamiento 
          y las celdas de datos. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkhead" bgcolor="#33bbcc">


 
        <th>
      
      
      <div align="left">Y si utiliza marcos (" frames")</div>



      </th>


      <th>S&iacute; 
        </th>


      <th>No 
        </th>


      <th>N/A</th>


    </tr>



      <tr class="checkinfo">


 
        <td>Titule cada marco para facilitar la identificaci&oacute;n y navegaci&oacute;n de 
          los mismos. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkhead" bgcolor="#33bbcc">


 
        <th>
      
      
      <div align="left">Y si utiliza "applets" y "scripts"</div>



      </th>


      <th>S&iacute; 
        </th>


      <th>No 
        </th>


      <th>N/A</th>


    </tr>



      <tr class="checkinfo">


 
        <td>Asegure que las p&aacute;ginas sigan siendo utilizables cuando se desconecten 
          o no se soporten los scripts, applets u otros objetos de programaci&oacute;n. 
          Si esto no es posible, proporcione informaci&oacute;n equivalente en una p&aacute;gina 
          alternativa accesible. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkhead" bgcolor="#33bbcc">


 
        <th>
      
      
      <div align="left">Y si utiliza multimedia</div>



      </th>


      <th>S&iacute; 
        </th>


      <th>No 
        </th>


      <th>N/A</th>


    </tr>



      <tr class="checkinfo">


 
        <td>Hasta que las aplicaciones de usuario puedan leer autom&aacute;ticamente 
          el texto equivalente de la banda visual, proporcione una descripci&oacute;n 
          auditiva de la informaci&oacute;n importante de la banda visual de una presentaci&oacute;n 
          multimedia. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td>Para toda presentaci&oacute;n multimedia tempodependiente (por ejemplo, una 
          pel&iacute;cula o animaci&oacute;n) sincronice alternativas equivalentes (por ejemplo, 
          subt&iacute;tulos o descripciones de la banda de visual) con la presentaci&oacute;n. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkhead" bgcolor="#33bbcc">


 
        <th>
      
      
      <div align="left">Y si todo lo dem&aacute;s falla</div>



        </th>


      <th>S&iacute; 
        </th>


      <th>No 
        </th>


      <th>N/A</th>


    </tr>



      <tr class="checkinfo">


 
        <td>Si, despu&eacute;s de los mayores esfuerzos, no puede crear una p&aacute;gina accesible, 
          proporcione un v&iacute;nculo a una p&aacute;gina alternativa que use tecnolog&iacute;as 
          W3C, sea accesible, tenga informaci&oacute;n equivalente (o funcional) y sea 
          actualizada tan a menudo como la p&aacute;gina (original) inaccesible. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>



    
  
  
  </tbody>
  
</table>



</div>



<h2>Puntos de verificaci&oacute;n Prioridad 2.</h2>



<div class="table"> 
  
<table summary="Tabla de Puntos de verificaci&oacute;n de prioridad 2, organizados por categor&iacute;as y clasificacos por n&uacute;mero de punto de verificaci&oacute;n." border="1">



    <tbody>



      <tr class="checkhead" bgcolor="#33bbcc">


 
        <th>
      
      
      <div align="left">En general</div>



      </th>


      <th>S&iacute; 
        </th>


      <th>No 
        </th>


      <th>N/A</th>


    </tr>



      <tr class="checkinfo">


 
        <td>Asegure que las combinaciones de los colores de fondo y primer plano 
          tengan el suficiente contraste para que sean percibidas por personas 
          con deficiencias de percepci&oacute;n de color o por pantallas en blanco y 
          negro [Prioridad 2 para las im&aacute;genes. Prioridad 3 para los textos]. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td>Cuando exista un marcador apropiado, use marcadores en vez de im&aacute;genes 
          para transmitir la informaci&oacute;n. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td>Cree documentos que est&eacute;n validados por las gram&aacute;ticas formales publicadas. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td>Utilice hojas de estilo para controlar la maquetaci&oacute;n y la presentaci&oacute;n. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td>Utilice unidades relativas en lugar de absolutas al especificar los 
          valores en los atributos de los marcadores de lenguaje y en los valores 
          de las propiedades de las hojas de estilo. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td>Utilice elementos de encabezado para transmitir la estructura l&oacute;gica 
          y util&iacute;celos de acuerdo con la especificaci&oacute;n. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td>Marque las listas y los puntos de las listas correctamente. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td>Marque las citas. No utilice el marcador de citas para efectos de 
          formato tales como sangr&iacute;as. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td>Asegure que los contenidos din&aacute;micos son accesibles o proporcione 
          una p&aacute;gina o presentaci&oacute;n alternativa. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td>Hasta que las aplicaciones de usuario permitan controlarlo, evite 
          el parpadeo del contenido (por ejemplo, cambio de presentaci&oacute;n en periodos 
          regulares, as&iacute; como el encendido y apagado). 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td>Hasta que las aplicaciones de usuario proporcionen la posibilidad 
          de detener las actualizaciones, no cree p&aacute;ginas que se actualicen autom&aacute;ticamente 
          de forma peri&oacute;dica. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td>Hasta que las aplicaciones de usuario proporcionen la posibilidad 
          de detener el redireccionamiento autom&aacute;tico, no utilice marcadores para 
          redirigir las p&aacute;ginas autom&aacute;ticamente. En su lugar, configure el servidor 
          para que ejecute esta posibilidad. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td> Hasta que las aplicaciones de usuario permitan desconectar la apertura 
          de nuevas ventanas, no provoque apariciones repentinas de nuevas ventanas 
          y no cambie la ventana actual sin informar al usuario. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td>Utilice tecnolog&iacute;as W3C cuando est&eacute;n disponibles y sean apropiadas 
          para la tarea, y use las &uacute;ltimas versiones cuando sean soportadas. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td>Evite caracter&iacute;sticas desaconsejadas por las tecnolog&iacute;as W3C. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td>Divida los bloques largos de informaci&oacute;n en grupos m&aacute;s manejables 
          cuando sea natural y apropiado. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td>Identifique claramente el objetivo de cada v&iacute;nculo. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td>Proporcione meta datos para a&ntilde;adir informaci&oacute;n sem&aacute;ntica a las p&aacute;ginas 
          y sitios. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td>Proporcione informaci&oacute;n sobre la maquetaci&oacute;n general de un sitio (por 
          ejemplo, mapa del sitio o tabla de contenidos). 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td> Utilice los mecanismos de navegaci&oacute;n de forma coherente. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkhead" bgcolor="#33bbcc">


 
        <th>
      
      
      <div align="left">Y si utiliza tablas</div>



      </th>


      <th>S&iacute; 
        </th>


      <th>No 
        </th>


      <th>N/A</th>


    </tr>



      <tr class="checkinfo">


 
        <td>No utilice tablas para maquetar, a menos que la tabla tenga sentido 
          cuando se alinee. Por otro lado, si la tabla no tiene sentido, proporcione 
          una alternativa equivalente (la cual debe ser una versi&oacute;n alineada). 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td>Si se utiliza una tabla para maquetar, no utilice marcadores estructurales 
          para realizar un formateo visual. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkhead" bgcolor="#33bbcc">


 
        <th>
      
      
      <div align="left">Y si utiliza marcos ("frames")</div>



      </th>


      <th>S&iacute; 
        </th>


      <th>No 
        </th>


      <th>N/A</th>


    </tr>



      <tr class="checkinfo">


 
        <td>Describa el prop&oacute;sito de los marcos y c&oacute;mo &eacute;stos se relacionan entre 
          s&iacute;, si no resulta obvio solamente con el t&iacute;tulo del marco. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkhead" bgcolor="#33bbcc">


 
        <th>
      
      
      <div align="left">Y si utiliza formularios</div>



      </th>


      <th>S&iacute; 
        </th>


      <th>No 
        </th>


      <th>N/A</th>


    </tr>



      <tr class="checkinfo">


 
        <td>Hasta que las aplicaciones de usuario soporten expl&iacute;citamente la asociaci&oacute;n 
          entre control de formulario y etiqueta, para todos los controles de 
          formularios con etiquetas asociadas impl&iacute;citamente, asegure que la etiqueta 
          est&aacute; colocada adecuadamente. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td>Asocie expl&iacute;citamente las etiquetas con sus controles. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkhead" bgcolor="#33bbcc">


 
        <th>
      
      
      <div align="left">Y si utiliza "applets" y "scripts"</div>



      </th>


      <th>S&iacute; 
        </th>


      <th>No 
        </th>


      <th>N/A</th>


    </tr>



      <tr class="checkinfo">


 
        <td>Para los scripts y applets, asegure que los manipuladores de eventos 
          sean entradas independientes del dispositivo. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td> Hasta que las aplicaciones de usuario permitan congelar el movimiento 
          de los contenidos, evite los movimientos en las p&aacute;ginas. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td>Haga los elementos de programaci&oacute;n, tales como scripts y applets, 
          directamente accesibles o compatibles con las ayudas t&eacute;cnicas [Prioridad 
          1 si la funcionalidad es importante y no se presenta en otro lugar; 
          de otra manera, Prioridad 2]. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td>Asegure que cualquier elemento que tiene su propia interfaz pueda 
          manejarse de forma independiente del dispositivo. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td>Para scripts, especifique manipuladores de eventos l&oacute;gicos mejor que 
          manipuladores de eventos dependientes de dispositivos. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>



    
  
  
  </tbody>
  
</table>



</div>



<h2>Puntos de verificaci&oacute;n Prioridad 3</h2>



<div class="table"> 
  
<table summary="Tabla de Puntos de verificaci&oacute;n de prioridad 3, organizados por categor&iacute;as y clasificacos por n&uacute;mero de punto de verificaci&oacute;n." border="1">



    <tbody>



      <tr class="checkhead" bgcolor="#33bbcc">


 
        <th>
      
      
      <div align="left">En general</div>



      </th>


      <th>S&iacute; 
        </th>


      <th>No 
        </th>


      <th>N/A</th>


    </tr>



      <tr class="checkinfo">


 
        <td>Especifique la expansi&oacute;n de cada abreviatura y acr&oacute;nimo en el documento 
          cuando aparezcan por primera vez. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td>Identifique el idioma principal de un documento. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td> Cree un orden l&oacute;gico para navegar con el tabulador a trav&eacute;s de v&iacute;nculos, 
          controles de formulario y objetos. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td>Proporcione atajos de teclado para los v&iacute;nculos m&aacute;s importantes (incluidos 
          los de los mapas de imagen de cliente), los controles de formulario 
          y los grupos de controles de formulario. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td> Hasta que las aplicaciones de usuario (incluidas las ayudas t&eacute;cnicas) 
          interpreten claramente los v&iacute;nculos contiguos, incluya caracteres imprimibles 
          (rodeados de espacios), que no sirvan como v&iacute;nculo, entre los v&iacute;nculos 
          contiguos. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td>Proporcione la informaci&oacute;n de modo que los usuarios puedan recibir 
          los documentos seg&uacute;n sus preferencias (por ejemplo, idioma, tipo de 
          contenido, etc.). 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td>Proporcione barras de navegaci&oacute;n para destacar y dar acceso al mecanismo 
          de navegaci&oacute;n. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td>Agrupe los v&iacute;nculos relacionados, identifique el grupo (para las aplicaciones 
          de usuario) y, hasta que las aplicaciones de usuario lo hagan, proporcione 
          una manera de evitar el grupo. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td> Si proporciona funciones de b&uacute;squeda, permita diferentes tipos de 
          b&uacute;squedas para diversos niveles de habilidad y preferencias. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td> Localice la informaci&oacute;n destacada al principio de los encabezamientos, 
          p&aacute;rrafos, listas, etc. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td>Proporcione informaci&oacute;n sobre las colecciones de documentos (por ejemplo, 
          los documentos que comprendan m&uacute;ltiples p&aacute;ginas). 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td>Proporcione un medio para saltar sobre un ASCII art de varias l&iacute;neas. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td>Complemente el texto con presentaciones gr&aacute;ficas o auditivas cuando 
          ello facilite la comprensi&oacute;n de la p&aacute;gina. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td>Cree un estilo de presentaci&oacute;n que sea coherente para todas las p&aacute;ginas. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkhead" bgcolor="#33bbcc">


 
        <th>
      
      
      <div align="left">Y si utiliza im&aacute;genes o mapas de imagen</div>



      </th>


      <th>S&iacute; 
        </th>


      <th>No 
        </th>


      <th>N/A</th>


    </tr>



      <tr class="checkinfo">


 
        <td>Hasta que las aplicaciones de usuario interpreten el texto equivalente 
          para los v&iacute;nculos de los mapas de imagen de cliente, proporcione v&iacute;nculos 
          de texto redundantes para cada zona activa del mapa de imagen de cliente. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkhead" bgcolor="#33bbcc">


 
        <th>
      
      
      <div align="left">Y si utiliza tablas</div>



      </th>


      <th>S&iacute; 
        </th>


      <th>No 
        </th>


      <th>N/A</th>


    </tr>



      <tr class="checkinfo">


 
        <td>Proporcione res&uacute;menes de las tablas. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td>Proporcione abreviaturas para las etiquetas de encabezamiento. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkinfo">


 
        <td>Hasta que las aplicaciones de usuario (incluidas las ayudas t&eacute;cnicas) 
          interpreten correctamente los textos contiguos, proporcione un texto 
          lineal alternativo (en la p&aacute;gina actual o en alguna otra) para <em>todas</em> 
          las tablas que maquetan texto en paralelo, en columnas de palabras. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>


    <tr class="checkhead" bgcolor="#33bbcc">


 
        <th>
      
      
      <div align="left">Y si utiliza formularios</div>



      </th>


      <th>S&iacute; 
        </th>


      <th>No 
        </th>


      <th>N/A</th>


    </tr>



      <tr class="checkinfo">


 
        <td>Hasta que las aplicaciones de usuario manejen correctamente los controles 
          vac&iacute;os, incluya caracteres por defecto en los cuadros de edici&oacute;n y &aacute;reas 
          de texto. 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; 
        </td>


      <td>&nbsp; </td>



      </tr>



    
  
  
  </tbody>
  
</table>



</div>



<p>&nbsp;</p>



<p>&nbsp;</p>



<p>&nbsp;</p>



<p>&nbsp;</p>


</div>

</body>
</html>
