<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html lang="es-es">
<head>

  <meta content="text/html; charset=ISO-8859-1" http-equiv="content-type">
  <title>Modelos de estructuras de p&aacute;ginas</title>


  <meta content="Ra&uacute;l Luna" name="author">

  <link rel="shortcut icon" href="imagenes/favicon.ico">

  <link rel="stylesheet" type="text/css" href="../nvu2005.css">

<!-- parche de compatibilización con CSS 2 para navegadores microsoft --><!--[if lt IE 7]>
<script src="../ie7/ie7-standard-p.js" type="text/javascript"></script>
<![endif]-->
  <link rel="stylesheet" href="recursos.css" type="text/css">

</head>


<body>

<div id="localizador">
<p>Recursos&gt;&gt;Estructuras</p>

</div>
<div id="flechadcha">
<a href="recursos8.html" title="avanzar"><img src="../Images/flechadcha.gif" border="0"></a>
</div>
<div id="flechaizq">
<a href="recursos6.html" title="retroceder"><img src="../Images/flechaizq.gif" border="0"></a>
</div>


<div id="contenido">

<div class="principal">
<h2>Modelos de estructuras de p&aacute;ginas</h2>

<p>Al estudiar las reglas de estilo referentes al posicionamiento
de
elementos dentro de la p&aacute;gina hemos visto que
exist&iacute;a la
posibilidad de crear p&aacute;ginas que simularan marcos sin
necesidad
de utilizar estructuras de frames. Igualmente podemos generar columnas
de una forma mucho m&aacute;s acorde a las recomendaciones de
accesibilidad sin necesidad de recurrir a la utilizaci&oacute;n de
tablas. Como hay ocasiones en las que este trabajo puede resultar algo
tedioso podemos recurrir a algunos sitios que nos ofrecen estructuras
ya preparadas que podemos salvar en el disco para aprovechar en nuestra
web.</p>

<p>Uno de estos sitios es una excelente p&aacute;gina en
franc&eacute;s <a href="http://css.alsacreations.com/Modeles-de-mise-en-page-en-CSS" target="_blank">http://css.alsacreations.com/Modeles-de-mise-en-page-en-CSS</a>.
De esta p&aacute;gina&nbsp;se&nbsp;han extra&iacute;do
tambi&eacute;n varias ideas para los men&uacute;s explicados
en la secci&oacute;n de aplicaci&oacute;n de
t&eacute;cnicas CSS.</p>

<p>Tambi&eacute;n dispones de un generador online de
estructuras de
tres columnas utilizando CSS. Est&aacute; en ingl&eacute;s pero
no
presenta especiales dificultades porque lo &uacute;nico que
tendremos
que ir haciendo es especificar las reglas CSS que deseamos que se
utilicen para configurar nuestro documento, incluidos los colores de
cada una de las zonas de la p&aacute;gina.</p>

<p class="centrado"><img style="width: 616px; height: 515px;" alt="csscreator en funcionamiento" title="csscreator en funcionamiento" src="imagenes/csscreator.png"></p>

<p>La columna central (o derecha si s&oacute;lo tenemos dos)
tomar&aacute; la anchura autom&aacute;ticamente en
funci&oacute;n de
las dem&aacute;s columnas. A medida que&nbsp; vamos pulsand
sobre las
posibilidades (<span class="refmenu">header</span>, <span class="refmenu">left column</span>, <span class="refmenu">right column</span> o <span class="refmenu">footer</span>)
se ir&aacute;n abriendo secciones del formulario para especificar
la
anchura y el color. La forma de indicar el color consiste simplemente
en pulsando con el rat&oacute;n sobre los indicadores de rojo,
verde y
azul y cuando obtenemos un color que nos sirve hacer clic en la casilla
<span class="refmenu">background-color</span> de la
zona
correspondiente. Para hacernos una idea de c&oacute;mo
quedar&aacute;
la estructura tenemos un visor que se va actualizando
autom&aacute;ticamente con los cambios que hacemos en el
formulario. Al
pulsar <span class="refmenu">generate layout</span>
aparecer&aacute;
una p&aacute;gina en la que dispondremos de enlaces al archivo html
y
al css necesarios para nuestra estructura que podremos guardar en
nuestro ordenador.</p>

<p>Con unas prestaciones similares y la posibilidad de tener las
instrucciones en castellano encontramos un generador de estructuras de
tres columnas en <a href="http://www.neuroticweb.com/recursos/3-columns-layout/index.php?idioma=es" target="_blank">http://www.neuroticweb.com/recursos/3-columns-layout/index.php?idioma=es</a></p>

<p>Y, ya que estamos en esta web puede ser tambi&eacute;n muy
&uacute;til el generador de cajas redondeadas que encontramos
en&nbsp; <a href="http://www.neuroticweb.com/recursos/css-rounded-box/" target="_blank">http://www.neuroticweb.com/recursos/css-rounded-box/</a></p>

<p></p>

</div>
</div>
</body>
</html>
