<!DOCTYPE html PUBLIC "-//w3c//dtd html 4.0 transitional//en">
<html lang="es-es">
<head>

  <meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
  <title>Compresi&oacute;n de sonido con Helix Producer Basic</title>


<!-- compliance patch for microsoft browsers --><!--[if lt IE 7]> <script src="../../../ie7/ie7-standard-p.js" type="text/javascript"></script> <![endif]-->
  <link type="text/css" href="../../../nvu2005.css" rel="stylesheet">

  <link rel="stylesheet" href="../../../multi1.css" type="text/css">

</head>


<body>

<div id="localizador">
<p>Multimedia>>Sonido</p>

</div>
<div id="flechadcha">
<a href="../../../vinculos/vinculos1.htm" title="avanzar"><img src="../../../Images/flechadcha.gif" border="0"></a>
</div>
<div id="flechaizq">
<a href="../multi2b.html" title="retroceder"><img src="../../../Images/flechaizq.gif" border="0"></a>
</div>

<div class="solapas">
<ul>

  <li><a href="../multi2.htm">Cuestiones
generales</a></li>

  <li><a href="../multi2b.html">Insertar sonidos con
N|VU</a></li>

  <li class="activo"><a href="compresionconhelixb.htm">Compresi&oacute;n
de sonidos</a></li>

</ul>

</div>

<div class="principal">
<h2>Compresi&oacute;n de
sonido con Helix Producer Basic</h2>

<p>Habr&aacute;s comprobado que el tama&ntilde;o ocupado
por los archivos&nbsp;<acronym title="Ap&oacute;cope de WAVEform audio format">wav</acronym>
es muy grande. Si creamos p&aacute;ginas para
trabajar en una Intranet no es un problema grave, puesto que las
velocidades de transmisi&oacute;n son muy altas, pero si
pretendemos utilizar estas p&aacute;ginas en Internet
ser&iacute;a una barbaridad, ya que con el ancho de banda
disponible no ser&iacute;an operativas.</p>

<p>Debido a esta situaci&oacute;n han surgido una serie de
aplicaciones cuya utilidad reside en que, a cambio de una cierta
p&eacute;rdida de calidad, aplican algoritmos de
compresi&oacute;n que vuelven a situar a estos materiales en el
campo de lo razonable para su manejo en Internet. Adem&aacute;s la
compresi&oacute;n se puede aplicar tanto a fragmentos de sonido
como de v&iacute;deo.</p>

<p>Uno de los formatos que cuenta con posibilidades para
convertirse en un est&aacute;ndar de facto en la
transmisi&oacute;n por Internet es el auspiciado por Real Networks
denominado, gen&eacute;ricamente Real Media.</p>

<p>La empresa productora de este <i>software</i> ha
mantenido desde sus inicios una doble pol&iacute;tica de
distribuci&oacute;n:</p>

<ul type="disc">

  <li>Por una parte se encuentran los programas de libre
disposici&oacute;n a los que se puede acceder mediante su descarga
gratuita de la red.</li>

  <li>Por otra versiones comerciales que permiten todas las
funciones de las versiones b&aacute;sicas e incorporan una serie de
prestaciones complementarias de evidente utilidad. Dichos programas
tambi&eacute;n se pueden conseguir a trav&eacute;s de la red
pero, al tratarse de versiones comerciales, es necesario pagar una
licencia.</li>

</ul>

<p>En cuanto a los productos disponibles encontramos, siempre
atendiendo a esta doble modalidad de distribuci&oacute;n:</p>

<ul type="disc">

  <li><strong>Reproductores:</strong>&nbsp; La
&uacute;ltima
versi&oacute;n gratuita es <a href="http://forms.real.com/real/realone/intl/intl_realone.html?dc=11111019&amp;type=es&amp;src=021218_intl_r1choice_es_mx&amp;lang=es" target="12"> RealOne Player Basic</a> (Como suele ser
habitual en la web de Real el enlace al programa gratuito
est&aacute; bastante escondido entre los enlaces para descargar la
versi&oacute;n comercial anunciados como gratuitos durante el
periodo de prueba) </li>

  <li><strong>Programas de creaci&oacute;n de contenido</strong>:
Sin
considerar otro tipo de programas dedicados a aplicaciones
espec&iacute;ficas podemos encontrar la versi&oacute;n de <a href="http://forms.real.com/rnforms/products/tools/producerbasic/index.html?key=7R4KC1042224735" target="56"> Helix Producer Basic</a>
(s&oacute;lo
en ingl&eacute;s por el momento). En el momento de redactar esta
documentaci&oacute;n, la p&aacute;gina a la que apunta el
enlace es un
formulario cuya cumplimentaci&oacute;n es imprescindible para poder
realizar la descarga.</li>

</ul>

<p>Veremos a continuaci&oacute;n los pasos que necesitamos
dar para crear un archivo multimedia con Helix Producer Basic.&nbsp;</p>

<p>Cuando arrancamos Helix Producer Basic nos aparece la
siguiente ventana:</p>

<p class="centrado"><img src="images/helix1.jpg" border="0" height="424" width="500"></p>

<p>Esta ventana se divide b&aacute;sicamente en las
siguientes zonas: </p>

<ul>

  <li><b>ZONA A:</b> sirve para establecer&nbsp;
la fuente de audio o v&iacute;deo que se va a codificar (Encode)
para reducir su tama&ntilde;o y convertirse en un archivo RealMedia
(.rm).</li>

  <li><b>ZONA B:</b> sirve para establecer las
caracter&iacute;sticas y el destino del archivo resultante de dicha
codificaci&oacute;n.</li>

  <li><b>ZONA C:</b> recoge y gestiona la
informaci&oacute;n referente al trabajo (job) de
codificaci&oacute;n realizado. Sin embargo las funciones de esta
parte solo est&aacute;n disponibles en la versi&oacute;n
comercial del programa. De esta zona nos interesan los botones "Encode"
y "Stop".</li>

</ul>

<p>El proceso para realizar la conversi&oacute;n de un
archivo de audio o v&iacute;deo a un archivo de RealMedia
ser&iacute;a el siguiente:</p>

<h3>1&ordm;) En la ZONA A:</h3>

<p class="flotizq"><img src="images/helix2.gif" border="0" height="363" width="375"></p>

<p>Lo primero es decidir si la fuente va a ser un archivo
ya grabado o si lo vamos a generar en directo:</p>

<ol>

  <li>En el primer caso seleccionaremos <span class="refmenu">input
file</span> <span class="rojo">(1)</span>
e indicaremos la ubicaci&oacute;n del archivo busc&aacute;ndolo
en el directorio al que accedemos a trav&eacute;s del
bot&oacute;n <span class="refmenu">browse</span>
    <span class="rojo">(2)</span></li>

  <li>En el segundo caso seleccionaremos <span class="refmenu">devices</span>
    <span class="rojo">(3)</span>.
Si el dispositivo de entrada es para Audio lo seleccionaremos de la
lista desplegable (nos aparecer&aacute; el dispositivo de entrada
de la tarjetas de sonido). El bot&oacute;n <span class="refmenu">settings</span>
    <span class="rojo">(4)</span>
nos
permitir&aacute; acceder al <span class="refmenu">recording
mixer</span>, es
decir, al mezclador donde seleccionaremos la fuente de
grabaci&oacute;n (micr&oacute;fono, CD-Audio, etc). Podemos
prefijar la duraci&oacute;n de la grabaci&oacute;n
seleccionando la casilla <span class="refmenu">duration</span>
    <span class="rojo">(5)</span>
e
introduciendo los valores deseados.</li>

  <li>Para conocer las caracter&iacute;sticas de la
fuente de grabaci&oacute;n seleccionada pulsaremos el
bot&oacute;n <span class="refmenu">source properties</span>
    <span class="rojo">(6)</span><br clear="all">

  </li>

</ol>

<h3>2&ordm;) En la ZONA B:</h3>

<div class="flotder"><img src="images/helix3.gif" border="0" height="363" width="375"></div>

<ol>

  <li>En el
bot&oacute;n <span class="refmenu">audiences</span>
    <span class="rojo">(1)</span>
estableceremos la calidad de la codificaci&oacute;n (a mayor
calidad m&aacute;s grande ser&aacute; el archivo resultante y
m&aacute;s tiempo costar&aacute; descargarlo y transmitirlo).
En el caso del v&iacute;deo pueden establecerse algunos filtros en
el bot&oacute;n <span class="refmenu">v&iacute;deo
filters</span> <span class="rojo">(2)</span></li>

  <li>Cuando en la ZONA A hemos seleccionado <span class="refmenu">input
file</span>, el archivo de RealMedia se guarda por defecto
en&nbsp;el mismo directorio que el archivo de origen (esto puede
variarse en <span class="refmenu">edit </span><img class="refmenu" src="../../../imagenes/flechamenu.png" height="13" width="14"> <span class="refmenu">preferences</span>)</li>

  <li>Cuando en la ZONA A hemos seleccionado <span class="refmenu">devices</span>,
el archivo de RealMedia se guarda con el nombre y en el directorio que
especifiquemos al pulsar el bot&oacute;n <span class="rojo">(3)</span>.
Pr&oacute;ximos a este bot&oacute;n se encuentran un
bot&oacute;n con un l&aacute;piz que permite editar el nombre
del archivo y un bot&oacute;n con una papelera que permite borrarlo.</li>

  <li>En el bot&oacute;n <span class="refmenu">clip&nbsp;information</span>
    <span class="rojo">(4)</span> podemos escribir
toda aquella informaci&oacute;n que queramos
suministrar sobre el archivo guardado a quienes lo descarguen y lo
reproduzcan.</li>

  <li>Una vez generado el archivo de RealMedia podemos
reproducirlo pulsando en el bot&oacute;n <span class="rojo">(5)</span>.<br clear="all">

  </li>

</ol>

<h3><b>3&ordm;) En la ZONA C:</b></h3>

<div class="flotizq"><img src="images/helix4.gif" border="0" height="172" width="628"></div>

<p>Una vez
finalizados los pasos necesarios en
las
ZONAS A y B pulsaremos el bot&oacute;n <span class="refmenu">encode</span>
<span class="rojo">(1)</span>
y se
realizar&aacute; la creaci&oacute;n del archivo RealMedia. En
el caso de realizarse a partir de un archivo preexistente esta se
detendr&aacute; autom&aacute;ticamente cuando termine. Si por
el contrario se est&aacute; generando el contenido del archivo en
directo, el proceso finalizar&aacute; cuando se pulse el
bot&oacute;n <span class="refmenu">stop</span>
<span class="rojo">(2)</span>
o cuando se cumpla el tiempo establecido en <span class="refmenu">duration
</span>(en caso de haberse seleccionado esta opci&oacute;n)</p>

<p></p>

<br>

<div class="practicas"> <img class="numact" style="width: 29px; height: 29px; float: left;" alt="Actividad 41" title="Actividad 41" src="../../../imagenes/numeracion/cuarentayuno.gif">Lo
ideal para realizar este ejercicio es que utilices un archivo con tu
propia voz tal como lo incluir&iacute;as en una p&aacute;gina
WEB. Intenta grabar una secuencia de unos 15 segundos de
duraci&oacute;n y gu&aacute;rdala en tu carpeta de trabajo. Si
no puedes hacerlo utiliza un archivo wav (por ejemplo el archivo
ctmelody.wav que encontrar&aacute;s en la carpeta Windows\Media).
<ul>

  <li>Arranca Helix Producer
Basic.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </li>

  <li>Sigue los pasos ya explicados para crear un archivo en
formato RealMedia utilizando para ello como fuente el archivo que
hab&iacute;amos grabado originalmente con la grabadora de medios. </li>

  <li>Cr&eacute;alo para una audiencia que se conecte
hipot&eacute;ticamente a una velocidad de <span class="refmenu">56K
Dial-up</span> </li>

  <li>Vuelve a repetir la creaci&oacute;n utilizando la misma
fuente y cambiando el nombre del archivo de salida pero, en este caso,
para una audiencia potencial que se conectara a una velocidad de <span class="refmenu">512K
DSL or Cable</span> </li>

  <li>Reproduce los archivos creados para comparar la diferencia
de calidad. </li>

  <li>Acude al explorador de Windows para valorar la diferencia
de tama&ntilde;o entre uno y otro archivo teniendo en cuenta la
calidad que se ha podido apreciar. </li>

</ul>

</div>

<div class="practicas"> <img class="numact" style="width: 29px; height: 29px; float: left;" alt="Actividad 42" title="Actividad 42" src="../../../imagenes/numeracion/cuarentaydos.gif">Grabar
un
fragmento de audio de forma directa utilizando el micr&oacute;fono
como fuente de sonido.<br clear="all">

</div>

<h2>PUBLICACI&Oacute;N EN UNA WEB</h2>

<p>Lo primero que hay que tener en cuenta es que el streaming de
archivos de RealMedia puede hacerse desde un servidor
espec&iacute;fico (Real Server) o bien desde un servidor web sin
prestaciones especiales. La ventaja que se obtiene de la
difusi&oacute;n desde un servidor de streaming es que a cada
usuario se le sirven los archivos m&aacute;s adecuados a su
velocidad de conexi&oacute;n, mientras que en un servidor web no
existe esta posibilidad: si hemos codificado con poca calidad ese
ser&aacute; el archivo que se env&iacute;e aunque el visitante
disponga de banda ancha, mientras que si lo hemos hecho con alta
calidad el usuario de m&oacute;dem tendr&aacute; que descargar
un archivo mucho m&aacute;s grande. </p>

<p>Adem&aacute;s, mientras que los programas lectores son
gratuitos los servidores son de tipo comercial y muy costosos, por lo
que hay muchos proveedores que no disponen de este servicio, por lo que
el ejemplo que veremos se centrar&aacute; en la
publicaci&oacute;n en un servidor web. </p>

<p>Para publicar un archivo RealMedia en una web tenemos dos
posibilidades: </p>

<ol>

  <li>Establecer una enlace a dicho archivo desde la
p&aacute;gina (creando un hiperv&iacute;nculo a partir de una
texto o de una imagen). Este sistema hace que si tenemos instalado
RealOne Player salte autom&aacute;ticamente la ventana de dicho
reproductor al activar el enlace: <a href="brevebueno.rm">EJEMPLO</a></li>

  <li>Insertar&nbsp;el panel de reproducci&oacute;n
dentro de la propia p&aacute;gina. Para hacer esto puedes emplear
el procedimiento descrito para realizar la actividad 40.
Tambi&eacute;n se puede introducir mediante c&oacute;digo. Por
ejemplo, para insertar la consola completa habr&iacute;a que
introducir la siguiente l&iacute;nea de c&oacute;digo:</li>

</ol>

<div style="border: 1pt solid rgb(192, 192, 192); padding: 10px 40px; width: 600px; margin-left: auto; margin-right: auto;" class="centrado" width="600">
<p><code>&lt;embed src="brevebueno.rm" width=320
height=100 nojava="true" controls="All" console="one"
autostart="false"&nbsp;
TYPE="audio/x-pn-realaudio-plugin"&gt;</code></p>

<p>Solo habr&iacute;a que sustituir "brevebueno.rm" por
el nombre y la extensi&oacute;n del archivo RealMedia que queremos
que se reproduzca. El resultado ser&iacute;a el siguiente:</p>

<div class="centrado">
<embed src="brevebueno.rm" nojava="true" controls="All" console="one" autostart="false" type="audio/x-pn-realaudio-plugin" height="100" width="320"> </div>

<p>Para ver otros tipos de posibles consolas puedes visitar
esta p&aacute;gina de <a href="http://smilparse.real.com/showcase/resources/samples/embed/plugin.htm">soporte</a>
de Real (en ingl&eacute;s). </p>

</div>

<div class="avisos"><img src="images/atencion.gif" height="25" hspace="5" width="28"> Para que
los c&oacute;digos que encuentres en la p&aacute;gina de
soporte puedan funcionar en el navegador de Netscape hay que
a&ntilde;adirles&nbsp; <code>type="audio/x-pn-realaudio-plugin"</code>
<br>

</div>

<div class="practicas"> <img class="numact" style="width: 29px; height: 29px; float: left;" alt="Actividad 43" title="Actividad 43" src="../../../imagenes/numeracion/cuarentaytres.gif">
<ul>

  <li>Crear una p&aacute;gina WEB que contenga un texto y/o
una imagen con un v&iacute;nculo a un archivo RealMedia. </li>

  <li>Comprobar el resultado de la creaci&oacute;n con la
vista previa. </li>

  <li>Crear una p&aacute;gina WEB donde el panel de
reproducci&oacute;n se incluya en la p&aacute;gina. </li>

  <li>Comprobar el resultado de la creaci&oacute;n con la
vista previa utilizando diferentes posibilidades de
presentaci&oacute;n. </li>

  <li>Guardar la p&aacute;gina con la
configuraci&oacute;n que se prefiera como <strong>actividad43.html</strong></li>

</ul>

</div>

<div class="practicas">
<p><img class="numact" style="width: 29px; height: 29px; float: left;" alt="Actividad 44" title="Actividad 44" src="../../../imagenes/numeracion/cuarentaycuatro.gif">&nbsp;Si dispones de una c&aacute;mara de
videoconferencia o una tarjeta capturadora de v&iacute;deo puedes
realizar esta pr&aacute;ctica voluntaria consistente en capturar
una secuencia de v&iacute;deo utilizando una c&aacute;mara de
videoconferencia conectada al ordenador.<br clear="all">

</p>

</div>

</div>

</body>
</html>
