<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html lang="es-es">
<head>

  <meta content="text/html; charset=ISO-8859-1" http-equiv="content-type">
  <title>FTP con Windows 98</title>


  <meta content="Ra&uacute;l Luna" name="author">

  <link rel="stylesheet" type="text/css" href="../nvu2005.css">

<!-- parche de compatibilización con CSS 2 para navegadores microsoft --><!--[if lt IE 7]> <script src="../ie7/ie7-standard-p.js" type="text/javascript"></script> <![endif]-->
</head>


<body>

<div id="localizador">
<p>Publicaci&oacute;n&gt;&gt;Explorador Win98</p>

</div>
<div id="flechadcha">
<a href="ftpxp.htm" title="avanzar"><img src="../Images/flechadcha.gif" border="0"></a>
</div>
<div id="flechaizq">
<a href="filezilla.htm" title="retroceder"><img src="../Images/flechaizq.gif" border="0"></a>
</div>


<div id="contenido">

<h2>Ftp identificado con el
navegador en Windows 98</h2>

<p>Para acceder a un sitio ftp de forma
identificada se puede hacer sin necesidad de instalar ning&uacute;n
programa espec&iacute;fico. No dispondremos de prestaciones
especiales pero, a cambio la funcionalidad es bastante similar a la de
la utilizaci&oacute;n del explorador de Windows. Es importante
se&ntilde;alar que es necesario que exista una
integraci&oacute;n entre la herramienta que utilicemos y el sistema
de archivos, por lo que, si usamos Explorer podremos trabajar casi como
si lo hici&eacute;ramos con el Explorador de Windows, pudiendo
copiar y pegar archivos tanto en el ordenador local como en el remoto.
Sin embargo, si utilizamos Mozilla podremos conectarnos, pero no nos
permitir&aacute; enviar archivos al servidor y el procedimiento
para bajarlos ser&aacute; pulsar con el bot&oacute;n derecho
sobre el archivo y elegir <span class="refmenu">guardar
destino del enlace como</span>. Dado que este procedimiento no
es nada efectivo vamos a obviarlo y veremos c&oacute;mo puede
realizarse el proceso con Internet Explorer</p>

<p> Para empezar bastar&aacute; con teclear en la barra de
direcciones de Explorer la direcci&oacute;n del servidor pero en
este caso s&iacute; que necesitaremos especificar que deseamos
acceder utilizando el protocolo ftp. Quedar&iacute;a pues <strong>ftp://nombre_servidor</strong>
y eso har&iacute;a que se presentara una ventana en la que nos
solicita el nombre de usuario y la contrase&ntilde;a.</p>

<p class="centrado" align="center"><img src="imagenes/ftpexploreridentificacion.png" alt="Panel de identificaci&oacute;n" style="width: 389px; height: 267px;" title="Panel de identificaci&oacute;n" height="267" width="389"></p>

<p>Hay una opci&oacute;n para saltarse esta pantalla y
acceder directamente que consiste en incluir en la petici&oacute;n
el nombre de usuario y la contrase&ntilde;a, tecleando<b><strong>
</strong></b><strong>ftp://nombre_usuario:password@nombre_servidor</strong>
En versiones anteriores este procedimiento ten&iacute;a el problema
de que el nombre de usuario y la contrase&ntilde;a quedaban
almacenados entre las direcciones tecleadas, pero no sucede
as&iacute; en la versi&oacute;n 6.</p>

<p>Si nuestra intenci&oacute;n es traernos archivos desde el
servidor es conveniente pulsar el bot&oacute;n <img src="imagenes/botoncarpetas.png" alt="Carpetas" style="width: 76px; height: 44px;" height="44" width="76">
ya que esto nos permitira
contar con una vista de las carpetas de locales en la zona izquierda de
la pantalla. De todas maneras, la forma m&aacute;s
c&oacute;moda de realizar las transferencias ser&iacute;a abrir
una ventana con la visualizaci&oacute;n de las carpetas de nuestro
ordenador y colocarla junto a la del Explorer conectado al sitio ftp,
ya que de esta forma nos resulta m&aacute;s f&aacute;cil la
navegaci&oacute;n por las carpetas de ambos sitios y podemos copiar
los archivos arrastr&aacute;ndolos y solt&aacute;ndolos de una
a otra ventana.</p>

<p class="centrado"><img src="imagenes/explorerexplorando.png" alt="Listado de archivos con vista de carpetas activada" style="width: 599px; height: 299px;" title="Listado de archivos con vista de carpetas activada" height="299" width="599"></p>

<p>&nbsp;<br>

</p>

<div class="practicas">
<img style="width: 29px; height: 29px;" alt="Actividad 103" title="Actividad 103" src="../imagenes/numeracion/cientotres.gif">Si trabajas con
Windows 98 y has optado por esta forma de trabajar realiza una
conexi&oacute;n a tu sitio ftp:
<ul>

  <li>Con&eacute;ctate usando la direcci&oacute;n <strong>ftp://nombre_servidor</strong></li>

  <li><strong><span style="font-weight: normal;">Comprueba
que existe
la carpeta public_html y si no existe cr&eacute;ala (Recuerda que
esta
condici&oacute;n es imprescindible en los servidores del CNICE,
pero
que no tiene por qu&eacute; ser necesaria en otros servidores,
as&iacute; que aseg&uacute;rate de seguir las instrucciones al
respecto
de tu proveedor)</span></strong></li>

  <li><strong><span style="font-weight: normal;">Activa
la vista de carpetas</span></strong></li>

  <li>Localiza en tu ordenador la carpeta que contiene tu sitio
web y transfi&eacute;relos al sitio remoto.</li>

  <li>Si hay alg&uacute;n archivo que hayas olvidado (suele
ocurrir en la mayor&iacute;a de las ocasiones) vuelve a realizar
una conexi&oacute;n ftp y env&iacute;alo al servidor.</li>

  <li>Comprueba que las p&aacute;ginas se ven correctamente
visitando la ubicaci&oacute;n en la red. En el caso del CNICE
responder&aacute; al esquema: <b>http://ordenador.pntic.mec.es/nombreusuario/</b>
o <b>http://ordenador.cnice.mecd.es/~nombreusuario/</b>
pero podr&iacute;a ser diferente si lo alojas en otros proveedores.</li>

</ul>

</div>

<p></p>

<p></p>

</div>

</body>
</html>
