<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html lang="es-es">
<head>


  
  <meta content="text/html; charset=ISO-8859-1" http-equiv="content-type">

  


  
  <title>FTP con Windows XP</title>
  <meta content="Ra&uacute;l Luna" name="author">


  
  <link rel="stylesheet" type="text/css" href="../nvu2005.css">
<!-- parche de compatibilización con CSS 2 para navegadores microsoft --><!--[if lt IE 7]> <script src="../ie7/ie7-standard-p.js" type="text/javascript"></script> <![endif]-->
</head>


<body>

<div id="localizador">
<p>Publicaci&oacute;n&gt;&gt;Windows XP</p>

</div>
<div id="flechadcha">
<a href="gftp.htm" title="avanzar"><img src="../Images/flechadcha.gif" border="0"></a>
</div>
<div id="flechaizq">
<a href="ftp98.htm" title="retroceder"><img src="../Images/flechaizq.gif" border="0"></a>
</div>


<div id="contenido">

<h2>Sitios de red con Windows XP</h2>


<p><img class="flotder" src="imagenes/ftpxp1.png" height="130" width="213">Podr&iacute;amos
conseguir un acceso ftp de forma similar a como lo hacemos en Windows
98. Bastar&iacute;a con teclear <strong>ftp://nombre_servidor</strong>
para que al intentar conectar nos solicitara el nombre de usuario y la
contrase&ntilde;a. Esta forma de trabajo nos permite un acceso
puntual al servidor, sin incorporar ning&uacute;n icono para
futuros accesos al mismo. Sin embargo, con Windows XP tenemos la
posibilidad de agregar sitios de red tanto en el entorno de nuestra red
local como en Internet, por lo que incorporamos de forma estable un
acceso a ese servidor. As&iacute; pues podr&iacute;amos acceder
a <span class="refmenu">mis sitios de red</span><strong> </strong> y seleccionar la
tarea <span class="refmenu">agregar un sitio de red</span>.</p>


<p>Cuando pulsamos sobre la tarea se lanza
un asistente que nos pide que introduzcamos la direcci&oacute;n del
servidor al que pretendemos conectar. Se puede hacer un doble clic
sobre el texto de la petici&oacute;n o sobre el bot&oacute;n
Siguiente. En ambos casos pasamos al siguiente paso la secuencia del
asistente.</p>


<div class="centrado"><img src="imagenes/ftpxp2.png" height="434" width="558"></div>


<p>Ahora introducimos la
direcci&oacute;n del servidor igual que hac&iacute;amos al
configurar el perfil de WS_FTP. Dado que los servidores del CNICE no
soportan las carpetas web hay que realizar el acceso mediante ftp. </p>


<div class="centrado"><img src="imagenes/ftpxp3.png" height="458" width="563"></div>


<p>Para empezar bastar&aacute; con
teclear la direcci&oacute;n del servidor pero en este caso
s&iacute; que necesitaremos especificar que deseamos acceder
utilizando el protocolo ftp puesto que los servidores del CNICE no
soportan las carpetas web a las que se podr&iacute;a acceder con
protocolo http. Quedar&iacute;a pues <b>ftp://nombre_servidor</b>
y eso har&iacute;a que se presentara una ventana en la que nos
solicita el nombre de usuario. Por defecto aparecer&aacute; marcado
el acceso an&oacute;nimo, por lo que tendremos que desmarcarlo ya
que intentamos un acceso identificado. </p>


<div class="centrado"><img src="imagenes/ftpxp4.png" height="459" width="564"></div>


<p>Con esto tenemos
pr&aacute;cticamente finalizado el proceso. S&oacute;lo queda
darle un nombre al nuevo sitio de red que acabamos de crear...</p>


<div class="centrado"><img src="imagenes/ftpxp5.png" height="459" width="564"></div>


<p>...y finalizar el proceso.</p>


<div class="centrado"><img src="imagenes/ftpxp6.png" height="459" width="564"></div>


<p>Como hemos dejado marcada la casilla
para acceder al nuevo sitio al finalizar la configuraci&oacute;n se
inicia el acceso y, dado que no hab&iacute;amos introducido la
contrase&ntilde;a hasta el momento, se nos solicita ahora.</p>


<div class="centrado"><img src="imagenes/ftpxp8.png" height="334" width="486"></div>


<p>Dependiendo de las condiciones de
utilizaci&oacute;n de la m&aacute;quina que estemos usando
podremos marcar la opci&oacute;n de guardar la
contrase&ntilde;a o bien dejarla desmarcada para que la solicite en
cada intento de acceso. </p>


<p>A partir de este momento podremos
acceder al servidor del mismo modo que lo hacemos a cualquiera de las
carpetas de nuestro equipo o de nuestra red local.</p>


<div class="centrado"> <img src="imagenes/ftpxp7b.png" height="450" width="600"><br>
<div class="practicas">
<img style="width: 29px; height: 29px;" alt="Actividad 103" title="Actividad 103" src="../imagenes/numeracion/cientotres.gif">Si trabajas con
Windows XP y has optado por esta forma de trabajar realiza una
conexi&oacute;n a tu sitio ftp:
<ul>
  <li>Con&eacute;ctate usando la direcci&oacute;n <strong>ftp://nombre_servidor</strong></li>
  <li><strong><span style="font-weight: normal;">Comprueba
que existe
la carpeta public_html y si no existe cr&eacute;ala (Recuerda que
esta
condici&oacute;n es imprescindible en los servidores del CNICE,
pero
que no tiene por qu&eacute; ser necesaria en otros servidores,
as&iacute; que aseg&uacute;rate de seguir las instrucciones al
respecto
de tu proveedor)</span></strong></li>
  <li><strong><span style="font-weight: normal;">Activa
la vista de carpetas</span></strong></li>
  <li>Localiza en tu ordenador la carpeta que contiene tu sitio
web y transfi&eacute;relos al sitio remoto.</li>
  <li>Si hay alg&uacute;n archivo que hayas olvidado (suele
ocurrir en la mayor&iacute;a de las ocasiones) vuelve a realizar
una conexi&oacute;n ftp y env&iacute;alo al servidor.</li>
  <li>Comprueba que las p&aacute;ginas se ven correctamente
visitando la ubicaci&oacute;n en la red. En el caso del CNICE
responder&aacute; al esquema: <b>http://ordenador.pntic.mec.es/nombreusuario/</b>
o <b>http://ordenador.cnice.mecd.es/~nombreusuario/</b>
pero podr&iacute;a ser diferente si lo alojas en otros proveedores.</li>
</ul>

</div>
</div>


<p>&nbsp;</p>

</div>
</body>
</html>
