<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html lang="es-es">
<head>

  



  
  <title>Sonidos</title>
<!-- compliance patch for microsoft browsers --><!--[if lt IE 7]>
<script src="../../ie7/ie7-standard-p.js" type="text/javascript"></script>
<![endif]-->
  <link type="text/css" href="../../nvu2005.css" rel="stylesheet">


  
  <link rel="stylesheet" href="../../multi1.css" type="text/css">
</head>


<body>

<div id="localizador">
<p>Multimedia>>Sonido</p>

</div>
<div id="flechadcha">
<a href="multi2b.html" title="avanzar"><img src="../../Images/flechadcha.gif" border="0"></a>
</div>
<div id="flechaizq">
<a href="../multi1f.htm" title="retroceder"><img src="../../Images/flechaizq.gif" border="0"></a>
</div>

<div class="solapas">
<ul>


  <li class="activo"><a href="multi2.htm">Cuestiones
generales</a></li>


  <li><a href="multi2b.html">Insertar sonidos con
N|VU</a></li>


  <li><a href="TutorialHelix/compresionconhelixb.htm">Compresi&oacute;n
de sonidos</a></li>


</ul>


</div>


<div class="principal">
<p class="avisos"><img src="../../imagenes/atencion.gif" height="25" width="28">Est&aacute; claro que,
conceptualmente, los
sonidos deber&iacute;an agruparse con las im&aacute;genes en la
categor&iacute;a de multimedia. Pero tenemos el problema de que se
van a mencionar procedimientos relativos a la creaci&oacute;n de
v&iacute;nculos que se abordan en la siguiente secci&oacute;n.
Es recomendable que dejes pendiente este apartado y pases al de
v&iacute;nculos.</p>


<hr width="75%">
<p class="estilo">Tanto si ya est&aacute;s de
vuelta como si has decidido adentrarte en esta secci&oacute;n sin
consultar el apartado de v&iacute;nculos vamos a iniciar el
recorrido con una anotaci&oacute;n de estilo. <br>


<br>


La utilizaci&oacute;n de sonidos pas&oacute; por una fase a la
que podr&iacute;amos calificar de "ornamental" que hoy
est&aacute; cayendo en desuso. Es l&oacute;gico que
as&iacute; fuera, ya que hasta que no se han desarrollado
tecnolog&iacute;as de compresi&oacute;n efectivas, no se
pod&iacute;a plantear la utilizaci&oacute;n del sonido como
soporte para la transmisi&oacute;n de informaci&oacute;n.<br>


<br>


Hoy en d&iacute;a tenemos la posibilidad de realizar un uso
m&aacute;s profundo del sonido y aprovechar los fragmentos sonoros
para incluir informaci&oacute;n relacionada &iacute;ntimamente
con el contenido general del sitio WEB que estamos desarrollando.</p>


<p><a name="indice">&nbsp;</a></p>


<div class="indentado25"><a href="#wavymid">Archivos
sonoros para la WEB</a><br>


<a rel="parent" href="multi2b.html">Insertar
sonidos en N|VU</a><br>


<a rel="date" href="TutorialHelix/compresionconhelixb.htm">Compresi&oacute;n
con Real Producer Basic</a></div>


<p><a name="wavymid">&nbsp;</a></p>


<h2>Archivos&nbsp;<acronym title="Ap&oacute;cope de WAVEform audio format">wav</acronym>
y&nbsp;<acronym title="Musical Instrument Digital Interface">mid</acronym></h2>


<p>Tras la primera puntualizaci&oacute;n vamos a abordar el
trabajo con ambas utilizaciones del sonido. Empezaremos por la
aplicaci&oacute;n que se acaba de denominar "ornamental".</p>


<p>Al igual que en el caso de la imagen disponemos de dos
formatos de sonido directamente legibles por los navegadores: el
formato <acronym title="Musical Instrument Digital Interface">midi</acronym>
(archivos con extensi&oacute;n .mid) y el formato de
onda (archivos con extensi&oacute;n .<acronym title="Ap&oacute;cope de WAVEform audio format">wav</acronym>).</p>


<p>Los&nbsp;<strong><span>archivos <acronym title="Musical Instrument Digital Interface">midi</acronym>
</span></strong><span style="font-weight: normal;"></span>&nbsp;est&aacute;n
basados
en partituras en las que se indica el tono y duraci&oacute;n de
cada una de las notas, as&iacute; como el instrumento que
interpreta cada pista. Su caracter&iacute;stica principal es el
escaso espacio que ocupan en comparaci&oacute;n con la
informaci&oacute;n que incluyen. Al fin y al cabo no son
m&aacute;s que una colecci&oacute;n de anotaciones para que la
tarjeta de sonido pueda traducirlas. Resultan adecuados, pues, para
incorporar pasajes musicales.&nbsp; </p>


<p>Dado que los archivos&nbsp;<acronym title="Musical Instrument Digital Interface">midi</acronym>
se basan en partituras tienen la
ventaja de poder crearse y modificarse con facilidad si se tienen
nociones de m&uacute;sica. Presentan, en cambio, el inconveniente
de que la calidad de la reproducci&oacute;n depender&aacute; de
la tarjeta de sonido con la que se escuchen, ya que si &eacute;sta
es de
escasa calidad los timbres de los instrumentos se asemejar&aacute;n
poco al sonido real.&nbsp; </p>


<p>En los archivos de <strong>formato <acronym title="Ap&oacute;cope de WAVEform audio format">wav</acronym></strong>
invertimos
los t&eacute;rminos: son muy extensos porque se basan en la
digitalizaci&oacute;n directa de una fuente de sonido.
Adem&aacute;s, no dependen demasiado de la calidad de la tarjeta de
sonido en que se reproducen y no resultan adecuados para fragmentos
musicales largos, sino para efectos especiales y voz. (Siempre
habr&aacute; que procurar utilizar fragmentos breves debido a su
gran extensi&oacute;n).
</p>


<p>Sea cual sea el formato que utilicemos el factor principal a
tener en cuenta ser&aacute; la extensi&oacute;n de los archivos.<br>


<br>


</p>


<p class="estilo">Independientemente de que el
equipo con el que elaboremos las p&aacute;ginas sea muy potente,
nunca podemos saber con qu&eacute; equipo y, sobre todo, con
qu&eacute; tipo de conexi&oacute;n acceder&aacute;n a
nuestra
p&aacute;gina los futuros visitantes y... una p&aacute;gina que
tarda mucho en cargarse no suele incorporarse a la libreta de
marcadores y es dif&iacute;cil que vuelva a ser visitada.&nbsp;
</p>


<p></p>


<div class="practicas">
<p><img class="numact" style="width: 29px; height: 29px; float: left;" alt="Actividad 38" title="Actividad 38" src="../../imagenes/numeracion/treintayocho.gif">&nbsp;Esta
pr&aacute;ctica es absolutamente voluntaria, aunque te
vendr&aacute; bien hacerla para poder utilizar el archivo que
obtengas como elemento de comparaci&oacute;n en las siguientes
pr&aacute;cticas. Para hacerlo tendr&aacute;s que disponer de
un micr&oacute;fono conectado a tu ordenador. Si no dispones de
micr&oacute;fono o, por cualquier motivo, decides no realizar la
pr&aacute;ctica podr&aacute;s utilizar alguno de los archivos
que incorpora Windows.</p>


<ul>


  <li>Pulsa el bot&oacute;n Inicio y accede a la Grabadora de
sonidos (La encontrar&aacute;s en Programas, Accesorios,
Entretenimiento).</li>


  <li>Piensa un breve saludo para incluir en tu p&aacute;gina
y gr&aacute;balo pulsando el bot&oacute;n rojo de la grabadora.
Para finalizar la grabaci&oacute;n deber&aacute;s pulsar el
bot&oacute;n de parada que est&aacute; junto al de
grabaci&oacute;n.</li>


  <li>Guarda el archivo cuando lo consideres v&aacute;lido.</li>


  <li>Comprueba en el explorador el tama&ntilde;o del archivo
que acabas de grabar. </li>


</ul>


</div>


<p>Bien, ahora que ya tienes un archivo en formato&nbsp;<acronym title="Ap&oacute;cope de WAVEform audio format">wav</acronym>
vamos a
necesitar otro en formato&nbsp;<acronym title="Musical Instrument Digital Interface">midi</acronym>.
Puedes utilizar el archivo que
obtendr&aacute;s si pulsas con el bot&oacute;n secundario en
este <a href="../imagenes/primavera.mid" target="_blank">enlace</a>
y eliges <span class="refmenu">guardar destino como</span>
(en Internet Explorer), <span class="refmenu">guardar
destino del
enlace como</span> (en Mozilla Suite) o <span class="refmenu">guardar&nbsp;
enlace como</span> (en Mozilla Firefox). Gu&aacute;rdalo en
la carpeta en la que
est&aacute;s almacenando las p&aacute;ginas de
pr&aacute;cticas.
</p>


<p>Vamos a ver ahora c&oacute;mo hacer que las
p&aacute;ginas alberguen estos sonidos.<br>


</p>

<div class="flotder"></div>


</div>


</body>
</html>
