<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html lang="es-es">
<head>
  <title>Trabajando con los gr&aacute;ficos</title>


  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">

<!-- compliance patch for microsoft browsers --><!--[if lt IE 7]>
<script src="../ie7/ie7-standard-p.js" type="text/javascript"></script>
<![endif]-->
  <link type="text/css" href="../nvu2005.css" rel="stylesheet">

  <link rel="stylesheet" href="../multi2.css" type="text/css">

  <link href="../body.css" rel="stylesheet" type="text/css">
</head>


<body>

<div id="localizador">
<p>Multimedia>>Imagen</p>

</div>
<div id="flechadcha">
<a href="multi1d.htm" title="avanzar"><img src="../Images/flechadcha.gif" border="0"></a>
</div>
<div id="flechaizq">
<a href="multi1b.htm" title="retroceder"><img src="../Images/flechaizq.gif" border="0"></a>
</div>

<div class="solapas">
<ul>

  <li><a href="multi1.htm">Conceptos
generales</a></li>

  <li><a href="multi1b.htm">Formatos
gr&aacute;ficos</a></li>

  <li class="activo"><a href="multi1c.htm">Escalar
im&aacute;genes</a></li>

  <li><a href="multi1d.htm">Recortar y rotar</a></li>

  <li><a href="multi1e.htm">Insertar
im&aacute;genes</a></li>

  <li><a href="multi1f.htm">L&iacute;neas e
imagen fantasma</a></li>

</ul>

</div>

<div class="principal">
<h2>Escalar im&aacute;genes</h2>

<p>&Uacute;ltimamente empiezan a aparecer un cierto
n&uacute;mero de utilidades de caracter gratuito que nos permiten
realizar una serie de modificaciones en nuestras im&aacute;genes
para adaptarlas a su utilizaci&oacute;n en la WEB. El principal
problema que se encuentra es que, aquellas que ofrecen unas
prestaciones suficientes se encuentran en ingl&eacute;s. Otra
alternativa que puede ser v&aacute;lida es el software que
acompa&ntilde;a a los esc&aacute;neres, ya que en muchos casos
ofrece las funciones necesarias y est&aacute; en castellano. Ahora
bien, teniendo en cuenta que no todo el mundo tiene que disponer de un
esc&aacute;ner se ha optado por la utilidad que pasamos a revisar.</p>

<p>Aunque se trata de un programa muy potente con gran cantidad
de&nbsp;posibilidades interesantes para el tratamiento de imagen,
nos
centraremos en la aplicaci&oacute;n de Gimp para la
modificaci&oacute;n del tama&ntilde;o de las
im&aacute;genes y su conversi&oacute;n de uno a otro formato.</p>

<p><img class="flotder" style="width: 158px; height: 227px;" alt="visor sin vista previa" title="visor sin vista previa" src="../gimp/sinvistaprevia.png" hspace="10">Una vez
que pulsamos en la opci&oacute;n de men&uacute; <span class="refmenu">archivo</span><strong class="refmenu">
<img src="../imagenes/flechamenu.png" height="13" width="14"> </strong><span class="refmenu">abrir</span>
podremos movernos por las diferentes carpetas y
seleccionar la imagen sobre la que queremos trabajar. </p>

<p>Si la imagen no se ha abierto previamente con Gimp veremos que
en la zona derecha aparece una informaci&oacute;n con el nombre y
el tama&ntilde;o que la imagen ocupa en el disco aunque, de forma
pr&aacute;cticamente instant&aacute;nea se genar&aacute; la
vista previa de la imagen. Si no es as&iacute; podemos probar
pulsando sobre el
icono <img style="width: 71px; height: 53px;" alt="logotipo Gilbert" title="logotipo Gilbert" src="../gimp/gilbert.png">para intentar obtener la vista
previa aunque es probable que, por&nbsp; diversos motivos, el
programa no sea capaz de generarla. </p>

<p>As&iacute; pues, salvo casos
excepcionales&nbsp;tendremos disponible una&nbsp;miniatura de
la imagen y los datos de nombre y
tama&ntilde;o en disco,&nbsp;el&nbsp;tama&ntilde;o en
p&iacute;xeles, la profundidad de color y el n&uacute;mero de
capas.</p>

<p>Ya sabemos que uno de los motivos por los que necesitamos
alguna utilidad de tratamiento de im&aacute;genes es para acelerar
la carga de nuestras p&aacute;ginas. Vamos a suponer que la imagen
que estamos abriendo es demasiado grande y queremos ajustar su
tama&ntilde;o para que coincida con el que realmente se
mostrar&aacute; en la p&aacute;gina WEB.</p>

<p class="centrado"><img style="width: 538px; height: 450px;" alt="abrir una imagen en Gimp" title="abrir una imagen en Gimp" src="../gimp/abririmagen.png"></p>

<p><img style="width: 390px; height: 342px;" alt="opciones de escalado de una imagen" title="opciones de escalado de una imagen" src="../gimp/cambiotamanio.png" class="flotder"></p>

<p>Una vez que hemos aceptado para abrir la imagen vamos a
la men&uacute; de la ventana de imagen y seleccionamos
Seleccionaremos la opci&oacute;n <span class="refmenu">imagen</span><strong class="refmenu">
<img src="../imagenes/flechamenu.png" height="13" width="14"> </strong><span class="refmenu">escalar
la imagen</span>.<br>

</p>

<p>La pantalla de trabajo me informa del tama&ntilde;o
actual de la imagen en p&iacute;xeles que puedo modificar
directamente, aunque tambi&eacute;n puedo optar por seleccionar la
modificaci&oacute;n porcentual de las dimensiones respecto al
tama&ntilde;o original.</p>

<p>Dado que estamos modificando el tama&ntilde;o para
la presentaci&oacute;n en pantalla la zona que nos interesa es la
superior, aunque comprobaremos que, salvo que modifiquemos la
resoluci&oacute;n, el tama&ntilde;o de impresi&oacute;n se
ajustar&aacute; autom&aacute;ticamente para reflejar la
modificaci&oacute;n realizada en el tama&ntilde;o de pantalla. </p>

<p>Es importante que matengamos activo el icono <b><img style="width: 19px; height: 34px;" alt="icono de eslabones de cadena" title="icono de eslabones de cadena" src="../gimp/enlazados.png">
</b>que relaciona el
tama&ntilde;o
horizontal y vertical de forma que se mantengan las proporciones entre
el largo y el ancho de la imagen cuando &eacute;sta cambie de
tama&ntilde;o.
</p>

<br clear="all">

<p class="aviso avisos"><img class="flotizq" title="advertencia" style="width: 28px; height: 25px;" alt="advertencia" src="../imagenes/atencion.gif">Teniendo
en cuenta que trabajamos con im&aacute;genes de mapas de bits
aumentar el tama&ntilde;o supondr&aacute; hacer m&aacute;s
visibles los p&iacute;xeles que forman la imagen, por lo que no es
muy recomendable. </p>

<div class="practicas"> <img class="numact" style="width: 29px; height: 29px; float: left;" alt="Actividad 28" title="Actividad 28" src="../imagenes/numeracion/veintiocho.gif">
<p>En la carpeta Imagenes del CD-ROM
encontrar&aacute;s la imagen amapolas.png. Si no quieres
ponerte a buscarla ahora puedes utilizar la pulsaci&oacute;n con el
bot&oacute;n secundario del rat&oacute;n para obtenerla desde
la ventana que se abrir&aacute; al pulsar la miniatura.<a href="javascript:void(0)" onclick="window.open('imagenamapolas.html','','statusbar=0,menubar=0,toolbar=0,top=0,left=0,width=614,height=819')"><img style="border: 0px solid ; width: 55px; height: 73px;" alt="Mostrar la imagen amapolas.png a tama&ntilde;o real en una nueva ventana" src="imagenes/amapolasico.png" title="Mostrar la imagen amapolas.png a tama&ntilde;o real en una nueva ventana"></a></p>

<ul>

  <li>Carga la imagen en Gimp y modifica su tama&ntilde;o
para que quede con una anchura de 300 p&iacute;xeles. Comprueba que
tienes activado el enlace para mantener las proporciones.</li>

  <li>Utiliza <span class="refmenu">archivo <img src="../imagenes/flechamenu.png" height="13" width="14">
guardar como</span>
para almacenar la imagen en formato JPG. <br>

    <div class="avisos"><img class="flotizq" title="advertencia" style="width: 28px; height: 25px;" alt="advertencia" src="../imagenes/atencion.gif">Ver&aacute;s
que aparece
un panel para&nbsp;<span class="refmenu">ajustar&nbsp;par&aacute;metros</span>
que tiene establecido el nivel de <span class="refmenu">calidad</span>
en un valor de 85. Es un nivel que provoca una p&eacute;rdida de
calidad imperceptible pero una importante reducci&oacute;n de
tama&ntilde;o. Para comprobar el efecto de variar este valor puedes
activar&nbsp;la opci&oacute;n <img title="Mostrar vista previa ..." style="width: 249px; height: 17px;" alt="Mostrar vista previa ..." src="../gimp/preview.png">&nbsp;y,
adem&aacute;s de mostrarte el resultado que obtendr&aacute;s
con cada nivel, el programa te informar&aacute; del
tama&ntilde;o que ocupar&aacute; la imagen al almacenarse.</div>

  </li>

  <li>Guarda el archivo en formato GIF. Dado que el formato gif
trabaja con una paleta de colores reducida te avisar&aacute; de la
necesidad de convertir la imagen para adaptarla a la paleta de 256
colores o a una im&aacute;gen en tonos de gris que
tambi&eacute;n tiene una gama de 256 valores. <img title="Convertir imagen de color real a indexado" style="width: 267px; height: 32px;" alt="Convertir imagen de color real a indexado" src="../gimp/convertiraindexada.png"> </li>

  <li>Para poder actualizar las vistas correctamente cierra las
im&aacute;gense y utiliza <span class="refmenu">archivo
    <img src="../imagenes/flechamenu.png" height="13" width="14">abrir</span> para volver a cargar ambas
im&aacute;genes en Gimp. Aprovecha
el momento de la selecci&oacute;n para comparar&nbsp;el
tama&ntilde;o en KB que ocupa cada una de las
ellas seg&uacute;n la informaci&oacute;n que se muestra en la
miniatura de vista previa.</li>

  <li>Tambi&eacute;n podr&aacute;s realizar una
comprobaci&oacute;n sobre las diferencias cualitativas entre ambas
im&aacute;genes para lo que te resultar&aacute; muy
&uacute;til ampliarlas mediante la opci&oacute;n de
men&uacute; <span class="refmenu">
ver <img src="../imagenes/flechamenu.png" height="13" width="14"> ampliaci&oacute;n <img src="../imagenes/flechamenu.png" height="13" width="14">
2:1(200%)</span> (Tambi&eacute;n puedes utilizar el indicador
de porcentaje que aparece en la barra de estado de la ventana de la
imagen).</li>

</ul>

</div>

<div class="practicas">
<img class="numact" style="width: 29px; height: 29px; float: left;" alt="Actividad 29" title="Actividad 29" src="../imagenes/numeracion/veintinueve.gif">
<ul>

  <li>Vuelve a cargar
la imagen&nbsp;amapolas.png en Gimp y
modifica su tama&ntilde;o para que resulte al 50% de su
tama&ntilde;o actual. Comprueba que tienes activada la casilla para
mantener las proporciones.</li>

  <li>A
veces, cuando se hacen
reducciones de imagen, se produce una p&eacute;rdida de nitidez.
Para corregirlo puedes probar con alguno de los filtros que
encontrar&aacute;s en <span class="refmenu">filtros</span>
    <img class="refmenu" src="../imagenes/flechamenu.png" height="13" width="14"><span class="refmenu">
realzar</span>,
preferiblemente con <span class="refmenu">enfocar</span>
y <span class="refmenu">m&aacute;scara de desenfoque</span>.
(En unas ocasiones te parecer&aacute; que el efecto mejora el
resultado
final y en otras no, as&iacute; que tendr&aacute;s que probarlo)</li>

  <li>Realiza nuevamente una comparaci&oacute;n de <span style="font-style: italic;">"peso"</span> y calidad de
las im&aacute;genes.&nbsp;</li>

  <li>Es probable que en esta ocasi&oacute;n notes una
diferencia algo menor en la calidad: Ten en cuenta que la
reducci&oacute;n de tama&ntilde;o ha introducido en ambas
im&aacute;genes una importante p&eacute;rdida de
informaci&oacute;n)</li>

</ul>

</div>

<div class="estilo">
<p>El formato&nbsp;<acronym title="Joint Photographic Experts Group">JPG</acronym>
est&aacute; basado en filtros y algoritmos
de compresi&oacute;n que provocan una p&eacute;rdida en la
calidad de la imagen.<br>

<br>

Si necesitas hacer modificaciones de una imagen procura hacerlo de una
sola vez, puesto que si las vas haciendo por etapas ir&aacute;s
acumulando las sucesivas compresiones, ... y sus correspondientes
p&eacute;rdidas de calidad. <br>

<br>

No es mala idea conservar la imagen original en un formato sin
p&eacute;rdida (tif o png pueden ser buenas alternativas) y guardar
las modificaciones con nombre diferente, ya que as&iacute; se
podr&iacute;an volver a aplicar todas juntas a partir de la imagen
original con su nivel m&aacute;ximo de calidad. </p>

<div class="avisos"><img class="flotizq" title="advertencia" style="width: 28px; height: 25px;" alt="advertencia" src="../imagenes/atencion.gif">Los
cambios de
tama&ntilde;o de la imagen&nbsp;producen resultados bastante
deficientes cuando se aplican a im&aacute;genes de color indexado.
Si quieres reducir una imagen en formato gif elige desde el
men&uacute; <span class="refmenu">imagen <img src="../imagenes/flechamenu.png" height="13" width="14">
modo <img src="../imagenes/flechamenu.png" height="13" width="14">
rgb</span>, o pulsa
sobre ella con el bot&oacute;n derecho y elige la misma
opci&oacute;n en el men&uacute; contextual. (Tambi&eacute;n
deber&aacute;s hacer esta comprobaci&oacute;n cuando intentes
modificar im&aacute;genes png, aunque en este caso es posible que
encuentres la opci&oacute;n <acronym title="Red Green Blue">RGB</acronym>
atenuada porque la imagen ya
est&eacute; en modo&nbsp;<acronym title="Red Green Blue">RGB</acronym>
ya que, como sabes, este formato
soporta ambos modos)</div>

</div>

</div>

</body>
</html>
