<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html lang="es-es">
<head>
  <title>Incluyendo im&aacute;genes en las p&aacute;ginas</title>


  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">

<!-- compliance patch for microsoft browsers --><!--[if lt IE 7]>
<script src="../ie7/ie7-standard-p.js" type="text/javascript"></script>
<![endif]-->
  <link type="text/css" href="../nvu2005.css" rel="stylesheet">

  <link rel="stylesheet" href="../multi2.css" type="text/css">

  <link href="../body.css" rel="stylesheet" type="text/css">
</head>


<body>
<div id="localizador">
<p>Multimedia>>Imagen</p>

</div>
<div id="flechadcha">
<a href="multi1f.htm" title="avanzar"><img src="../Images/flechadcha.gif" border="0"></a>
</div>
<div id="flechaizq">
<a href="multi1d.htm" title="retroceder"><img src="../Images/flechaizq.gif" border="0"></a>
</div>


<div class="solapas">
<ul>

  <li><a href="multi1.htm">Conceptos
generales</a></li>

  <li><a href="multi1b.htm">Formatos
gr&aacute;ficos</a></li>

  <li><a href="multi1c.htm">Escalar
im&aacute;genes</a></li>

  <li><a href="multi1d.htm">Recortar y rotar</a></li>

  <li class="activo"><a href="multi1e.htm">Insertar
im&aacute;genes</a></li>

  <li><a href="multi1f.htm">L&iacute;neas e
imagen fantasma</a></li>

</ul>

</div>

<div class="principal">
<h2>Incluyendo im&aacute;genes en las
p&aacute;ginas&nbsp; </h2>

<p>Cuando pulsamos el icono <img style="width: 47px; height: 40px;" alt="Insertar imagen" title="Insertar imagen" src="imagenes/icoinsertaimagen.png">
para insertar
im&aacute;genes se despliega una ventana de opciones muy completa.</p>

<p>La primera pesta&ntilde;a se utilizar&aacute; para
seleccionar el archivo de imagen que pretendemos incluir en la
p&aacute;gina. Al pulsar el bot&oacute;n correspondiente
iniciaremos una navegaci&oacute;n por el disco para buscar el
archivo de imagen que queremos incluir en la p&aacute;gina.</p>

<p>La configuraci&oacute;n por defecto tiene activada la
opci&oacute;n <img style="width: 110px; height: 24px;" alt="Texto alternativo" title="Texto alternativo" src="imagenes/textoalternativo.png">
por lo
que si pulsamos <img style="width: 65px; height: 22px;" alt="Bot&oacute;n &quot;Aceptar&quot;" title="Bot&oacute;n &quot;Aceptar&quot;" src="imagenes/botonaceptar.png"> sin
haber tecleado un texto nos encontraremos con un aviso que nos recuerda
la funci&oacute;n del mismo.</p>

<p class="centrado"><img style="height: 125px; width: 547px;" alt="Aviso de que falta texto alternativo" title="Aviso de que falta texto alternativo" src="imagenes/avisotextoalt.png"> </p>

<p>Cuando iniciemos la exploraci&oacute;n de las carpetas se
mostrar&aacute;n las im&aacute;genes almacenadas en alguno de
los tres formatos con los que hemos trabajado hasta ahora: <acronym title="Graphics Interchange Format">gif</acronym>, <acronym title="Portable Network Graphics">png</acronym> y
<acronym title="Joint Photographic Experts Group">jpg</acronym>.
De todas maneras podemos utilizar la vista <strong><img style="width: 99px; height: 21px;" alt="C&oacute;digo fuente" title="C&oacute;digo fuente" src="../imagenes/pestanacodigofuente.png"></strong>
para
introducir directamente en el c&oacute;digo la referencia a una
imagen guardada en formato <acronym title="de BitMaP">bmp</acronym>
que tambi&eacute;n se
mostrar&aacute; correctamente, pero no es recomendable hacerlo, ya
que el tama&ntilde;o de las im&aacute;genes bmp es muy grande
al tratarse de un archivo sin p&eacute;rdida y
no son adecuadas para su transmisi&oacute;n
por Internet.</p>

<p><img class="flotder" style="width: 324px; height: 231px;" alt="Redimensionar arrastrando" title="Redimensionar arrastrando" src="imagenes/redimension.jpg">La
segunda pesta&ntilde;a permitir&aacute; mantener el
tama&ntilde;o original o modificarlo introduciendo las nuevas
dimensiones si seleccionamos <img style="width: 134px; height: 21px;" alt="Tama&ntilde;o personalizado" title="Tama&ntilde;o personalizado" src="imagenes/tamaniopersonalizado.png">
e introducimos los valores
num&eacute;ricos que queremos adjudicarle. Tambi&eacute;n
puedo, cuando he seleccionado una imagen y la tengo ya en la pantalla,
modificar su tama&ntilde;o si pincho y arrastro alguno de sus
v&eacute;rtices. (Si lo hiciera sobre uno de los lados la
modificaci&oacute;n no respetar&iacute;a las proporciones).
Este procedimiento ser&iacute;a el equivalente gr&aacute;fico
de la modificaci&oacute;n num&eacute;rica de las dimensiones en
la pantalla general de la imagen.</p>

<p>Si nos planteamos nuestra comodidad a la hora de
dise&ntilde;ar la p&aacute;gina est&aacute; claro que es un
m&eacute;todo muy r&aacute;pido, pero... ya hemos visto como
existe un procedimiento bastante r&aacute;pido para <a href="multi1c.htm">escalar las im&aacute;genes</a>
y hacer que el "peso" de las mismas se redujera considerablemente,
as&iacute; que ... si tenemos en cuenta a los posibles visitantes
de nuestra p&aacute;gina la &uacute;nica conclusi&oacute;n
razonable es: <br clear="all">

</p>

<div class="avisos">
<p><img class="flotizq" src="../imagenes/atencion.gif" align="left" height="25" width="28">&iexcl;No
lo hagas nunca!
&iquest;Por qu&eacute; tienes que obligar a quien visita la
p&aacute;gina a que descargue toda la informaci&oacute;n de la
imagen original para que luego su navegador ajuste el tama&ntilde;o
y le muestre una miniatura?</p>

</div>

<p><img class="flotizq" style="width: 417px; height: 334px;" alt="Pesta&ntilde;a de propiedades de imagen" title="Pesta&ntilde;a de propiedades de imagen" src="imagenes/propiedadesdeimagenes.png">
La pesta&ntilde;a <img style="width: 66px; height: 22px;" alt="Apariencia" title="Apariencia" src="imagenes/pestaniaapariencia.png">
presenta una
pantalla en la que se pueden indicar el espaciado alrededor de la
imagen, el grosor de los bordes y la alineaci&oacute;n entre el
texto y&nbsp;la imagen.&nbsp;</p>

<p>Los iconos que representan la alineaci&oacute;n del texto
respecto a la imagen&nbsp;son suficientemente
explicativos: la imagen que introducimos, independientemente de su
tama&ntilde;o, tiene la misma consideraci&oacute;n que una
letra, por lo que &nbsp;&nbsp;&nbsp;habr&aacute; que
tener en cuenta que las alineaciones superior, central e inferior
s&oacute;lo se aplicar&aacute;n al texto que quepa hasta el
siguiente salto de l&iacute;nea, ya que al producirse el salto de
l&iacute;nea el siguiente rengl&oacute;n se colocar&aacute;
debajo del que se acaba de completar. Aunque esto se ver&aacute;
con detenimiento cuando se estudien los estilos podemos adelantar que
es porque las im&aacute;genes, al igual que las letras formar lo
que se denomina un elemento <em>"en l&iacute;nea"</em>
a la hora de construir una p&aacute;gina.</p>

<p>Como lo que se pretende habitualmente cuando utilizamos la
alineaci&oacute;n entre texto e im&aacute;genes es que el texto
fluya alrededor de la imagen lo m&aacute;s com&uacute;n
ser&aacute; utilizar una de las dos &uacute;ltimas opciones que
permiten que la imagen se alinee a la derecha o la izquierda,
respectivamente mientras el texto fluye por el costado libre. </p>

<p>En cuanto al espacio alrededor de la imagen es de cero
p&iacute;xeles, tanto en horizontal como en vertical, al igual que
el borde s&oacute;lido. Si queremos que la imagen mantenga una
distancia respecto al texto que la rodea ser&aacute;
aqu&iacute; donde lo especifiquemos.<br clear="all">

</p>

<div class="practicas"> <img class="numact" style="width: 29px; height: 29px; float: left;" alt="Actividad 33" title="Actividad 33" src="../imagenes/numeracion/treintaytres.gif">
<ul>

  <li> Salva en tu disco las tres im&aacute;genes siguientes
con el procedimiento que ya conoces.<img style="border: 0px solid ; width: 22px; height: 23px;" alt="Miniatura de un archivo gif animado" title="Miniatura de un archivo gif animado" src="../imagenes/tele.gif"><img style="border: 0px solid ; width: 25px; height: 23px;" alt="Miniatura de un archivo gif est&aacute;tico" title="Miniatura de un archivo gif est&aacute;tico" src="../imagenes/clara1.gif"><img style="border: 0px solid ; width: 24px; height: 21px;" alt="Miniatura de un archivo jpg" title="Miniatura de un archivo jpg" src="../imagenes/clara1.jpg"></li>

</ul>

<ul>

  <li> Crea un documento nuevo y construye una tabla de una fila
y tres columnas.&nbsp;</li>

  <li> Incluye en cada celda una de las im&aacute;genes
fij&aacute;ndote en cual pones las im&aacute;genes gif y en
cual est&aacute; la jpg. Pasa al navegador guardando el trabajo
como <strong>actividad33.html</strong>&nbsp;(hemos
ajustado la numeraci&oacute;n saltando saltado las actividades 27 a
32
en las que no hab&iacute;amos creado ninguna
p&aacute;gina y mantenemos la numeraci&oacute;n de los archivos
en correspondencia con el n&uacute;mero de pr&aacute;ctica).</li>

  <li> Comprueba la diferencia en la calidad de las dos fotos
seg&uacute;n el formato.&nbsp;</li>

</ul>

</div>

<div class="avisos">
<p><img class="flotizq" src="../imagenes/atencion.gif" align="left" height="25" width="28">Una vez
que hemos incluido una imagen en nuestra p&aacute;gina podremos
volver en cualquier momento a la pantalla de propiedades para modificar
alguna de las caracter&iacute;sticas. Para ello podemos hacer doble
clic sobre la imagen, pulsar con el bot&oacute;n secundario del
rat&oacute;n sobre la imagen y elegir <span class="refmenu">propiedades
de la
imagen</span>, o bien utilizar la
opci&oacute;n de
men&uacute; <span class="refmenu">formato <img src="../imagenes/flechamenu.png" height="13" width="14">
propiedades de imagen</span>.</p>

</div>

<div class="practicas"> <img class="numact" style="width: 29px; height: 29px; float: left;" alt="Actividad 34" title="Actividad 34" src="../imagenes/numeracion/treintaycuatro.gif">
<ul>

  <li> Vuelve al editor y abre la pr&aacute;ctica anterior si
la hab&iacute;as cerrado.</li>

  <li>Activa las propiedades de la imagen y modifica el <b>tama&ntilde;o</b>
de las fotos reduciendo el ancho y el alto a la mitad en una de ellas y
pasando al doble en la otra. Tambi&eacute;n puedes modificar en una
de ellas el <b>espacio a izquierda y derecha </b>poniendo,
por ejemplo 50 p&iacute;xels.&nbsp;</li>

  <li> Pasa a la vista preliminar o al navegador para ver el
efecto.&nbsp;</li>

  <li> Vuelve a la vista normal y escribe un texto junto a una de
la im&aacute;genes. Experimenta con diferentes alineaciones del
texto con respecto a ella.&nbsp;</li>

  <li> Salva el trabajo como&nbsp;<strong>actividad34.html</strong></li>

</ul>

</div>

<div class="estilo">
<p>Aunque no se pueden dictar normas
generales, suele ser recomendable que dejemos un espaciado horizontal
alrededor de la imagen. Ten en cuenta que dicho espacio se
aplicar&aacute; a ambos lados de la imagen. El espaciado vertical
no suele ser necesario, ya que el propio interlineado es suficiente en
la mayor&iacute;a de los casos.</p>

<p>En cuanto al borde s&oacute;lido no es m&aacute;s que
un marco
(de color negro) que se coloca alrededor de la imagen. No aporta mucho
est&eacute;ticamente y puede acabar por dar un cierto tono
f&uacute;nebre, ya que si se pone un poco grueso recuerda
inevitablemente a una esquela mortuoria. Posiblemente s&oacute;lo
est&eacute; justificado en determinadas im&aacute;genes en las
que, por sus especiales caracter&iacute;sticas, el marco pueda
suponer un realce est&eacute;tico.</p>

<p>Si la imagen soporta un enlace el cuadro se pone de color azul
o morado
seg&uacute;n hayamos visitado o no el enlace. El lenguaje
gr&aacute;fico de la WEB ha evolucionado lo suficiente como para
que no sea necesario indicar con un recuadro que esa imagen es un
enlace. </p>

<p>Si en alg&uacute;n momento
pretendes
localizar en el c&oacute;digo las etiquetas que tienen que ver con
las im&aacute;genes ver&aacute;s que tienen la siguiente forma
seg&uacute;n el modo de trabajo que est&eacute;s utilizando</p>

<p>Si trabajas con los estilos CSS desactivados:
</p>

<p><code>&lt;img src="atencion.gif" width="28"
height="25" alt="marca de aviso"&gt;</code></p>

<p>Si trabajas con los estilos CSS activados:</p>

<p><code>&lt;img src="atencion.gif"
style="width:28px;
height:25px; float:right;" alt="marca de aviso"&gt;</code></p>

<p>Como ves, en el caso de trabajar con CSS los atributos de
ancho, alto y
alineaci&oacute;n, se agrupan dentro del selector style.
Adem&aacute;s hay una interpretaci&oacute;n desde diferente
punto de vista de la alineaci&oacute;n: &nbsp;mientras que en
el primer caso se considera el punto en el que se encuentra alineada la
imagen (align="left") en el segundo se utiliza la idea de
flotaci&oacute;n, indicando el lugar en el que flotar&aacute;
la imagen&nbsp;(float: left). El resto de elementos de la
etiqueta son&nbsp;la identificaci&oacute;n de la
fuente de imagen, esto es, el nombre del archivo, y&nbsp;el
atributo alt &nbsp;que nos indica&nbsp;el texto
descriptivo que se mostrar&aacute; durante el proceso de carga o
cuando est&eacute; desactivada la visualizaci&oacute;n de
im&aacute;genes.</p>

<p><img src="../imagenes/atencion.gif" height="25" width="28"> Es muy importante
que figuren los atributos de anchura y altura, porque eso permite al
navegador que reserve un espacio para la imagen y contin&uacute;e
cargando el resto de la p&aacute;gina aunque no haya recibido
completamente la imagen. N|VU calcula autom&aacute;ticamente estas
medidas a partir de las dimensiones de la imagen y las incluye en el
c&oacute;digo.</p>

</div>

<br>

<div class="avisos">
<p> <img src="../imagenes/atencion.gif" height="25" width="28">El recordatorio que presenta
N|VU es muy claro en cuanto a la funci&oacute;n que
desempe&ntilde;a el texto alternativo. Sin embargo, una mala
pr&aacute;ctica tradicional, a la que ha colaborado la
interpretaci&oacute;n que hace Internet Explorer del atributo <code>alt</code>,
ha confundido su funci&oacute;n: Internet Explorer presenta el
texto alternativo como texto emergente que se muestra al colocarse
sobre una imagen, cuando si queremos conseguir ese efecto lo correcto
es utilizar el atributo <code>title</code>. Los
navegadores que&nbsp;se ajustan a las especificaciones
del <acronym title="World Wide Web Consortium">W3C</acronym>&nbsp;s&oacute;lo
muestran texto emergente cuando se ha
utilizado el atributo <code>title</code>, reservando el
contenido <code>alt</code> para la
funci&oacute;n que se ha creado. </p>

<p>Para especificar el texto podemos hacerlo de varias
formas:&nbsp;</p>

<ol>

  <li>usando <img style="width: 370px; height: 23px;" alt="Caja de t&iacute;tulo emergente" title="Caja de t&iacute;tulo emergente" src="imagenes/tituloemergente.png"> en la
ventana de selecci&oacute;n de imagen&nbsp;</li>

  <li>haciendo clic con el bot&oacute;n derecho
sobre&nbsp;la etiqueta <code>&lt;img&gt;</code>
en la barra de estado y eligiendo <span class="refmenu">propiedades
avanzadas</span>. Una vez all&iacute; desplegamos los <span class="refmenu">atributos</span>, elegimos <code>title</code>
y escribimos el texto en la caja disponible para especificar el <span class="refmenu">valor</span></li>

  <li>a&ntilde;adiendo dentro de la etiqueta de la imagen el
atributo <code>title="Texto
que aparecer&aacute;"</code> desde
la pesta&ntilde;a <strong><img style="width: 99px; height: 21px;" alt="C&oacute;digo fuente" title="C&oacute;digo fuente" src="../imagenes/pestanacodigofuente.png"></strong></li>

  <li>esto &uacute;ltimo puede ser mucho m&aacute;s
efectivo si, una vez seleccionada la imagen,&nbsp;sea en la
etiqueta de la barra de estado o sobre la propia imagen, elegimos la
opci&oacute;n de men&uacute; <span class="refmenu">insertar
    <img src="../imagenes/flechamenu.png" height="13" width="14"> html</span>, ya que se muestra
directamente la etiqueta que se ver&aacute; afectada, sin necesidad
de buscarla entre todo el c&oacute;digo. </li>

</ol>

</div>

<div class="practicas">
<img class="numact" style="width: 29px; height: 29px; float: left;" alt="Actividad 35" title="Actividad 35" src="../imagenes/numeracion/treintaycinco.gif">
<p>Abre la&nbsp;<strong>actividad34.html</strong>
y modifica las im&aacute;genes para
que incluyan los atributos <code>alt</code> y <code>title</code>.</p>

<p>Si trabajas en Windows es muy conveniente que
compruebes el comportamiento de otros navegadores cuando no
existe la etiqueta <code>title</code>. Para ello es muy recomendable que instales
Firefox y visualices con este navegadorl el resultado de las
p&aacute;ginas que est&aacute;s creando.</p>

</div>

<div class="derecha flotder">
  <p>&nbsp;</p>

</div>

</div>

</body>
</html>
