<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html lang="es-es">
<head>


  
  
  <meta content="text/html; charset=ISO-8859-1" http-equiv="content-type">


  
  
  
  
  <title>Normas de estilo: lo esencial</title>
  <meta content="Ra&uacute;l Luna" name="author">


  
  
  <link rel="stylesheet" type="text/css" href="../nvu2005.css">
<!-- parche de compatibilización con CSS 2 para navegadores microsoft --><!--[if lt IE 7]>
<script src="../ie7/ie7-standard-p.js" type="text/javascript"></script>
<![endif]-->
</head>


<body>

<div id="localizador">
<p>Introducci&oacute;n>>Normas de estilo: lo esencial</p>

</div>
<div id="flechadcha">
<a href="general4.htm" title="avanzar"><img src="../Images/flechadcha.gif" border="0"></a>
</div>
<div id="flechaizq">
<a href="general2.htm" title="retroceder"><img src="../Images/flechaizq.gif" border="0"></a>
</div>


<div id="contenido">

<h2>Unas cuantas ideas esenciales</h2>






<p>&iquest;Cu&aacute;ntas veces hemos o&iacute;do aquello de que el sentido com&uacute;n 
  acaba por ser el menos com&uacute;n de los sentidos? Si este aforismo es, desgraciadamente, 
  bastante acertado en la mayor&iacute;a de los campos de nuestra existencia, 
  parece que acrecentara su validez cuando se trata de una actividad en la que 
  intervienen ordenadores. Es como si supusi&eacute;ramos que la potencia de c&aacute;lculo 
  del ordenador va a ser capaz de suplantar nuestra capacidad de crear, pensar 
  y organizar. Por ello quiero recordar algunos principios esenciales que, debido 
  posiblemente a su obviedad, suelen acabar olvid&aacute;ndose.</p>






<h3>Para comunicar hay que tener algo que decir</h3>



<p>Desde luego, cuando no hay nada que contar lo m&aacute;ximo que podemos lograr, 

  si dominamos la t&eacute;cnica para ello, es crear brillantes y atractivas burbujas 

  vac&iacute;as. </p>



<p>El primer paso que hemos de dar para crear nuestro sitio WEB es aclarar nuestras 

  ideas sobre lo que pretendemos comunicar a trav&eacute;s de sus p&aacute;ginas.</p>






<h3>Una buena idea puede escribirse con mala caligraf&iacute;a...</h3>



<p>Podemos afirmar sin lugar a duda que todos los grandes genios de la literatura 

  tuvieron que aprender a manejar un l&aacute;piz. Y es casi seguro que m&aacute;s 

  de uno hizo sus primeras intentonas literarias con caligraf&iacute;as temblorosas 

  que, a pesar de todo, no ocultaban el talento que hab&iacute;a tras esos trazos.</p>



<p>El lenguaje&nbsp;<acronym title="HyperText Markup Language">HTML</acronym> va a ser la herramienta con la que plasmaremos nuestras ideas 
  para publicarlas en Internet. Como ocurre con cualquier herramienta, la calidad 
  de los trabajos realizados con ella depender&aacute; de la familiarizaci&oacute;n 
  que seamos capaces de adquirir con su manejo ... y eso tiene mucho que ver con 
  la pr&aacute;ctica.</p>






<h3>...aunque es preferible que la caligraf&iacute;a acompa&ntilde;e</h3>



<p>Si atendemos a lo dicho en los p&aacute;rrafos anteriores puede ocurrir que 

  desequilibremos la balanza hacia el platillo del fondo en detrimento del platillo 

  de la forma. Aunque es verdad que el predominio de la forma nos acerca peligrosamente 

  a los fuegos de artificio, no es conveniente que abandonemos un cierto grado 

  de preocupaci&oacute;n por la constante superaci&oacute;n de nuestra "caligraf&iacute;a".</p>



<p>En muchas ocasiones hay aspectos, que parecen meramente formales, cuya incidencia 

  sobre la legibilidad y facilidad de transmisi&oacute;n de los contenidos los 

  alejan del campo del adorno para llevarlos al terreno de la arquitectura del 

  mensaje. </p>






<h3>En el fondo tenemos gustos similares</h3>



<p>Cuando hago esta afirmaci&oacute;n no me refiero a los aspectos est&eacute;ticos, 

  donde est&aacute; claro que encontrar&iacute;amos casi tantos matices como seres 

  humanos.</p>



<p>Pensemos el entorno en el que nos estamos moviendo: navegaci&oacute;n por Internet 

  en un entorno educativo. Hay algunas coordenadas que son comunes a la mayor&iacute;a 

  de los que trazamos esta singladura: </p>



<ul>

  <li>Nos gusta movernos r&aacute;pido.</li>

  <li>Nos impulsa la b&uacute;squeda de informaci&oacute;n relevante.</li>

  <li>Agradecemos que nos brinden sistemas c&oacute;modos de navegaci&oacute;n.</li>

  <li>Nos molestan las visitas a sitios en obras (Me refiero a esos que lo &uacute;nico 

    que tienen es un cartel que nos lo dice, porque la verdad es que una buena 

    WEB siempre deber&iacute;a estar en obras).</li>

  <li>&iquest;Im&aacute;genes y sonidos? Todos los que pida el contenido, pero 

    optimizados, que el que paga la conexi&oacute;n telef&oacute;nica soy yo y 

    no todos tenemos conexiones a velocidades de v&eacute;rtigo.</li>

  <li>...</li>

</ul>



<p>Seguro que encontramos bastantes m&aacute;s puntos de coincidencia. As&iacute; 

  que &iquest;por qu&eacute; no nos planteamos lo que pensar&iacute;amos del autor 

  si fu&eacute;ramos visitantes de la WEB que estamos creando? Por cierto, cuando 

  intentes responder esta pregunta olvida las horas de esfuerzo que le has tenido 

  que dedicar a lo que tienes en tu pantalla ;-)</p>






<h3>Si en mi cabeza no est&aacute; claro &iquest;c&oacute;mo
  

  lo va a estar en la del visitante?</h3>



<p>Una WEB educativa no deber&iacute;a ser uno de esos eventos que se dieron en 

  llamar "performances" en los que cada uno reelaboraba y reinterpretaba 

  la propuesta creativa. Seamos serios: si pretendo transmitir una informaci&oacute;n 

  el proceso es, inicialmente, as&iacute;ncrono y unidireccional. Otra cosa es 

  que arbitre los procedimientos para que haya interactividad, pero el flujo inverso 

  se tendr&aacute; que producir cuando el visitante tenga claro el mensaje y las 

  ideas que le quiero transmitir. Si esas ideas no est&aacute;n organizadas en 

  mi cabeza no podr&eacute; plasmarlas de forma que el visitante las perciba como 

  algo coherente.</p>






<h3>Calor de hogar</h3>



<p>No se trata de que todos los muebles sean iguales, de que todos los cuadros 

  sean del mismo tama&ntilde;o,... pero lo cierto es que cualquier casa tiene 

  un estilo que hace que, por muy grande que sea, cuando cambias de habitaci&oacute;n 

  no sientas que te has mudado a casa de los vecinos. Desgraciadamente son muchos 

  los sitios WEB en los que el salto de p&aacute;gina me hace sentir que me he 

  mudado, m&aacute;s que a casa del vecino, a otro pa&iacute;s. </p>



<p>Cuando pensemos en nuestro sitio WEB deber&iacute;amos hacernos una idea de 

  la "decoraci&oacute;n" general para que los visitantes adquieran de 

  forma inmediata una sensaci&oacute;n de comodidad y de sitio conocido que les 

  facilite la estancia en nuestra "casa virtual".</p>






<h3>&iexcl;Viva la comunicaci&oacute;n viva!</h3>



<p>Juega a gusto con las palabras y dales el sentido que te plazca:</p>



<ul>

  <li>&iquest;La exclamaci&oacute;n jubilosa de un deseo? </li>

  <li>&iquest;Una orden, tal vez?</li>

  <li>&iquest;Quiz&aacute;s un simple eslogan publicitario arropado por ese tono 
    imperativo?</li>

</ul>



<p align="center">La verdad es que mi intenci&oacute;n era un poco m&aacute;s 

  inmediata. Lo que quer&iacute;a decir en realidad es lo siguiente:</p>



<ul>

  <li> &iexcl;Haga usted el favor de no preocupar a sus visitantes haci&eacute;ndoles 

    creer que ha muerto!</li>

</ul>



<p>Si en alg&uacute;n punto de la WEB situamos un enlace que apunte a nuestra 

  direcci&oacute;n de correo tiene que ser con el prop&oacute;sito de contestar 

  a los mensajes que se generen a trav&eacute;s de &eacute;l. Si no es as&iacute;, 

  es preferible que les ahorremos preocupaciones a nuestros visitantes ;-)</p>



<p>&nbsp;</p>



<p></p>
</div>

</body>
</html>
