<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html lang="es-es">
<head>


  
  
  <meta content="text/html; charset=ISO-8859-1" http-equiv="content-type">


  
  
  
  
  <title>&iquest;Qu&eacute; es un hipertexto?</title>
  <meta content="Ra&uacute;l Luna" name="author">


  
  
  <link rel="stylesheet" type="text/css" href="../nvu2005.css">
<!-- parche de compatibilización con CSS 2 para navegadores microsoft --><!--[if lt IE 7]>
<script src="../ie7/ie7-standard-p.js" type="text/javascript"></script>
<![endif]-->
</head>


<body>

<div id="localizador">
<p>Introducci&oacute;n>>¿Qu&eacute; es un hipertexto?</p>

</div>

<div id="flechaizq">
<a href="general1.htm" title="retroceder"><img src="../Images/flechaizq.gif" border="0"></a>
</div>


<div id="contenido">

<h2>&iquest;Qu&eacute; es un hipertexto? </h2>



<p>El concepto de hipertexto responde, fundamentalmente, a una forma de concebir 

  el acceso a la informaci&oacute;n. </p>



<p>El texto impreso podr&iacute;a considerarse un modelo de presentaci&oacute;n 

  de la informaci&oacute;n de manera lineal: la p&aacute;gina 2 sucede a la 1, 

  y as&iacute; sucesivamente, del pr&oacute;logo al ep&iacute;logo. </p>



<p>Sin embargo existen, incluso en soporte impreso, materiales en los que el lector 
  es quien establece la secuencia de acceso a la informaci&oacute;n. Podemos mencionar 
  ejemplos entre grandes obras literarias, como "Rayuela" de Julio Cort&aacute;zar, 
  en modestas obras de literatura infantil, del estilo "Construye tu propia 
  aventura" o, en el entorno m&aacute;s cotidiano, la informaci&oacute;n 
  contenida en un diario.</p>



<p>Posiblemente sea el modelo del diario el que m&aacute;s f&aacute;cilmente nos 

  pueda dar pistas sobre lo que es un hipertexto. Pr&aacute;cticamente nadie lee 

  un peri&oacute;dico desde la primera a la &uacute;ltima p&aacute;gina: seleccionamos 

  la informaci&oacute;n que consideramos m&aacute;s interesante a partir de lo 

  que aparece en portada y es a ese art&iacute;culo al que acudimos en primer 

  lugar. Esta posibilidad de seleccionar el itinerario que vamos a seguir es uno 

  de los elementos que definen al hipertexto.</p>



<p>Ahora bien, aunque pueda servirnos para asimilar de forma intuitiva el concepto 

  de hipertexto, tendremos que considerar un segundo elemento para definirlo: 

  la posibilidad de incluir, junto a la informaci&oacute;n escrita y la imagen 

  fija, el sonido y la imagen en movimiento.</p>



<p>Aunque es posible seguir buscando signos identificativos del hipertexto podemos 

  dejar esta primera aproximaci&oacute;n en este punto. Por tanto, a los efectos 

  de este curso, consideraremos hipertexto al conjunto de informaci&oacute;n en 

  soporte multimedia que se estructura mediante enlaces entre los diversos elementos, 

  de forma que el usuario pueda acceder a ella de forma &aacute;gil y teniendo 

  la posibilidad de establecer su propio itinerario de "lectura".</p>



<p>&nbsp;</p>



<h2>&iquest;Qu&eacute; es el HTML?</h2>



<p>Una de las primeras preguntas que se hace uno al acercarse a la creaci&oacute;n 

  de p&aacute;ginas WEB es qu&eacute; significa eso de HTML.</p>



<p>Las siglas <acronym title="HyperText Markup Language">HTML</acronym>
son las iniciales de la expresi&oacute;n en ingl&eacute;s HyperText
Markup Language. Traducido al castellano ser&iacute;a Lenguaje de
Etiquetas de Hipertexto. </p>



<p>Se trata de un conjunto de etiquetas que se van intercalando entre el texto 

  de forma que los programas que utilizamos para navegar por la Red sepan qu&eacute; 

  es lo que tienen que mostrar cuando accedemos a una p&aacute;gina y c&oacute;mo 

  deben presentarlo en la pantalla.</p>



<p>Dada la constante evoluci&oacute;n de Internet, el lenguaje&nbsp;<acronym title="HyperText Markup Language">HTML</acronym> ha ido igualmente 

  evolucionando de forma r&aacute;pida e incorporando especificaciones a trav&eacute;s 

  de las sucesivas versiones del mismo. </p>



<p>Existe un organismo internacional independiente (<a href="http://www.w3.org" target="_blank"> World
    Wide Web Consortium </a>o<a href="http://www.w3.org" target="_blank"> W3C</a>)
  que se encarga de ir  fijando cu&aacute;les son las etiquetas v&aacute;lidas
  pero, a pesar de ello,  la batalla comercial que se ha desarrollado en torno
  a los navegadores para  Internet ha originado situaciones en las que han aparecido
  etiquetas propietarias  de un determinado programa.&nbsp;</p>
<p>Llamamos etiquetas propietarias
  a aquellas que s&oacute;lo 
  son interpretadas correctamente por un navegador, mientras que el resto de
  los  navegadores las ignora. Como consecuencia de ello hay efectos que se pueden
   ver cuando se visita una p&aacute;gina con el navegador Internet Explorer de Microsoft
    y que no aparecen con otros navegadores o viceversa.</p>



<p>Antes de ponernos a trabajar con nuestras p&aacute;ginas WEB tendremos que
  

  considerar que algunas de las cosas que nos resultan muy sencillas de hacer
  

  con un procesador de texto no lo van a ser tanto cuando estemos creando una
  

  p&aacute;gina para la Red. El motivo es que el lenguaje&nbsp;<acronym title="HyperText Markup Language">HTML</acronym> surgi&oacute; con la
  finalidad de permitir organizar de forma estructurada la informaci&oacute;n (fundamentalmente
  textual) para su consulta por la red, pero no ten&iacute;a intenci&oacute;n de preocuparse
  por el aspecto gr&aacute;fico de dicha informaci&oacute;n. Por ello echar&aacute;s de menos algunos
  de  los recursos que nos ofrece 

  un procesador de textos de alto nivel como el MS Word, el OpenOffice.org o
  el Corel WordPerfect,

  por ejemplo, aunque en el nivel de profundizaci&oacute;n podr&aacute;s comprobar c&oacute;mo las
  hojas de estilo en cascada (<acronym title="Cascading Style Sheets">CSS</acronym>) s&iacute; nos permiten definir de forma bastante
  flexible la apariencia. </p>



<p>&nbsp;</p>



<h2>Conceptos de Servidores y Clientes WEB </h2>



<p>Tras este primer acercamiento a lo que es una p&aacute;gina WEB veremos qu&eacute; 
  hay que hacer para que la informaci&oacute;n recogida en ella se convierta en 
  algo p&uacute;blico y accesible en Internet, o en una Intranet en el interior 
  de nuestro centro de trabajo.</p>



<p>Para lograr que nuestras p&aacute;ginas WEB est&eacute;n disponibles en Internet 

  son necesarios varios requisitos:</p>



<ol>

  <li> 

    
    
    <p>Que se encuentren en un ordenador permanentemente conectado a Internet. 

    </p>



  </li>

  <li> 

    
    
    <p>Que dispongamos de una direcci&oacute;n <acronym title="Internet Protocol">IP</acronym> fija y conocida por los ordenadores 

      que se encargan de traducir las peticiones de los internautas a direcciones&nbsp;<acronym title="Internet Protocol">IP</acronym>.</p>



  </li>

  <li> 

    
    
    <p>Que el ordenador en el que se alojan nuestras p&aacute;ginas disponga del 

      software adecuado para recibir conexiones exteriores y sea capaz de poner 

      a disposici&oacute;n de los visitantes aquello que solicitan.</p>



  </li>

</ol>



<p>Los requisitos que acabamos de mencionar, aunque no exclusivos, son algunos 

  de los que necesitamos para considerar que una m&aacute;quina es un <strong>Servidor 

  WEB</strong>. </p>



<p>Ya empieza a ser posible que un usuario particular disfrute de condiciones 

  que le permitan cumplir el primer requisito, pero es bastante m&aacute;s dif&iacute;cil 

  que se cumpla el tercero. Tengamos en cuenta que el software del servidor debe 

  ser capaz de prestar el servicio a quien lo solicite, pero tiene tambi&eacute;n 

  que disponer de las medidas adecuadas para evitar los accesos no autorizados 

  y proteger la informaci&oacute;n que tiene almacenada el equipo en el que est&aacute; instalado. Una buena pol&iacute;tica 

  de seguridad requiere un alto nivel de capacitaci&oacute;n t&eacute;cnica, por 

  lo que lo m&aacute;s frecuente es que recurramos a una instituci&oacute;n, p&uacute;blica 

  o privada, que nos ofrezca espacio para alojar nuestras p&aacute;ginas, lo cual 

  nos permitir&aacute; aprovechar su infraestructura t&eacute;cnica.</p>



<p>En el caso de las Intranets, donde el acceso sigue siendo p&uacute;blico pero 

  limitado al entorno de la propia instituci&oacute;n, la preparaci&oacute;n de 

  un servidor WEB resulta menos problem&aacute;tica, ya que no requiere la configuraci&oacute;n 

  de seguridad exigida por un servidor abierto a Internet.</p>



<p>El otro extremo del hilo comunicativo lo establece cada uno de los usuarios 
  que quiere consultar una p&aacute;gina WEB. Para ello utilizar&aacute; un software 
  especializado en recibir la informaci&oacute;n ofrecida por el ordenador que 
  hace las funciones de servidor. Se trata del <strong>Cliente WEB</strong> , <strong>Agente de usuario</strong> o navegador. 
  El empleo del t&eacute;rmino "navegador" obedece a dos motivos: por 
  una parte la met&aacute;fora de Internet como un mar de contenidos nos lleva 
  a aplicar el nombre de "navegador" al programa cuya misi&oacute;n 
  es transportarnos por ese mar. Por otra parte, el t&eacute;rmino es en parte 
  una generalizaci&oacute;n por extensi&oacute;n del nombre del programa m&aacute;s 
  utilizado durante la fase inicial de la expansi&oacute;n de Internet: el Navigator 
  de Netscape.</p>



<p>As&iacute; pues, ya tenemos definida la estructura de relaci&oacute;n entre 
  ordenadores necesaria para que la WEB funcione: establecer un par Cliente-Servidor.</p>



<h2>&iquest;C&oacute;mo funciona el par Cliente-Servidor? </h2>



<p>El proceso de distribuci&oacute;n de informaci&oacute;n almacenada en p&aacute;ginas WEB 

  se realiza en las siguientes etapas : </p>



<ol>

  <li>Un internauta solicita una determinada informaci&oacute;n tecleando el <acronym title="Uniform Resource Locator = Localizador Uniforme de Recurso">URL</acronym> 

    de la p&aacute;gina o haciendo clic en un enlace.</li>

  <li>El proveedor de acceso del internauta consulta a su servidor de nombres 

    de dominio (<acronym title="Domain Name System=Sistema de Nombres de Dominio">DNS</acronym>), traduce la petici&oacute;n recibida del navegador a la direcci&oacute;n&nbsp;<acronym title="Internet Protocol">IP</acronym> del servidor correspondiente y se pone en contacto con dicho ordenador.</li>

  <li>El servidor WEB recibe la petici&oacute;n y comprueba que la informaci&oacute;n 

    solicitada existe y est&aacute; disponible. Si es as&iacute; env&iacute;a 

    la p&aacute;gina solicitada al ordenador que le ha realizado la petici&oacute;n.</li>

  <li>El navegador del internauta recibe, a trav&eacute;s de su proveedor de acceso, 

    los recursos que constituyen la p&aacute;gina solicitada y los organiza para 

    presentarlos en la pantalla seg&uacute;n las instrucciones que contiene el 

    c&oacute;digo&nbsp;<acronym title="HyperText Markup Language">HTML</acronym> de la p&aacute;gina. Dichos recursos est&aacute;n formados 

    por el texto y los elementos multimedia que componen la p&aacute;gina: im&aacute;genes 

    fijas, sonidos, im&aacute;genes en movimiento, peque&ntilde;os programas.</li>

</ol>



<p class="estilo">Todos hemos visto p&aacute;ginas que tardan una barbaridad 

  en cargarse hasta que se presentan en pantalla.<br>



  <br>



  Habitualmente, el contenido textual y los c&oacute;digos de definici&oacute;n 

  de una p&aacute;gina tienen un tama&ntilde;o bastante reducido. Pero no debemos 

  olvidar que la p&aacute;gina est&aacute; compuesta tambi&eacute;n por el resto 

  de elementos multimedia. La cantidad de informaci&oacute;n necesaria para presentar 

  completamente una p&aacute;gina es lo que constituye su "peso".<br>



  <br>


  <strong>&iexcl;No lo dudes!</strong>: Si quieres garantizar la p&eacute;rdida de visitas 
  dise&ntilde;a tus p&aacute;ginas carg&aacute;ndolas con elementos multimedia 
  irrelevantes o mal trabajados que aumenten innecesariamente el peso de las mismas. 
  Si los visitantes no huyen desesperados por la lentitud de carga tienes el 99% 
  de posibilidades de que no incluyan tu&nbsp;<acronym title="Uniform Resource Locator = Localizador Uniforme de Recurso">URL</acronym> entre sus favoritos.<br>



</p>





  <br>





<p>&nbsp;</p>



<p></p>
</div>

</body>
</html>
