<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html lang="es-es">
<head>


  
  <meta content="text/html; charset=ISO-8859-1" http-equiv="content-type">

  


  
  <title>Herramientas</title>
  <meta content="Ra&uacute;l Luna" name="author">


  
  <link rel="stylesheet" type="text/css" href="../nvu2005.css">
<!-- parche de compatibilización con CSS 2 para navegadores microsoft --><!--[if lt IE 7]> <script src="../ie7/ie7-standard-p.js" type="text/javascript"></script> <![endif]-->
</head>


<body>

<div id="localizador">
<p>Introducci&oacute;n>>Herramientas</p>

</div>
<div id="flechadcha">
<a href="entorno.html" title="avanzar"><img src="../Images/flechadcha.gif" border="0"></a>
</div>
<div id="flechaizq">
<a href="general3.htm" title="retroceder"><img src="../Images/flechaizq.gif" border="0"></a>
</div>


<div id="contenido">

<h2>Herramientas</h2>


<p>Para realizar el curso vamos a necesitar varias herramientas,
todas ellas de car&aacute;cter gratuito. </p>


<ul>


  <li>Una herramienta para edici&oacute;n de texto plano en
Windows (puede usarse el bloc de notas, aunque recomendamos Notepad ++)
o cualquier editor de textos de Linux</li>


  <li>Un editor de p&aacute;ginas WEB: N|VU.</li>


  <li>Un editor de mapas de im&aacute;genes: Gimp 2.2.8.</li>


  <li>Un editor de im&aacute;genes: Gimp&nbsp;2.2.8</li>


  <li>Una herramienta de compresi&oacute;n de audio y
v&iacute;deo y su reproductor asociado: Real Producer Basic y Real
Player.</li>


  <li>Un programa para realizar transferencias v&iacute;a
ftp: Filezilla o GFTP</li>


</ul>


<p>&nbsp;</p>


<h2>Obtenci&oacute;n e instalaci&oacute;n</h2>


<p>Seg&uacute;n est&eacute; configurado tu ordenador
dispondr&aacute;s de unos u otros programas. Veamos lo que hay que
hacer para instalar algunos de ellos.</p>


<h3>N|VU</h3>


<p>Es el programa con el que realizaremos la mayor&iacute;a
de las tareas propuestas en el curso. Toda la documentaci&oacute;n
est&aacute; elaborada teniendo como referencia la
versi&oacute;n 1.0 de 28 de junio de 2005 que se incluye en la
carpeta de <a href="../programas/NVU/" target="_blank">programas</a>
en la
que encontrar&aacute;s el instalador para Windows y los tres
instaladores disponibles para Linux (un tarball para debian con kernel
2.6.10 y&nbsp;gcc/g++ 3.3.5, un tarball para Mandriva 10.1 y un
tercero para Fedora Core3)
</p>


<p>En la <a href="http://www.nvu.com" target="_blank">p&aacute;gina
oficial</a> del programa encontrar&aacute;s como siempre la
versi&oacute;n m&aacute;s actualizada.</p>


<p>Una vez completada la instalaci&oacute;n el programa
arrancar&aacute; en ingl&eacute;s. Para traducirlo al
castellano necesitas el paquete de traducci&oacute;n que
tambi&eacute;n tienes en la carpeta de&nbsp; <a href="../programas/NVU/paquete traduccion" target="_blank">programas</a>. Se trata
del&nbsp;archivo&nbsp;<em>nvu-1.0.es-ES.langpack.xpi</em>
y para instalarlo tendr&aacute;s que hacerlo desde la
versi&oacute;n original mediante&nbsp;la opci&oacute;n de
men&uacute; <span class="refmenu">tools </span><img class="imgcentr refmenu" style="width: 14px; height: 13px;" alt="opci&oacute;n" src="../imagenes/flechamenu.png"><span class="refmenu"> </span><span class="refmenu">extensions.
T</span>ras completar la instalaci&oacute;n, que se limita a
pulsar el bot&oacute;n<span class="refmenu"> install </span>y
elegir el archivo, tendr&aacute;s que reiniciar el programa para
que la traducci&oacute;n surta efecto</p>
<p>NOTA: Se incluyen <a href="../programas/NVU/instaladores español 2-09-05/" target="_blank">instaladores</a> en español para Windows y Linux publicados el 2 de Septiembre de 2005 que no han sido probados para este curso.</p>

<p class="aviso"><br>


</p>


<h3>Gimp</h3>


<p><img src=../gimp/logogimp.png alt="Pantalla de inicio de Gimp 2.2" width="403" height="304" style="margin-left: 10px; padding-left: 10px; width: 403px; height: 304px; float: right;">Nadie
discute la importancia
de un buen tratamiento gr&aacute;fico para aumentar la efectividad
de una p&aacute;gina WEB. Para conseguir que la riqueza
gr&aacute;fica no afecte a la agilidad de nuestras
p&aacute;ginas ser&aacute; necesario conocer unos rudimentos de
tratamiento de imagen y utilizar alguna herramienta que permita
mantener a raya el tama&ntilde;o de nuestras im&aacute;genes. </p>


<p>El programa elegido es potent&iacute;simo por lo que
&uacute;nicamente utilizaremos una parte m&iacute;nima de sus
posibilidades referida a los cambios de tama&ntilde;o y a la
creaci&oacute;n de mapas sensibles para las p&aacute;ginas web.</p>


<p>Si utilizas Linux tendr&aacute;s instalado Gimp puesto que
forma parte de los componentes base de todas las distribuciones de usos
com&uacute;n. En el caso de Windows tendr&aacute;s sin embargo
que obtenerlo de la red, aunque hemos puesto una copia de los
componentes necesarios para su instalaci&oacute;n en la carpeta <a href="../programas/Gimp" target="_blank">Gimp</a>
donde ver&aacute;s que aparecen dos archivos, debido a lo que se
explica en el siguiente p&aacute;rrafo.</p>


<p>Para instalar Gimp para Windows es necesario haber instalado
previamente una serie de bibliotecas denominadas GTK+. As&iacute;
pues, el primer paso ser&aacute; ejecutar el archivo gtk+-2.6.9-setup.exe. Una
vez completada esta primera fase habr&aacute; que  ejecutar el instalador 
gimp-2.2.8-i586-setup.exe sin asustarte porque los mensajes aparezcan en ingl&eacute;s: el
instalador no est&aacute; traducido, pero el programa
asumir&aacute; autom&aacute;ticamente el espa&ntilde;ol
como lenguaje.</p>


<p><img class="flotizq" style="width: 407px; height: 287px;" alt="Inicio de la instalaci&oacute;n de usuario" title="Inicio de la instalaci&oacute;n de usuario" src="../gimp/instalaciondeusuario.png">La primera vez que
arranques Gimp, tanto en Windows como en
Linux,&nbsp;aparecer&aacute; una pantalla
inform&aacute;ndote que se va a iniciar la instalaci&oacute;n
de usuario para completar la instalaci&oacute;n b&aacute;sica.</p>


<p>Lo &uacute;nico que tendr&aacute;s que hacer
ser&aacute; pulsar las veces que sea necesario en el
bot&oacute;n continuar hasta que el programa recoja todos los datos
necesarios y d&eacute; por finalizada la instalaci&oacute;n.</p>


<p>El arranque del Gimp en Windows puede resultarte algo lento
puesto que tiene que cargar todas las librer&iacute;as y fuentes,
pero una vez finalizado este primer paso su funcionamiento es el que
corresponde a una aplicaci&oacute;n de gran potencia. En Linux su
arranque es mucho m&aacute;s &aacute;gil al contar con
bibliotecas nativas.</p>


<p>Podr&aacute;s instalar Gimp en Windows 98, aunque la
recomendaci&oacute;n para obtener el mejor rendimiento es hacerlo
en un sistema Windows NT4, 2000 o XP.&nbsp;</p>


<p>Cuando se realiza una instalaci&oacute;n en un sistema con
Windows 98 puede suceder que aparezcan algunos mensajes de advertencia
indicando que no se han podido localizar alguna fuente o similares.
Dado que estos mensajes aparecen en una pantalla negra de MS-DOS la
respuesta habitual es cerrar esa ventana, pero no debes hacerlo, puesto
que si se cierra esa ventana de advertencia se finalizar&aacute; el
programa. As&iacute; pues, si te encuentras en ese caso,
lim&iacute;tate a minimizar la ventana y el
programa&nbsp;seguir&aacute; su curso normal funcionando sin
mayor dificultad. (Aunque, como se ha comentado, podr&iacute;a ser
algo m&aacute;s inestable en sistemas Windows 98)</p>
<p>

Si quieres comprobar la existencia de una versi&oacute;n
m&aacute;s actualizada de Gimp puedes consultar <a href="http://www.gimp.org" target="_blank">www.gimp.org</a>
donde encontrar&aacute;s zonas de descarga para sistemas basados en
las plataformas de la familia Unix, Windows y tambi&eacute;n para
Mac OS X.
</p>


<h3>Real Producer Basic 10 y
Real Player Basic 10<b> </b></h3>


<p>Son varias las herramientas que pugnan por hacerse un hueco en
el mercado de la compresi&oacute;n de sonidos e im&aacute;genes
de v&iacute;deo para su transmisi&oacute;n por Internet. Hasta
el momento, uno de los est&aacute;ndares "de facto" ha sido el
conjunto de herramientas RealNetworks.</p>


<p>Para conseguir ambas herramientas tendr&aacute;s que
acudir a la WEB de Real Networks que, como suele ocurrir con las
grandes empresas es muy din&aacute;mica. Eso puede provocar que las
direcciones que se ofrecen en este momento no sean v&aacute;lidas
en el futuro, aunque en ese caso habr&iacute;a que recurrir a la <a href="http://spain.real.com/index.html?lang=es-es&amp;loc=es">p&aacute;gina
principal</a> e iniciar desde all&iacute; la
b&uacute;squeda.</p>


<p>En el momento de redactar este curso las p&aacute;ginas
para iniciar las descargas eran las siguientes: <a href="http://spain.real.com/freeplayer_r1p.html">Real Player
Basic para Windows</a> (en castellano) o <a href="http://www.real.com/linux/">Real Player 10 para Linux</a>
(en ingl&eacute;s por el momento) y <a href="http://www.realnetworks.com/products/producer/basic.html">Real
Producer Basic</a> (disponible &uacute;nicamente en
ingl&eacute;s en el momento de la redacci&oacute;n de este
manual)</p>




<h3><b><a name="filezilla"></a></b>Filezilla</h3>


<p>Filezilla es un gestor de descargas ftp creado para funcionar
en plataformas con sistema operativo Windows </p>


<p>En la carpeta de <a href="../programas/filezilla" target="_blank">programas</a>
dispones de la versi&oacute;n 2.2.16 de este programa. Dado que se
trata de un programa con una frecuencia de actualizaciones puuedes
comprobar si ya
est&aacute; operativa alguna de las nuevas versiones visitando la
p&aacute;gina <a href="http://sourceforge.net/projects/filezilla" target="_blank">sourceforge.net/projects/filezilla</a>
</p>


<p>La p&aacute;gina principal de Filezilla se enmarca dentro
de Sourceforge.net que es una de las comunidades m&aacute;s activas
en el desarrollo y difusi&oacute;n de sofware libre. Cuando accedas
al sitio y pulses sobre el enlace <strong>Download</strong>
correspondiente a la &uacute;ltima versi&oacute;n
ver&aacute;s que aparece una ventana en la que est&aacute;n
se&ntilde;alados con un color especial los archivos
correspondientes a la misma. Al tratarse de programas con licencia GPL
comprobar&aacute;s que se incluyen tambi&eacute;n las fuentes
del programa (archivo src), aunque lo m&aacute;s
habitual,&nbsp;es que descargues &uacute;nicamente el
ejecutable
para Windows que lleva l, salvo que tengas conocimientos de
programaci&oacute;n y quieras ver c&oacute;mo est&aacute;
hecho el programa.</p>


<table style="width: 100%;" border="0" cellpadding="1" cellspacing="1">


  <tbody>


    <tr align="center" bgcolor="">


      <td rowspan="2"><font color=""><b>Package</b></font></td>


      <td rowspan="2"><font color=""><b>Release<br>


&amp; Notes</b></font></td>


      <td rowspan="2"><font color=""><b>Filename</b></font></td>


      <td colspan="4"><font color=""><b>Date</b></font></td>


    </tr>


    <tr align="center" bgcolor="">


      <td><font color=""><b>Size</b></font></td>


      <td><font color=""><b>D/L</b></font></td>


      <td><font color=""><b>Arch.</b></font></td>


      <td><font color=""><b>Type</b></font></td>


    </tr>


    <tr bgcolor="#ffffff">


      <td colspan="3">
      
      <p><strong>FileZilla</strong> </p>


      </td>


      <td colspan="4">&nbsp;</td>


    </tr>


    <tr bgcolor="pink">


      <td colspan="3">&nbsp;&nbsp;&nbsp;&nbsp;<b><a href="http://sourceforge.net/project/shownotes.php?release_id=355924"><img src="http://images.sourceforge.net/images/ic/manual16c.png" alt="Release Notes" border="0" height="15" width="15"> 2.2.16</a></b> </td>


      <td colspan="4" align="center"><b>2005-09-12
06:46</b></td>


    </tr>


    <tr bgcolor="pink">


      <td colspan="3"><dd><a href="http://prdownloads.sourceforge.net/filezilla/FileZilla_2_2_16_dbg.zip?download">Download
FileZilla_2_2_16_dbg.zip</a></dd>


      </td>


      <td align="right">6552631 </td>


      <td align="right"><a href="http://sourceforge.net/project/stats/detail.php?type=prdownload&amp;group_id=21558&amp;ugn=filezilla&amp;package_id=15149&amp;release_id=355924&amp;file_id=802097">9875</a></td>


      <td>i386</td>


      <td>.zip</td>


    </tr>


    <tr bgcolor="pink">


      <td colspan="3"><dd><a href="http://prdownloads.sourceforge.net/filezilla/FileZilla_2_2_16.md5?download">Download
FileZilla_2_2_16.md5</a></dd>


      </td>


      <td align="right">234 </td>


      <td align="right"><a href="http://sourceforge.net/project/stats/detail.php?type=prdownload&amp;group_id=21558&amp;ugn=filezilla&amp;package_id=15149&amp;release_id=355924&amp;file_id=802099">1627</a></td>


      <td>i386</td>


      <td>text</td>


    </tr>


    <tr bgcolor="pink">


      <td colspan="3"><dd><a href="http://prdownloads.sourceforge.net/filezilla/FileZilla_2_2_16_setup.exe?download">Download
FileZilla_2_2_16_setup.exe</a></dd>


      </td>


      <td align="right">3459745 </td>


      <td align="right"><a href="http://sourceforge.net/project/stats/detail.php?type=prdownload&amp;group_id=21558&amp;ugn=filezilla&amp;package_id=15149&amp;release_id=355924&amp;file_id=802096">74346</a></td>


      <td>i386</td>


      <td>.exe (32-bit Windows)</td>


    </tr>


    <tr bgcolor="pink">


      <td colspan="3"><dd><a href="http://prdownloads.sourceforge.net/filezilla/FileZilla_2_2_16_src.zip?download">Download
FileZilla_2_2_16_src.zip</a></dd>


      </td>


      <td align="right">2332680 </td>


      <td align="right"><a href="http://sourceforge.net/project/stats/detail.php?type=prdownload&amp;group_id=21558&amp;ugn=filezilla&amp;package_id=15149&amp;release_id=355924&amp;file_id=802098">1515</a></td>


      <td>i386</td>


      <td>Source .zip</td>


    </tr>


    <tr bgcolor="pink">


      <td colspan="3"><dd><a href="http://prdownloads.sourceforge.net/filezilla/FileZilla_2_2_16.zip?download">Download
FileZilla_2_2_16.zip</a></dd>


      </td>


      <td align="right">4456627 </td>


      <td align="right"><a href="http://sourceforge.net/project/stats/detail.php?type=prdownload&amp;group_id=21558&amp;ugn=filezilla&amp;package_id=15149&amp;release_id=355924&amp;file_id=802095">9669</a></td>


      <td>i386</td>


      <td>.zip</td>


    </tr>


  
  </tbody>
</table>


<p><img style="width: 348px; height: 314px; float: right;" alt="Panel de selecci&oacute;n de origen de Sourceforge" class="recuadroimg" src="../publicacion/imagenes/sourceforgedownload.png" hspace="5">
</p>


<p>Tanto en el caso de Filezilla como en el de cualquier otro
programa que descargues desde Sourceforge.net ver&aacute;s que, al
pulsar sobre el archivo que quieres descargar se abre una ventana en la
que te da la opci&oacute;n de elegir uno de los "mirrors"
(servidores en espejo) de los que puedes descargarlo.</p>


<p>En la captura puedes ver que aparecen dos servidores en Europa
y tres en Norteam&eacute;rica. Lo m&aacute;s habitual es que
los servidores m&aacute;s pr&oacute;ximos
geogr&aacute;ficamente sean los m&aacute;s r&aacute;pidos a
la hora de realizar la descarga, pero no siempre tiene por
qu&eacute; ser as&iacute;, puesto que puede darse la
circunstancia de que se encuentre temporalmente fuera de servicio o
saturado.</p>


<p>Para elegir uno de los servidores basta con pulsar sobre el
icono <img style="width: 20px; height: 22px;" alt="Icono de archivo binario" title="Icono de archivo binario" src="../publicacion/imagenes/binary.gif" align="middle"> y eso
nos llevar&aacute; a una p&aacute;gina en la que se nos informa
del "mirror" que hemos seleccionado.</p>


<p><img style="width: 244px; height: 76px; float: left;" alt="Informaci&oacute;n del mirror origen de la descarga" title="Informaci&oacute;n del mirror origen de la descarga" src="../publicacion/imagenes/sourceforgedownloadinfo.png" class="recuadroimg" hspace="5"> En esa p&aacute;gina de
informaci&oacute;n nos avisa de que la descarga se
iniciar&aacute; de forma autom&aacute;tica al cabo de unos
segundos, indic&aacute;ndonos que tenemos dos posibilidades en caso
de que no ocurra as&iacute;: pulsar sobre el enlace directo o bien
elegir otro "mirror" diferente, para lo cual tendr&iacute;amos que
utilizar el bot&oacute;n de vuelta atr&aacute;s del navegador.</p>


<p>Si descargamos programas de forma habitual desde
Sourceforge.net podemos marcar una de los servidores que aparecen en la
zona inferior y utilizar el bot&oacute;n <img style="width: 201px; height: 27px;" alt="Select Preferred Mirror" src="../publicacion/imagenes/sourceforgedownloadpreferred.png" align="middle"> lo
cual har&aacute; que en el futuro no tengamos que pasar por la
pantalla de selecci&oacute;na ya que, salvo que ocurriera una de
las incidencias que hemos comentado se lanzar&aacute;
autom&aacute;ticamente la descarga desde el servidor que hayamos
predeterminado con esa elecci&oacute;n.</p>


<h3>Instalaci&oacute;n</h3>


<p>Una vez completada la descarga tendr&aacute;s en tu
ordenador el archivo FileZilla_2_2_8_setup.exe, o una
versi&oacute;n m&aacute;s actualizada. Recuerda que el archivo
mencionado ya se encuentra en la carpeta de programas del CD ROM por lo
que no tendr&aacute;s que descargarlo. Sea cual sea el origen
bastar&aacute; con hacer un doble clic sobre el archivo para que se
inicie la instalaci&oacute;n.</p>


<p><img style="width: 294px; height: 153px; float: right;" alt="Selecci&oacute;n de lenguaje de la instalaci&oacute;n" title="Selecci&oacute;n de lenguaje de la instalaci&oacute;n" src="../publicacion/imagenes/idiomainstalacion.png" hspace="8">Es
probable que te lleves un primer cuando el programa lance un panel de
selecci&oacute;n de idioma y compruebes que aparece el
catal&aacute;n o el chino tradicional, pero no el castellano. No te
preocupes porque se trata del idioma que se utilizar&aacute; en el
instalador. Aunque puedes elegir otro idioma diferente del
ingl&eacute;s si piensas que te puedes sentir m&aacute;s a
gusto te comentamos los pasos esenciales y seguro que no te pierdes si
los sigues. </p>


<p>Damos pues por supuesto que has elegido el ingl&eacute;s y
lo primero que te presenta es la licencia GPL que tendr&aacute;s
que aceptar pulsando el bot&oacute;n <img style="width: 75px; height: 23px;" alt="I Agree" src="../publicacion/imagenes/iagree.png" align="middle"></p>


<p><img style="width: 147px; height: 154px; float: left;" alt="Selecci&oacute;n de documentaci&oacute;n en franc&eacute;s" src="../publicacion/imagenes/documentacionenfrances.png" class="recuadroimg" hspace="8">A partir de aqu&iacute; se
inicia la instalaci&oacute;n propiamente dicha y
comprobar&aacute;s que la opci&oacute;n que se ofrece por
defecto es <img style="width: 147px; height: 21px;" alt="Standard" src="../publicacion/imagenes/standard.png" align="middle"> que es
la que te recomendamos que utilices.</p>


<p>Aunque el funcionamiento del programa es bastante sencillo, la
instalaci&oacute;n Standard no dispone de una ayuda traducida al
castellano, por lo que si te resulta m&aacute;s c&oacute;modo
consultar una ayuda en franc&eacute;s puedes optar por marcar la
casilla para que se instale la documentaci&oacute;n en
franc&eacute;s, aunque realmente no te lo recomendamos puesto que
consideramos que no te va a resultar necesaria. Adem&aacute;s, si
decides instalar esta opci&oacute;n el programa te
pedir&aacute; que est&eacute;s conectado a Internet para
descargar unos archivos complementarios. Sea pues con la
documentaci&oacute;n en franc&eacute;s o sin ella
s&oacute;lo te queda pulsar sobre el bot&oacute;n&nbsp;<img style="width: 75px; height: 23px;" alt="Next" src="../publicacion/imagenes/next.png" align="middle"> para
continuar con el proceso.</p>


<p><img style="width: 450px; height: 228px; float: right;" alt="Selecci&oacute;n de modo de instalaci&oacute;n" title="Selecci&oacute;n de modo de instalaci&oacute;n" src="../publicacion/imagenes/modosdeinstalar.png" class="recuadroimg" hspace="8">Las dos siguientes pantallas,
como en pr&aacute;cticamente todas las instalaciones te ofrecen una
carpeta por defecto para la instalaci&oacute;n y el nombre del
grupo de programas que se crear&aacute; en el men&uacute;
Inicio. Salvo que tengas alguna preferencia especial puedes aceptarlas
con la pulsaci&oacute;n de <img style="width: 75px; height: 23px;" alt="Next" src="../publicacion/imagenes/next.png" align="middle"> para
continuar, con lo que te aparecer&aacute; una pantalla que
s&iacute; es interesante que tengas en cuenta. Las opciones que te
muestra por defecto son las que aparecen en la imagen. La primera de
ella es no utilizar el modo seguro, que ser&aacute; recomendable
cuando se trate de tu ordenador personal puesto que el programa
recordar&aacute; las contrase&ntilde;as. Sin embargo, si se
trata de un ordenador compartido deber&iacute;as modificarla y
marcar <span class="refmenu">use secure mode</span>, lo cual te
obligar&aacute; a escribir las contrase&ntilde;as cada vez que
las necesites, pero impedir&aacute; que otros usuarios se
aprovechen de la memorizaci&oacute;n de las mismas para acceder
indebidamente a tus sitios personales.</p>


<p>En cuanto a la segunda opci&oacute;n el programa
recomienda que se utilice la instalaci&oacute;n a trav&eacute;s
de un archivo XML, salvo en el caso de que se trate de un ordenador en
el que est&eacute;n definidos diferentes perfiles de usuario, caso
en el cual ser&iacute;a necesario utilizar el registro para que
cada usuario tuviera sus propias preferencias. Llegados a este punto ya
le hemos indicado al instalador las condiciones necesarias y basta con
pulsar la tecla <img style="width: 75px; height: 23px;" alt="Install" src="../publicacion/imagenes/install.png" align="middle"> que
har&aacute; que vaya apareciendo una barra de progreso y el listado
de los archivos que se van copiando en el disco duro. Una vez
finalizado el listado aparecer&aacute; el bot&oacute;n <img style="width: 75px; height: 23px;" alt="Close" src="../publicacion/imagenes/close.png" align="middle"> que
utilizaremos para dar por concluida la instalaci&oacute;n quedando
el programa listo para su uso con el icono <img style="width: 32px; height: 32px;" alt="Acceso directo a Filezilla" src="../publicacion/imagenes/icofilezilla.png" align="middle"> situado
en el escritorio.</p>


<p>Si al arrancar el programa compruebas que el entorno sigue
estando en ingl&eacute;s tendr&aacute;s que modificarlo
manualmente mediante la opci&oacute;n de men&uacute; <span class="refmenu">edit
</span><img class="refmenu" src="../imagenes/flechamenu.png" align="middle" height="13" width="14"><span class="refmenu"> settings</span><strong> </strong> que desplegar&aacute; la pantalla de
preferencias, encontrando en la rama <span class="refmenu">interface settings</span><strong> </strong>
el apartado <span class="refmenu">languages</span> en el que
podr&aacute;s seleccionar el espa&ntilde;ol. </p>


<p>Tras aceptar las opciones que nos ofrece el programa y
completar la instalaci&oacute;n dispondremos de un nuevo grupo de
programas al que accederemos a traves de <span class="refmenu">inicio </span><img class="refmenu" src="../imagenes/flechamenu.png" align="middle" height="13" width="14"><span class="refmenu"> programas</span>.</p>


<h3>&nbsp;Notepad ++</h3>
<p>Si trabajas en Linux, independientemente de la distribuci&oacute;n
que est&eacute;s usando, contar&aacute;s con muchos editores de texto
plano con prestaciones avanzadas. En el caso de Windows la
situaci&oacute;n es m&aacute;s deficitaria, contando &uacute;nicamente
con el Bloc de notas, que puede ser una herramienta v&aacute;lida pero
es muy pobre en cuanto a prestaciones. Por ese motivo se sugiere la
utilizaci&oacute;n del programa Notepad++ que es una herramienta que
ofrece unas prestaciones muy superiores. Puedes encontrarlo tambi&eacute;n en la carpeta de <a href="../programas/notepad" target="_blank">programas</a>.</p>
<p>Se trata tambi&eacute;n de un programa de c&oacute;digo abierto cuya
&uacute;ltima versi&oacute;n podr&aacute;s encontrar en&nbsp;<a href="http://notepad-plus.sourceforge.net/es/site.htm" target="_blank">notepad-plus.sourceforge.net/es/site.htm</a> desde te dirigir&aacute;n a Sourceforge cuyo funcionamiento ya conoces.</p>
<p>La utilizaci&oacute;n de Notepad++ es bastante intuitiva y no nos
extenderemos en explicaciones al respecto. Su utilidad fundamental en
este curso puede ser como aplicaci&oacute;n complementaria para la
edici&oacute;n de hojas de estilo, por lo que se usar&aacute; en el
nivel m&aacute;s avanzado.</p>


<p></p>

</div>
</body>

</html>
