<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">



<html>

<head>

<title>Informaci&oacute;n general</title>

<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">

<link href="../estilo.css" rel="stylesheet" type="text/css">

<script type="text/javascript" language="JavaScript">

<!-- 

  function cargalogo(nombre) {

   parent.arriba.location.href=nombre;

}

// -->

</script>

</head>



<body onload="cargalogo('../titulosg.htm');">

<center>

</center>

 

<p>A continuaci&oacute;n encontrar&aacute;s un conjunto de 

  p&aacute;ginas WEB en las que se ha pretendido combinar un m&iacute;nimo de 

  teor&iacute;a con el m&aacute;ximo posible de pr&aacute;ctica, de forma que 

  se genere un proceso de experimentaci&oacute;n que te permita un aprendizaje 

  aut&oacute;nomo. 

<p>Los <b>objetivos</b> que se plantean son:&nbsp; 

<ul>

  <li> Que conozcas la estructura b&aacute;sica de un documento 

    HTML.&nbsp;</li>

  <li> Que aprendas a construir una p&aacute;gina HTML utilizando 

    los recursos elementales y algunos de nivel intermedio.&nbsp;</li>

  <li> Que adquieras las bases necesarias para poder continuar 

    de forma aut&oacute;noma el aprendizaje sobre elementos avanzados de lenguaje 

    HTML.&nbsp;</li>

</ul>



  <p>Para conseguir estos objetivos contamos con un tema central de trabajo: <b>construir 

    y publicar un sitio WEB de contenido educativo</b> compuesto de varias p&aacute;ginas 

    con sus correspondientes enlaces. Los recursos para llevar a cabo esta tarea 

    los iremos trabajando paso a paso, pero deber&iacute;as tenerla presente desde 

    el momento de iniciar el curso.</p>

  
<p>Los <b>materiales</b> que encontrar&aacute;s recogen una serie de explicaciones 
  sobre los diferentes elementos que constituyen las p&aacute;ginas WEB y un conjunto 
  de ejercicios intercalados para ir practicando los conceptos explicados. </p>


<p>La navegaci&oacute;n por los contenidos del curso puede hacerse siguiendo una 
  secuencia lineal, igual que si se fueran pasando una a una las p&aacute;ginas 
  de un manual o bien de forma no secuencial para lo que se utilizar&aacute; el 
  men&uacute; que tendr&aacute;s presente de forma constante en la zona izquierda 
  de la pantalla. Puedes plantearte una divisi&oacute;n de los contenidos en dos 
  fases:
<ul>
  <li>Una fase de de iniciaci&oacute;n te permitir&aacute; tomar contacto con 
    los elementos b&aacute;sicos del lenguaje HTML para crear las primeras p&aacute;ginas. 
    Incluye los contenidos correspondientes a los apartados Introducci&oacute;n, 
    Formato, Tablas, Multimedia (Im&aacute;genes), V&iacute;nculos y Publicaci&oacute;n.</li>
  <li>Para adquirir una visi&oacute;n m&aacute;s completa se a&ntilde;adir&iacute;an 
    el resto de los m&oacute;dulos: Multimedia (Sonidos), Formularios, Marcos, 
    Accesibilidad y, especialmente, Estilos. </li>
</ul>
<p>La secci&oacute;n de recursos te brinda una selecci&oacute;n de algunas p&aacute;ginas 
  desde las cuales puedes encontrar multitud de fuentes con las que completar 
  y enriquecer tu aprendizaje.</p>
<p>En cuanto a la presentaci&oacute;n de la documentaci&oacute;n, junto a las 
  explicaciones mediante textos e im&aacute;genes encontrar&aacute;s zonas del 
  manual diferenciadas gr&aacute;ficamente: 
<div class="estilo">Crear una sitio WEB es algo m&aacute;s que amontonar 

  informaci&oacute;n m&aacute;s o menos correctamente relacionada. <br>

  <br>

  Como en todo medio de comunicaci&oacute;n se han ido desarrollando una serie 

  de normas de estilo que ser&aacute; conveniente respetar. No pretendemos ser 

  estrictos, pero ten en cuenta que la habilidad para navegar se adquiere gracias 

  a que las p&aacute;ginas por las que pasamos respetan un conjunto similar de 

  convenciones y no tenemos que ir descubriendo nuevos indicadores a cada paso.<br>

  <br>

  Las encontrar&aacute;s en este tipo de recuadros.</div>

<div class="codigo">Detr&aacute;s de cada p&aacute;gina WEB hay unos c&oacute;digos 

  que permiten que la veamos tal como se presenta en nuestra pantalla.<br>

  <br>

  Aunque trabajar&aacute;s fundamentalmente en un entorno gr&aacute;fico en el 

  que las herramientas que utilices ir&aacute;n construyendo el c&oacute;digo 

  hay algunos momentos en los que se hace imprescindible recurrir a la edici&oacute;n 

  manual del mismo.<br>

  <br>
  La presentaci&oacute;n en pantalla ser&aacute; como la de este bloque. </div>

<div class="ejercicio">El tercer tipo de cuadros ser&aacute; el correspondiente 

  a las pr&aacute;cticas.<br>

  <br>

  Siempre encontrar&aacute;s un n&uacute;mero identificativo de la actividad <img src="../imagenes/numeracion/catorce.gif" width="29" height="29" align="absmiddle"> que
  te permitir&aacute; localizar r&aacute;pidamente los ejercicios.<br>

</div>

<div class="aviso"><img src="../imagenes/atencion.gif" width="28" height="25" align="left">Este 

  tipo de se&ntilde;al te avisar&aacute; de alguna cuesti&oacute;n relevante. 

  Puede tratarse de un detalle que puede alterar la forma de llevar a cabo un 

  procedimiento o provocar un error, de alguna advertencia importante respecto 

  a c&oacute;digos o estilos o, en general, alguna nota que te puede evitar m&aacute;s 

  de un quebradero de cabeza.</div>

<p>La <b>secuencia de pr&aacute;cticas </b>se inicia trabajando con el bloc de 
  notas o cualquier editor de texto plano si est&aacute;s trabajando con Linux. 
  Si ya has tenido alg&uacute;n contacto con alguna otra herramienta de dise&ntilde;o 
  de p&aacute;ginas WEB puede parecerte que esta fase sobra. Como autor del curso 
  considero que es un recurso metodol&oacute;gico necesario para hacer patentes 
  las caracter&iacute;sticas del lenguaje HTML y por ello los tres primeros ejercicios 
  son de este tipo. A partir de la cuarta pr&aacute;ctica iniciaremos el trabajo 
  con el editor gr&aacute;fico.
<p> 
<p><span><b>SEGUIMIENTO Y DESARROLLO DEL CURSO</b></span> 
<p>El seguimiento y desarrollo del curso implica la lectura detenida de la documentación 
  del mismo, así como la realización de los ejercicios que en él se proponen</p>

<p><b>LOS EJERCICIOS</b> </p>

<p>Los ejercicios prácticos proponen, de forma guiada, 

  todas las actuaciones que el alumno ha de llevar a cabo. </p>

<p>Se aconseja a los alumnos y alumnas crear una carpeta o subdirectorio de trabajo 
  en el ordenador del usuario para ir guardando en un mismo sitio el resultado 
  de los ejercicios realizados cuando la actividad&nbsp; lo requiera.</p>

<p>&nbsp;<a name="uso"></a> <br>
  <span><b>USO Y CONSULTA DE LOS DOCUMENTOS</b></span> </p>

<p>Este material está optimizado para una configuración de pantalla de 1024 x 
  768 con 16 bits de colores, por lo que si se utilizan configuraciones distintas 
pueden producirse algunas variaciones en la presentación en pantalla de la información.</p>

<p>

<p>&nbsp;</p>

</body>

</html>

