<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html lang="es-es">
<head>



  
  
  <meta content="text/html; charset=ISO-8859-1" http-equiv="content-type">


  


  
  
  
  <title>Estructura general - Colores y fondos de p&aacute;gina</title>
  <script type="text/javascript" language="JavaScript">
<!--
 function Abrefondos (){
fondos=window.open("selectordecolores/index.html","fondos","width=780,height=700,top=0,left=0");
return true;
}
//-->
  </script>
  
  
  <link rel="stylesheet" href="../nvu2005.css" type="text/css">
<!-- compliance patch for microsoft browsers --><!--[if lt IE 7]> <script src="../ie7/ie7-standard-p.js" type="text/javascript"></script> <![endif]-->
</head>


<body>
<div id="localizador">
<p>La base>>Colores y fondos de p&aacute;gina</p>

</div>
<div id="flechadcha">
<a href="pag2.html" title="avanzar"><img src="../Images/flechadcha.gif" border="0"></a>
</div>
<div id="flechaizq">
<a href="texto6.html" title="retroceder"><img src="../Images/flechaizq.gif" border="0"></a>
</div>


<div id="contenido">


<h2>Dise&ntilde;ando
el aspecto general</h2>



<p>Hasta el momento las p&aacute;ginas que hemos creado
editando
directamente el c&oacute;digo eran de color blanco. Sin embargo, es
extra&ntilde;o encontrar p&aacute;ginas WEB que se asemejen a
una hoja de papel; lo habitual es que se incluyan colores que hagan
m&aacute;s agradable su presentaci&oacute;n. Pero, antes de
lanzarte a una desenfrenada pasi&oacute;n carnavalesca por el color
no estar&iacute;a de m&aacute;s que reflexionaras sobre la
siguiente aportaci&oacute;n de estilo.</p>



<div class="estilo"> El uso indiscriminado
de
colores e im&aacute;genes no aumenta la calidad de una
p&aacute;gina, m&aacute;s a&uacute;n, tiende a reducirla.
No estar&iacute;a de m&aacute;s respetar unas sencillas reglas:
<ul>



  <li>Los colores, de fondo o de texto, se utilizan con el
objetivo de contribuir a la legibilidad de los textos. Salvo que sirvan
para diferenciar contenidos las p&aacute;ginas que constituyen una
sede WEB deber&iacute;an tender a un dise&ntilde;o uniforme que
transmita al visitante la sensaci&oacute;n de que se encuentra en
un lugar con se&ntilde;as de identidad propias.
&nbsp; </li>



  <li> Los archivos de im&aacute;genes ocupan espacio...
mucho espacio. Transmitirlos lleva tiempo... mucho tiempo. Por tanto,
habr&aacute; que minimizar en lo posible el tama&ntilde;o de
las im&aacute;genes y utilizarlas cuando sean significativas, no
meramente como elementos decorativos. Si utilizamos im&aacute;genes
para enlazar unas p&aacute;ginas con otras hag&aacute;moslo
siempre con las mismas: contribuiremos a la "imagen de marca" y
aceleraremos la navegaci&oacute;n puesto que s&oacute;lo se
descargar&aacute;n la primera vez.</li>



</ul>



</div>



<h3> Color de fondo </h3>



<p>La forma m&aacute;s elemental de modificar el aspecto de
una p&aacute;gina es variando el color del fondo. Hay unas cuantas
explicaciones sobre la forma de representar el color en una pantalla de
ordenador, pero antes de verlas vamos a hacer una pr&aacute;ctica
sencilla para cambiar el color del fondo de nuestra p&aacute;gina.</p>



<div class="practicas">
<img class="numact" style="width: 29px; height: 29px; float: left;" alt="Actividad 16" title="Actividad 16" src="../imagenes/numeracion/dieciseis.gif">
<ul>



  <li>Localiza en la
barra de herramientas el icono que
representa el color de fondo <img class="imgcentr" alt="Barra de herramientas: Selector de color de fondo" title="Barra de herramientas: Selector de color de fondo" src="img/seleccionarcolorfondo.png" height="30" width="312">y haz clic sobre &eacute;l.</li>



  <li>Para empezar puedes optar por marcar uno de los colores que
aparecen como predefinidos y pulsar el bot&oacute;n <span style="font-weight: bold;">Aceptar</span>.</li>



</ul>



</div>



<p>Hay un procedimiento algo que nos ofrece alguna posibilidad
m&aacute;s para ayudarnos a elegir correctamente los colores para
nuestra p&aacute;gina, pero, tras haber visto el procedimiento
m&aacute;s sencillo vamos a detenernos para
entender&nbsp;c&oacute;mo se definen los colores en una
p&aacute;gina
WEB.&nbsp;</p>



<p>Para que el navegador sepa cu&aacute;les son los colores
que
tiene que presentar se utiliza la denominada combinaci&oacute;n <acronym title="Rojo Verde Azul" style="">RVA</acronym>
(Rojo-Verde-Azul) que en muchos sitios ver&aacute;s en sus siglas
en ingl&eacute;s (<acronym title="Red Green Blue">RGB</acronym>
por Red-Green-Blue).</p>



<p>Este tipo de definici&oacute;n del color se basa en la
combinaci&oacute;n de 256 posibles cantidades de cada uno de los
colores. Es como si tuvi&eacute;ramos un cuentagotas con capacidad
para ir depositando sobre cada punto de la pantalla desde 0 a 255 gotas
de cada uno de los colores b&aacute;sicos. Con esta forma de
trabajar tendr&iacute;amos desde el negro absoluto que
corresponder&iacute;a a la ausencia total de color, hasta el blanco
absoluto que ser&iacute;a la mezcla de las 255 gotas de cada uno de
los colores. Entre ambos extremos quedan las posibles combinaciones de
"gotas" de colores: 256 x 256 x 256 que hacen un total de 16<sub><font size="-2">1</font></sub>777.216 colores
diferentes.</p>



<p>Para representar esta gama de combinaciones se utilizan tres
pares de n&uacute;meros que indican respectivamente la cantidad de
rojo, verde y azul que componen cada color. Por cierto, seguro que te
est&aacute;s preguntando c&oacute;mo se hace para expresar una
cantidad mayor de 99 "gotas" con un solo par de n&uacute;meros. El
misterio est&aacute; en que no se utiliza la base 10, sino la
notaci&oacute;n hexadecimal o base 16, donde la A equivale al 10
decimal, la B al 11 y as&iacute; sucesivamente hasta la F que
equivale al 15. Adem&aacute;s, para pasar de un orden de unidades
al siguiente hay que juntar 16 unidades de cada orden en vez de 10 que
es a lo que estamos habituados. Por ejemplo, la notaci&oacute;n 12
en hexadecimal equivaldr&iacute;a a nuestro 18 ya que es una
"decena hexadecimal", o sea 16 unidades, y dos unidades sueltas. Veamos
algunos ejemplos:</p>



<center>
<table width="90%">



  <tbody>



    <tr>



      <th>
      
      
      <p>Valores</p>



      </th>



      <th width="10">&nbsp; </th>



      <th>
      
      
      <p>Color resultante</p>



      </th>



      <th width="10">&nbsp;</th>



      <th>
      
      
      <p>Valores</p>



      </th>



      <th width="10">&nbsp;</th>



      <th>
      
      
      <p>Color resultante</p>



      </th>



      <th width="10">&nbsp;</th>



      <th>
      
      
      <p>Valores</p>



      </th>



      <th width="10">&nbsp;</th>



      <th>
      
      
      <p>Color resultante</p>



      </th>



    </tr>



    <tr>



      <td>
      
      
      <p>FF0000</p>



      </td>



      <td width="10">&nbsp; </td>



      <td bgcolor="#ff0000"> </td>



      <td width="10">&nbsp;</td>



      <td>
      
      
      <p>00FF00</p>



      </td>



      <td width="10">&nbsp; </td>



      <td bgcolor="#008000"> </td>



      <td width="10">&nbsp;</td>



      <td>
      
      
      <p>0000FF</p>



      </td>



      <td width="10">&nbsp; </td>



      <td bgcolor="#0000ff"> </td>



    </tr>



    <tr>



      <td height="20">
      
      
      <p>FFFF00</p>



      </td>



      <td height="20" width="10">&nbsp;</td>



      <td bgcolor="#ffff00" height="20"> </td>



      <td height="20" width="10">&nbsp;</td>



      <td height="20">
      
      
      <p>FF00FF</p>



      </td>



      <td height="20" width="10">&nbsp;</td>



      <td bgcolor="#ff00ff" height="20"> </td>



      <td height="20" width="10">&nbsp;</td>



      <td height="20">
      
      
      <p>00FFFF</p>



      </td>



      <td height="20" width="10">&nbsp;</td>



      <td bgcolor="#00ffff" height="20"> </td>



    </tr>



    <tr>



      <td>
      
      
      <p>25A7BB</p>



      </td>



      <td width="10">&nbsp;</td>



      <td bgcolor="#25a7bb"> </td>



      <td width="10">&nbsp;</td>



      <td>
      
      
      <p>ACB312</p>



      </td>



      <td width="10">&nbsp;</td>



      <td bgcolor="#acb312"> </td>



      <td width="10">&nbsp;</td>



      <td>
      
      
      <p>6047B6</p>



      </td>



      <td width="10">&nbsp;</td>



      <td bgcolor="#6047b6"> </td>



    </tr>



  
  
  </tbody>
</table>



</center>



<p>El otro procedimiento para modificar
el color de fondo de la p&aacute;gina lo encontramos a
trav&eacute;s del men&uacute; <span class="refmenu">formato&nbsp;</span><span class="refmenu"><img class="imgcentr" style="font-weight: bold; width: 14px; height: 13px;" alt="submen&uacute;" title="submen&uacute;" src="../estilos/flechamenu.png"></span> <span class="refmenu">colores
y fondo de la p&aacute;gina</span>.</p>



<p><img class="flotder" style="width: 419px; height: 395px;" alt="Panel de selecci&oacute;n de colores de la p&aacute;gina" title="Panel de selecci&oacute;n de colores de la p&aacute;gina" src="img/colores.png"> En el panel que aparece se muestra la
combinaci&oacute;n b&aacute;sica que se aplica por defecto a
las nuevas p&aacute;ginas: fondo blanco, texto en negro y color
para los enlaces en diferentes situaciones (enlace simple, activo o
visitado) pero sin darnos la posibilidad de modificar ninguno de ellos.</p>



<p>Si optamos por marcar el bot&oacute;n de
verificaci&oacute;n para <span class="refmenu">usar
colores personalizados</span> se activan los botones que
acompa&ntilde;an a cada uno de los elementos.</p>



<p><img style="width: 372px; height: 163px;" alt="Usar colores personalizados" title="Usar colores personalizados" src="img/colores2.png"></p>



<p>Comprobamos que en la zona derecha del panel se
presenta&nbsp;un recuadro
que sirve de testigo visual para mostrarnos el efecto visual que
produce la combinaci&oacute;n de colores que se est&aacute;
aplicando.</p>



<p>Cuando pulsamos sobre algunos de los botones se lanza la
paleta de selecci&oacute;n de color para ese elemento a la que la
dedicamos ahora algo m&aacute;s de atenci&oacute;n.</p>



<p><img class="flotizq" style="width: 479px; height: 417px;" alt="Panel para seleccionar los colores" title="Panel para seleccionar los colores" src="img/colores3.png">Adem&aacute;s de los colores
predefinidos que hemos utilizado previamente podemos elegir cualquiera
de los 16,8 millones de colores arrastrando la cruceta que se muestra
en el cuadro principal para modificar el tono y la
saturaci&oacute;n. El brillo del color se modifica arrastrando
cursor hacia la izquierda o derecha de la barra que aparece bajo el
cuadro de tono y saturaci&oacute;n.</p>



<p>A medida que modificamos la posici&oacute;n de estos dos
indicadores veremos como se van produciendo variaciones en los
indicadores num&eacute;ricos de la zona inferior, tanto en la
combinaci&oacute;n de RVA como en la traducci&oacute;n de esa
combinaci&oacute;n a valores hexadecimales.</p>



<p>El lenguaje <acronym title="Hypertext Markup Language">HTML</acronym>
tambi&eacute;n utiliza nombres, en ingl&eacute;s, para
identificar algunos colores. Cuando el valor seleccionado coincide con
alguno de los colores que tienen un nombre asignado dicho nombre
aparece en la caja correspondiente, permaneciendo esta vac&iacute;a
si la combinaci&oacute;n no se corresponde con ning&uacute;n
color con nombre. En el ejemplo que se muestra en la imagen aparece el
nombre yellow (amarillo) que identifica a la combinaci&oacute;n
hexadecimal ffff00.</p>



<p>Una vez localizado el color que deseamos basta con pulsar el
bot&oacute;n Aceptar para que se aplique ese valor al elemento
desde el que hab&iacute;amos lanzado el panel de
selecci&oacute;n de colores y volvamos al panel anterior para poder
dar por finalizado el proceso o elegir el color de otro
elemento.&nbsp;</p>



<p>Es importante en este momento comprobar que las combinaciones
entre los colores del fondo y de los diferentes tipos de texto y
enlaces es armoniosa y facilita la legibilidad. </p>



<img class="flotizq" alt="Selecci&oacute;n de color de texto en la barra de herramientas" title="Selecci&oacute;n de color de texto en la barra de herramientas" src="img/colores4.png" height="52" width="52">Ya
conoc&iacute;as la
forma r&aacute;pida de acceder a la modificaci&oacute;n del
color de fondo de la p&aacute;gina desde la barra de herramientas.
Tambi&eacute;n podemos desde ella modificar el color del texto que
tengamos seleccionado, o del que se escriba a partir de ese momento.
Como ya es habitual en la mayor&iacute;a de los programas el
recuadro que figura m&aacute;s "abajo" (en nuestro ejemplo el
blanco) representa el color de fondo, mientras que el que se encuentra
m&aacute;s "arriba" indica el color del primer plano. Pulsando pues
sobre el cuadro de "primer plano" se abrir&iacute;a el panel de
selecci&oacute;n de color que acabamos de comentar.&nbsp;
<div class="practicas"><img class="numact" style="width: 29px; height: 29px; float: left;" alt="Actividad 17" title="Actividad 17" src="../imagenes/numeracion/diecisiete.gif">
<ul>



  <li>Aprovecharemos la
p&aacute;gina que tenemos abierta y,
modificamos su color de fondo&nbsp;aplicando el procedimiento
descrito de selecci&oacute;n de colores desde el men&uacute;.</li>



  <li>Variamos tambi&eacute;n el color del texto normal y
aceptamos las modificaciones.</li>



  <li>Escribimos una frase.</li>



  <li>Recurrimos a la pesta&ntilde;a <img class="imgcentr" style="width: 99px; height: 21px;" alt="Codigo fuente" title="Codigo fuente" src="../imagenes/pestanacodigofuente.png"> para comprobar c&oacute;mo se han
recogido las modificaciones en el c&oacute;digo de la
p&aacute;gina.</li>



  <li>Si pulsamos sobre el bot&oacute;n <img style="width: 54px; height: 43px;" alt="Navegar" title="Navegar" src="../imagenes/botonnavegar.png"> para
mostrar los resultados en el navegador comprobaremos que, como
a&uacute;n no hemos salvado la p&aacute;gina, el programa nos
pide que le demos un t&iacute;tulo para la p&aacute;gina
as&iacute; como un nombre y una ubicaci&oacute;n al archivo.
Utiliza el t&iacute;tulo que te parezca m&aacute;s adecuado y
nombra el archivo como <strong>actividad17.html</strong></li>



  <li>Modifica los colores&nbsp;hasta encontrar una
combinaci&oacute;n que no
dificulte la legibilidad.</li>



  <li>Guardamos definitivamente el trabajo con el nombre que le
hab&iacute;as adjudicado:&nbsp;<strong>actividad17.html</strong></li>



</ul>



</div>



&nbsp;
<div class="codigo">
<p><img src="../imagenes/atencion.gif" height="25" hspace="5" width="28">El color del
fondo de p&aacute;gina es un atributo de la etiqueta <code>&lt;body&gt; </code><br>



Si vemos el c&oacute;digo de una p&aacute;gina que tenga el
fondo de color verde puro ser&iacute;a as&iacute;:<br>



<code><span>&lt;body
bgcolor="#00ff00"&gt;</span></code> (El
s&iacute;mbolo
# es el equivalente anglosaj&oacute;n de nuestra abreviatura
n&ordm;)</p>



<p>El c&oacute;digo que crea N|VU recoge de forma
diferente las combinaciones de color dependiendo de que se haya
activado o no la utilizaci&oacute;n de estilos en el
men&uacute;&nbsp;<span class="refmenu">herramientas<span class="refmenu"> </span><img class="imgcentr" style="font-weight: bold; width: 14px; height: 13px;" alt="submen&uacute;" title="submen&uacute;" src="../imagenes/flechamenu.png"> preferencias</span><br>



<br>



Si se trabaja sin estilos el c&oacute;digo que se genera
ser&aacute; del siguiente tipo:<br>



<code><span>&lt;body
text="#000000"
bgcolor="#6666cc" link="#000099" vlink="#990099"
alink="#000099"&gt; </span></code><br>



<br>



Sin embargo, si se activa la utilizaci&oacute;n de estilos,
quedar&iacute;a:<br>



<code>&lt;body
style="color:
rgb(0,0,0); background-color: rgb(102,102,204);" link="#000099"
vlink="#ff0099" alink="#000099"&gt;</code><br>



<br>



Lo importante es que, cuando se activan los estilos, el color del texto
y el del fondo se reflejan con notaci&oacute;n decimal en lugar de
hexadecimal
</p>



</div>



<div class="practicas">
<img class="numact" style="width: 29px; height: 29px; float: left;" alt="Actividad 18" title="Actividad 18" src="../imagenes/numeracion/dieciocho.gif">
<ul>



  <li>Si
hab&iacute;as cerrado el ejercicio anterior vuelve a abrirlo</li>



  <li>Utiliza la opci&oacute;n de men&uacute; <span class="refmenu">ver <span style="font-weight: normal;" class="refmenu"><img class="imgcentr" style="width: 14px; height: 13px;" alt="submen&uacute;" title="submen&uacute;" src="../estilos/flechamenu.png"> </span>c&oacute;digo
fuente html</span><b><strong> </strong></b>o,
m&aacute;s c&oacute;modamente, la pesta&ntilde;a&nbsp;<img class="imgcentr" style="width: 99px; height: 21px;" alt="Codigo fuente" title="Codigo fuente" src="../imagenes/pestanacodigofuente.png">
para
localizar el c&oacute;digo del color de fondo.</li>



  <li>Modifica el color de fondo para que tenga el valor FFCC66 y
guarda el archivo como&nbsp;<strong>actividad18.html</strong></li>



  <li>Vamos a hacer ahora un ejercicio de estimaci&oacute;n,
para lo que tendr&aacute;s que responderte mentalmente a la
pregunta &iquest;Qu&eacute; combinaci&oacute;n de las
siguientes estar&aacute; m&aacute;s cerca de los tonos
salm&oacute;n: FEBBAA, 55AAAA, 32BC7A?. (Utiliza los valores
254,187,170 / 85,170,170 / 50,188,122 si tienes activados los estilos).
  </li>



  <li>Intenta justificar mentalmente tu respuesta y
luego comprueba la validez de tu estimaci&oacute;n introduciendo el
dato manualmente. Puedes comprobar tambi&eacute;n los otros dos
datos.</li>
</ul>



</div>



Puedes hacer pruebas en este <a href="javascript:void(0)" onclick="Abrefondos ()" title="Visualizador de combinaciones de color proveniente de pagetutor.com">visualizador</a>
para comprobar los resultados de algunas combinaciones de color.
<div class="estilo">
<p>Ahora que ya sabes
c&oacute;mo hacer que tu p&aacute;gina muestre diferentes
colores de fondo es el momento de que pongas en juego tu sentido
est&eacute;tico.</p>



<p>&iquest;Te parece agradable que cada una de las
p&aacute;ginas
de un sitio WEB tenga un color diferente o, por el contrario, te
provoca cierto sobresalto?</p>



<p>&iquest;Podr&iacute;a ser &uacute;til un cambio de
color
para identificar secciones dentro de un sitio WEB? &iquest;De
hacerlo, utilizar&iacute;as un cambio brusco o lo har&iacute;as
dentro de una gama tonal para todo el sitio?
</p>



</div>



<p class="avisos"> <img src="../imagenes/atencion.gif" align="left" height="25" width="28">Seguro que
con esas dos preguntas puedes empezar tus reflexiones, pero te apunto
otra cuesti&oacute;n que deber&iacute;as tener en cuenta: hay
combinaciones est&eacute;ticas y muy legibles que pueden ser
inadecuadas si pretendemos que la informaci&oacute;n de la
p&aacute;gina se destine a imprimir. &iquest;Que
ocurrir&iacute;a si alguien pretende imprimir una p&aacute;gina
que tiene el texto en blanco sobre un fondo de tono azul oscuro? </p>

<br>

<div class="estilo">
<p>Cada vez es m&aacute;s habitual que se utilicen recursos
para que los enlaces no aparezcan subrayados. Sin embargo, la
opci&oacute;n que utilizan los navegadores como alternativa
predeterminada es mostrar el <span style="color: rgb(51, 51, 255); text-decoration: underline; font-weight: bold;">enlace</span>
en color azul y subrayado, lo cual ha creado un aprendizaje
condicionado en el que hemos asociado esas caracter&iacute;sticas
visuales a la funci&oacute;n de enlace. </p>





<p> Por cierto, a pesar de que ya has visto que los enlaces entre
las p&aacute;ginas de este curso no aparecen subrayados
&iquest;no has intentado pinchar en la palabra enlace para ver a
d&oacute;nde te llevaba? Est&aacute; claro que no
deber&iacute;amos, bajo ning&uacute;n concepto, utilizar el
color azul y el subrayado para resaltar alg&uacute;n
t&eacute;rmino, ya que inducimos a error al visitante al alterar el
esquema perceptivo propio de la WEB.</p>





</div>

</div>
</body>
</html>
