<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html lang="es-es">
<head>



  
  
  <meta content="text/html; charset=ISO-8859-1" http-equiv="content-type">


  


  
  
  
  <title>Estructura general - Im&aacute;genes de fondo</title>
  <link rel="stylesheet" href="../nvu2005.css" type="text/css">
<!-- compliance patch for microsoft browsers --><!--[if lt IE 7]>
<script src="../ie7/ie7-standard-p.js" type="text/javascript"></script>
<![endif]-->
</head>


<body>

<div id="localizador">
<p>La base>>Im&aacute;genes de fondo</p>

</div>
<div id="flechadcha">
<a href="pag3.html" title="avanzar"><img src="../Images/flechadcha.gif" border="0"></a>
</div>
<div id="flechaizq">
<a href="pag1.html" title="retroceder"><img src="../Images/flechaizq.gif" border="0"></a>
</div>

<div id="contenido">
<h2>Imagen de fondo</h2>



<p>Adem&aacute;s de los colores seguro que has visto alguna
p&aacute;gina que tiene una textura como fondo. Aunque
&uacute;ltimamente est&aacute; empezando a caer en desuso puede
ser un recurso interesante para la construcci&oacute;n
est&eacute;tica de nuestro sitio WEB.</p>



<p>Lo que hacemos cuando elegimos una imagen para colocarla como
fondo de nuestra p&aacute;gina es considerar la pantalla como el
suelo de una habitaci&oacute;n que iremos rellenando desde la
esquina superior izquierda con baldosas. Las baldosas ser&aacute;n
tan grandes o peque&ntilde;as como la imagen que hayamos elegido. </p>



<p><img class="flotizq" style="width: 419px; height: 395px;" alt="Panel de &quot;Fondo y colores de la p&aacute;gina&quot; con imagen de fondo" title="Panel de &quot;Fondo y colores de la p&aacute;gina&quot; con imagen de fondo" src="img/imagenfondo.png">Para elegir la imagen que deseamos
utilizar como fondo de la p&aacute;gina accederemos al panel que ya
conocemos mediante la opci&oacute;n de men&uacute;&nbsp;<span class="refmenu">formato&nbsp;</span><span class="refmenu"><img class="imgcentr" style="font-weight: bold; width: 14px; height: 13px;" alt="submen&uacute;" title="submen&uacute;" src="../estilos/flechamenu.png"></span><span class="refmenu"> colores
y fondo de la p&aacute;gina</span>.</p>



<p>Si la imagen se encuentra fuera de la carpeta en la que
estamos trabajando podemos tener un problema cuando se publique la
p&aacute;gina, por lo que se recomienda que, antes de insertar
una imagen, sea como fondo o como componente de la p&aacute;gina,
se copie a la carpeta de trabajo o a una subcarpeta que cuelgue de ella.</p>



<p>Si la imagen que deseamos poner de fondo se encuentra en
la carpeta o en una subcarpeta de la misma, ser&aacute; muy
conveniente marcar <img style="width: 240px; height: 25px;" alt="Casilla: URL relativa a la ruta de la p&aacute;gina" title="Casilla: URL relativa a la ruta de la p&aacute;gina" src="img/urlrelativa.png"> para
que la referencia no sea la <a href="#absoluta">ruta
absoluta</a> hasta ella, sino su <a href="#relativa">ruta
relativa</a></p>



<p>Si la p&aacute;gina a la que le estamos aplicando el fondo
no ha
sido guardada todav&iacute;a ver&aacute;s que no se activa la
casilla
para indicar que la URL es relativa a la p&aacute;gina, ya que al
no
conocer a&uacute;n cu&aacute;l ser&aacute; la
ubicaci&oacute;n de la
misma es imposible establecer rutas relativas hacia ella.<br clear="all">



</p>



<div class="codigo">
<dl>



  <dt><a name="absoluta"></a>Ruta
absoluta:</dt>



  <dd>Llamamos de esta forma a la ruta que recoge la
ubicaci&oacute;n de
un determinado archivo sin tener en cuenta el punto desde el que se
solicita la referencia. <br>



Por ejemplo: <span style="font-style: italic;">http://platea.pntic.mec.es/~rluna/index.html</span><br>



Tambi&eacute;n ser&iacute;a una ruta absoluta una referencia a
un archivo dentro de nuestro disco duro del tipo <br>



    <span style="font-style: italic;">file:///F:/WEBs/HTML/imagenes/lateralespiral.gif</span></dd>



  <dt></dt>



  <dt><a name="relativa"></a>Ruta
relativa:&nbsp;</dt>



  <dd>En este caso tenemos en cuenta el punto desde el que damos
la
referencia del tipo <span style="font-style: italic;">imagenes/lateralespiral.gif</span>
donde hemos eliminado la referencia inicial e indicamos que, desde el
punto donde estamos, encontraremos una subcarpeta en la que
estar&aacute; la imagen lateralespiral.gif </dd>



</dl>



<dl>



</dl>



Cuando creamos un sitio WEB es importante que todas las rutas sean
relativas para que al hacer una r&eacute;plica de nuestro sitio en
el servidor todas las referencias sigan siendo v&aacute;lidas igual
que en nuestro disco duro. Por cierto, supongo que ya te
habr&aacute;s dado cuenta que todos los archivos que formen parte
del sitio WEB deben estar en la carpeta principal o en subcarpetas de
la misma. (Por utilizar la met&aacute;fora de la casa: no podemos
guardar trastos en el cuarto del ascensor porque, a lo mejor, en el
nuevo edificio que ser&iacute;a el servidor WEB no hay ascensor o
est&aacute; en otro sitio. Todo debe estar en habitaciones situadas
de la puerta de casa hacia adentro)<br>



<br>



Ni que decir tiene que si tenemos que enviar a alguien a la "casa de un
amigo" tendremos que darle la direcci&oacute;n completa para que no
se pierda, esto es, la ruta absoluta.
</div>



<p>Para hacer la siguiente pr&aacute;ctica puedes utilizar
alguna de las im&aacute;genes que encontrar&aacute;s en la
carpeta <b>imagenes (sin tilde para garantizar la
compatibilidad).</b> Tambi&eacute;n puedes recurrir a
cualquiera de la multitud de p&aacute;ginas en la red que ofrecen
la posibilidad de obtener este tipo de im&aacute;genes. Tendremos
que "bajarlas" a nuestro ordenador, para lo que pulsaremos con el
bot&oacute;n derecho del rat&oacute;n sobre la imagen que
queramos conseguir, y copiarlas en el directorio de trabajo para poder
incluirlas en nuestra p&aacute;gina. (Aunque se podr&iacute;an
guardar en cualquier directorio resulta m&aacute;s
c&oacute;modo hacerlo en el directorio en el que estamos trabajando
nuestras p&aacute;ginas, para no tener que irlas buscando por todo
el disco duro y, adem&aacute;s, permitir la creaci&oacute;n de
rutas relativas que funcionen posteriormente). Puedes probar a bajar
alguna imagen para el pr&oacute;ximo ejercicio desde <a href="http://www.areas.net/colorvivo.htm" target="_blank">ColorVivo</a>
</p>



<div class="practicas"><img class="numact" style="width: 29px; height: 29px; float: left;" alt="Actividad 19" title="Actividad 19" src="../imagenes/numeracion/diecinueve.gif">
<ul>



  <li>Arranca N|VU para crear una&nbsp;nueva
p&aacute;gina.</li>



  <li>Copia en tu carpeta del curso, o en una subcarpeta de
&eacute;sta, una imagen para aplicarla como imagen de fondo a tu
p&aacute;gina. (Puedes utilizar alguna de las que tienes en la
carpeta <a href="../imagenes/" target="_blank">imagenes</a>
del CD-ROM o cualquier
otra que tuvieras previamente o hayas obtenido de Internet).</li>



  <li>Abre el panel de <span class="refmenu">colores
y fondo de la p&aacute;gina</span> y elige una imagen para
aplicarla como&nbsp;fondo a tu p&aacute;gina. (Puedes utilizar
alguna de las que tienes en la carpeta im&aacute;genes o cualquier
otra que tuvieras previamente o hayas obtenido de Internet).</li>



  <li>Antes de aceptar comprueba que est&aacute;
desmarcada&nbsp;<img class="imgcentr" style="width: 240px; height: 25px;" alt="Casilla: URL relativa a la ruta de la p&aacute;gina" title="Casilla: URL relativa a la ruta de la p&aacute;gina" src="img/urlrelativa2.png"> y observa
que la referencia a la imagen es una
ruta absoluta. D&eacute;jalo as&iacute; por el momento </li>



  <li>Utiliza la pesta&ntilde;a <b> <img class="imgcentr" style="width: 99px; height: 21px;" alt="C&oacute;digo fuente" title="C&oacute;digo fuente" src="../imagenes/pestanacodigofuente.png">
    </b>para localizar la etiqueta&nbsp;<code><span class="">&lt;body&gt;</span></code>
y comprobar que el atributo de imagen de fondo de la
p&aacute;gina&nbsp; tiene por ahora la referencia a la imagen
en forma
de ruta absoluta. </li>



  <li>Guarda la p&aacute;gina en tu carpeta de trabajo con el
nombre <strong>actividad19.html</strong></li>



  <li>Vuelve a la pesta&ntilde;a&nbsp;<img class="imgcentr" style="width: 65px; height: 20px;" alt="Normal" title="Normal" src="../imagenes/pestananormal.png"> y
recurre nuevamente a <span class="refmenu">colores
y fondo de la p&aacute;gina </span><b><strong></strong></b>para
marcar la
casilla&nbsp;<img class="imgcentr" style="width: 240px; height: 25px;" alt="Casilla: URL relativa a la ruta de la p&aacute;gina" title="Casilla: URL relativa a la ruta de la p&aacute;gina" src="img/urlrelativa.png"> para
indicar que <b><strong>la URL de la imagen est&aacute;
relacionada con la direcci&oacute;n de la p&aacute;gina.</strong></b></li>



  <li>Comprueba en la vista&nbsp;<b> <img class="imgcentr" style="width: 99px; height: 21px;" alt="C&oacute;digo fuente" title="C&oacute;digo fuente" src="../imagenes/pestanacodigofuente.png">
    </b>que ha desaparecido la ruta absoluta.<br>



    
    
    <div class="avisos"><img style="width: 28px; height: 25px; float: left;" alt="Atenci&oacute;n" src="../imagenes/atencion.gif">Si la
imagen se encuentra en una unidad diferente a la que alberga la
p&aacute;gina no tendr&aacute;s posibilidad de indicar que se
trata de una ruta relativa</div>



  </li>



  <li>Si ten&iacute;as activada la utilizaci&oacute;n de
estilos ve a <span class="refmenu">edici&oacute;n</span><b class="refmenu">&nbsp;</b><span class="refmenu"><img class="imgcentr" style="font-weight: bold; width: 14px; height: 13px;" alt="submen&uacute;" title="submen&uacute;" src="../estilos/flechamenu.png"></span><b class="refmenu"> </b><span class="refmenu">preferencias</span><strong>
    </strong>y desact&iacute;vala (o
viceversa). Si eliminas
la imagen de fondo y vuelves luego a incluirla podr&aacute;s
comprobar que la forma de materializar el c&oacute;digo es
diferente, aunque el efecto es el mismo. </li>



</ul>



</div>



<div class="practicas">
<img class="numact" style="width: 29px; height: 29px; float: left;" alt="Actividad 20" title="Actividad 20" src="../imagenes/numeracion/veinte.gif">
<ul>



  <li>En esta
pr&aacute;ctica ver&aacute;s la importancia
del tama&ntilde;o cuando pretendemos utilizar un fondo lateral.</li>



  <li>En la carpeta de "imagenes" del CD-ROM tienes tres fondos
back640.gif, back800.gif y back1200.gif que simulan la espiral de un
cuaderno y un margen. La &uacute;nica diferencia entre las tres es
su
longitud.</li>



  <li>Crea una p&aacute;gina y apl&iacute;cale como fondo
la imagen
back1200.gif. Guarda la p&aacute;gina como&nbsp;<strong>actividad20a.html</strong><strong>. </strong>Suponiendo que tu pantalla est&eacute; configurada
para
mostrar una resoluci&oacute;n de800x600 o 1024x768
p&iacute;xeles que
son las dos m&aacute;s habituales, o incluso si tienes hasta 1200
p&iacute;xeles de ancho, no habr&aacute; ning&uacute;n
problema en la
visualizaci&oacute;n.</li>



  <li>Cambia el fondo y utiliza la imagen back800.gif. Guarda la p&aacute;gina como&nbsp;<strong>actividad20b.html</strong><strong>. </strong>Si tu
pantalla
est&aacute; a 800x600 seguir&aacute; vi&eacute;ndose
correctamente,
pero si tienes una resoluci&oacute;n mayor comprobar&aacute;s
que
aparece un efecto de repetici&oacute;n muy desagradable</li>



  <li>Prueba con &uacute;ltimo con la imagen back640.gif.
Guarda la p&aacute;gina como&nbsp;<strong>actividad20c.html</strong><strong>. </strong>Salvo que tu
monitor sea muy peque&ntilde;o y utilice a&uacute;n una
resoluci&oacute;n de 640x480 comprobar&aacute;s que nuestra
"baldosa"
se repite horizontalmente.</li>



</ul>



Ten en cuenta que ya empieza a haber monitores que utilizan
resoluciones bastante altas, por lo que cuando quieras usar una imagen
lateral ser&aacute; conveniente que la modifiques para hacerla
m&aacute;s larga y evitar las repeticiones horizontales.</div>



&nbsp;
</div>
</body>
</html>
