<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html lang="es-es">
<head>


  


  
  
  
  <title>Vinculos externos</title>
  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">



  
  
  <link rel="stylesheet" type="text/css" href="../nvu2005.css">
<!-- compliance patch for microsoft browsers --><!--[if lt IE 7]>
<script src="../ie7/ie7-standard-p.js" type="text/javascript"></script>
<![endif]-->
</head>


<body>

<div id="localizador">
<p>V&iacute;nculos&gt;&gt;Externos</p>

</div>
<div id="flechadcha">
<a href="vinculos2.htm" title="avanzar"><img src="../Images/flechadcha.gif" border="0"></a>
</div>
<div id="flechaizq">
<a href="../multimedia/sonido/TutorialHelix/compresionconhelixb.htm" title="retroceder"><img src="../Images/flechaizq.gif" border="0"></a>
</div>


<div id="contenido">

<h2>&iquest;Qu&eacute; es un v&iacute;nculo o enlace?</h2>

<p>Las siglas <acronym title="Hyper Text Mark-up Language">HTML</acronym>
corresponden a Hyper Text Mark-up Language,
esto es, Lenguaje de etiquetas de hipertexto. Hasta ahora hemos ido
describiendo y practicando sobre los aspectos referentes a la <span style="font-style: italic;">"M"</span>, las
marcas o etiquetas que nos permiten definir el aspecto de una
p&aacute;gina WEB, pero lo verdaderamente importante es el aspecto
hipertextual.&nbsp; </p>



<p>Podr&iacute;amos decir que un hipertexto es aquel
documento que presenta una estructura arborescente, con relaciones
m&uacute;ltiples entre sus contenidos, que posibilitan la consulta
no lineal de la informaci&oacute;n. (Cabr&iacute;a la
posibilidad de a&ntilde;adir matices a esta definici&oacute;n,
pero incorprorar el concepto en estos t&eacute;rminos es suficiente
para el prop&oacute;sito de este curso).&nbsp; </p>



<p>As&iacute; pues, desde una p&aacute;gina escrita
en&nbsp;<acronym title="Hyper Text Mark-up Language">HTML</acronym>
podremos saltar a otro punto de la misma p&aacute;gina, a otra
p&aacute;gina perteneciente a la misma sede WEB o a cualquier otra
p&aacute;gina que est&eacute; publicada en Internet o acceder a
servicios tales como la transferencia de ficheros o el correo
electr&oacute;nico. Para que esto ocurra deberemos haber definido
en nuestra p&aacute;gina las palabras o im&aacute;genes que
servir&aacute;n como enlaces para dar acceso a dichos
recursos.&nbsp; </p>



<p class="estilo">Entramos en un momento
cr&iacute;tico del que depender&aacute; en gran medida el
&eacute;xito comunicativo de nuestra p&aacute;gina: si somos
capaces de definir una estructura de navegaci&oacute;n clara y
efectiva estaremos muy cerca de nuestro objetivo; si, por el contrario,
faltan enlaces o tienen una estructuraci&oacute;n poco intuitiva
conseguiremos despistar al visitante...y perderlo para siempre.<br>



<br>



Recuerda un par de principios de mencionado al inicio del curso. Por
una parte, si yo no lo tengo claro en mi cabeza no puedo esperar que
sea el visitante el que ponga orden en la mara&ntilde;a de
p&aacute;ginas que le presentar&eacute;. Por otra, ponte
siempre en el lugar del visitante: lo m&aacute;s probable es que
ambos coincidi&eacute;rais en lo que resulta c&oacute;modo para
navegar y bien construido visualmente. </p>



<h2>V&iacute;nculos externos</h2>



<p>El primer tipo de enlace que vamos a trabajar ser&aacute;
el enlace externo. Lo denominamos as&iacute; porque permite saltar
de una p&aacute;gina a otra diferente. No implica necesariamente
que la p&aacute;gina de destino se encuentre fuera de nuestro sitio
WEB, aunque podr&iacute;a ser as&iacute;, sino, sencillamente,
que es diferente de la p&aacute;gina de origen. </p>



<p>Para crear un enlace utilizando&nbsp;N|VU tendremos que
seleccionar previamente la palabra o imagen que va a servir de soporte
a dicho enlace. </p>



<p>Cuando pulsamos el bot&oacute;n derecho N|VU nos
ofrece una opci&oacute;n rotulada como <span class="refmenu">crear
enlace</span><b>. </b>Tambi&eacute;n
habr&iacute;amos conseguido llegar al mismo sitio (y en este caso
en un solo paso) si hubi&eacute;ramos utilizado el icono que se
asemeja a un eslab&oacute;n que aparece en la barra de herramientas:<img style="width: 47px; height: 42px;" alt="Icono enlace" title="Icono enlace" src="imagenes/icoenlace.png">. Otros procedimientos para realizar la misma
tarea son la opci&oacute;n de men&uacute; <span class="refmenu">insertar</span><span class="refmenu">
</span><img class="refmenu" src="../imagenes/flechamenu.png" height="13" width="14"><span class="refmenu"> enlace</span> y la
pulsaci&oacute;n de las teclas <img style="width: 36px; height: 26px;" alt="Ctrl" title="Ctrl" src="../imagenes/teclactrl.png">
+&nbsp;<img style="width: 26px; height: 27px;" alt="Ele" title="Ele" src="../imagenes/teclal.png"></p>



<p><img class="flotizq" style="width: 398px; height: 345px;" alt="Panel de creaci&oacute;n de un v&iacute;nculo" title="Panel de creaci&oacute;n de un v&iacute;nculo" src="imagenes/externo.png">Si pretendemos hacer un enlace a
una p&aacute;gina
que se encuentra fuera de nuestro sitio WEB debemos indicar la
direcci&oacute;n completa de la misma, incluyendo el
protocolo.&nbsp;</p>



<p>Si
en el ejemplo hubi&eacute;ramos puesto simplemente www.google.es el
enlace apuntar&iacute;a a una p&aacute;gina llamada
as&iacute; dentro de nuestro propio sitio web.</p>



<p class="centrado"><img style="width: 364px; height: 56px;" alt="Zona para indicar el texto que soporta el v&iacute;nculo" title="Zona para indicar el texto que soporta el v&iacute;nculo" src="imagenes/externo2.png"></p>



<p>En la imagen aparece una zona para introducir el texto que
soportar&aacute; el enlace. Esta zona del panel solo se
mostrar&aacute; cuando no hayamos seleccionado previamente un
texto, ya que en caso de haberlo hecho aqu&iacute; se
mostrar&iacute;a el texto seleccionado pero no habr&iacute;a
posibilidad de modificarlo.<br clear="all">



</p>



<div class="avisos"><img src="../imagenes/atencion.gif" class="flotizq" alt="Se&ntilde;al de aviso" title="Se&ntilde;al de aviso" height="25" width="28">
Aunque
estamos acostumbrados a escribir las direcciones URL sin necesidad de
indicar el protocolo es imprescindible especificarlo cuando construimos
un enlace puesto que, de los contrario el navegador
intentar&iacute;a buscar la direcci&oacute;n en nuestro propio
sitio. As&iacute;&nbsp;pues, para el enlace a
p&aacute;ginas WEB
externas a nuestro sitio prefijamos la direcci&oacute;n con <b>http://<br>



</b></div>



<p><img class="flotizq" style="width: 418px; height: 336px;" alt="Panel de creaci&oacute;n de v&iacute;nculos" title="Panel de creaci&oacute;n de v&iacute;nculos" src="imagenes/externolocal.png">Cuando enlazamos con una
p&aacute;gina que pertenece
a nuestro sitio WEB podemos hacerlo utilizando el bot&oacute;n <img style="width: 91px; height: 24px;" alt="Elegir archivo" title="Elegir archivo" src="imagenes/botonelegirarchivo.png"> sin olvidar marcar la casilla <span class="refmenu">la url es relativa a la ruta
de la p&aacute;gina</span><b>.</b></p>



<p>Damos por supuesto que todos los archivos y subcarpetas
de nuestra WEB estar&aacute;n contenidos dentro de la misma
carpeta. Si es as&iacute; no habr&aacute; ning&uacute;n
problema a la hora de enviar nuestra WEB al servidor, ya que las rutas
relativas en el mismo coincidir&aacute;n con las de nuestro disco
duro.</p>



<p>En este caso hemos utilizado como soporte para el enlace
una imagen en lugar de un texto y se ha accedido a la
creaci&oacute;n del enlace haciendo un doble clic sobre ella.</p>



Al haber accedido mediante doble clic, en lugar de hacerlo
mediante el icono <img style="width: 47px; height: 42px;" alt="Icono enlace" title="Icono enlace" src="imagenes/icoenlace.png">, la
opci&oacute;n <span class="refmenu">crear enlace</span>
o cualquiera de las que hemos visto antes el programa nos
presenta un men&uacute; con varias pesta&ntilde;as para que
elijamos la categor&iacute;a de atributos de la imagen que deseamos
modificar, estando se&ntilde;alada la pesta&ntilde;a <span class="refmenu">ubicaci&oacute;n</span>, mientras
que en los otros casos habr&iacute;a quedado como activa la
pesta&ntilde;a <span class="refmenu">enlace</span>
que es la que realmente necesitamos manejar en este momento.<br>



Si el enlace apunta a un archivo llamado texto.htm es porque
dicho archivo se encuentra en la misma carpeta que la p&aacute;gina
que estamos creando y, lo mismo ocurrir&aacute; en el servidor.
Cuando apunte, por ejemplo, a imagenes/tratamiento.htm ser&aacute;
porque el archivo tratamiento.htm se encuentra en una subacarpeta que
"cuelga" de la carpeta en la que se encuentra nuestra p&aacute;gina
actual. Como al subir las p&aacute;ginas al servidor enviaremos
todo el contenido de la carpeta principal y sus subcarpetas, la
referencia para la b&uacute;squeda seguir&aacute; siendo
v&aacute;lida.<br>



<div class="avisos">
<p><img class="flotizq" src="../imagenes/atencion.gif" height="25" width="28">&nbsp;Si la
p&aacute;gina en la
que estoy creando el enlace no se ha guardado nunca, N|VU no puede
situar la ruta relativa hacia el enlace, por lo que
escribir&aacute; la ruta absoluta con la forma:</p>



<p><code>file:///C:/Documents%20and%20Settings/Raul/NVU/vinculos2.htm</code><b><br>



<br>



</b>Para evitar que el v&iacute;nculo siga siendo absoluto a
un archivo local es preferible que, antes de crear los enlaces,
guardemos la p&aacute;gina. Si no lo hemos hecho as&iacute;
necesitaremos:</p>



<ol>



  <li> Guardar la p&aacute;gina </li>



  <li> Hacer doble clic en cada enlace que se haya creado (o
pulsar el bot&oacute;n derecho y elegir <span class="refmenu">propiedades
del enlace</span>) y
marcar la casilla <span class="refmenu">la url es
relativa a la ruta de la
p&aacute;gina</span><span class="refmenu" style="font-weight: normal;"></span> </li>



</ol>



Si no cuidamos este detalle ver&iacute;amos la
p&aacute;gina correctamente en modo local, pero no as&iacute;
al enviarla al servidor, puesto que intentar&iacute;a buscarla en
una ubicaci&oacute;n que ser&iacute;a la del disco duro local.
Por eso, dado el peligro de que olvidemos corregir alg&uacute;n
v&iacute;nculo repito la recomendaci&oacute;n de que la
p&aacute;gina se haya guardado antes de empezar la
creaci&oacute;n de los mismos.
</div>



<div class="practicas"><img class="numact" style="width: 29px; height: 29px; float: left;" alt="Actividad 45" title="Actividad 45" src="../imagenes/numeracion/cuarentaycinco.gif">
<ul>



  <li>Crea un nuevo documento e introduce un texto en el que
menciones el servidor del CNICE.&nbsp;</li>



  <li> <strong>Si dispones de conexi&oacute;n a
Internet</strong>
elige alguna palabra del texto que te parezca adecuada como indicativo
del enlace, pulsa el bot&oacute;n para crear el enlace y escribe la
direcci&oacute;n <strong style="font-style: italic;">http://www.cnice.mec.es</strong>
como
destino.&nbsp;</li>



  <li><strong>Si no dispones de conexi&oacute;n a
Internet o
prefieres hacer pruebas en modo local</strong> elige una palabra
y
cuando vayas a establecer el enlace pincha en <span class="refmenu">examinar
archivo</span>
y elige alguno de los trabajos que has guardado previamente.</li>



  <li> Pasa al navegador guardando el trabajo como <strong>actividad45.html</strong>
y comprueba que tu enlace funciona correctamente.&nbsp;</li>



</ul>



</div>



<p class="codigo">El c&oacute;digo b&aacute;sico
de un enlace o hiperv&iacute;nculo es <code>&lt;a
href="destino.htm"&gt;Texto del enlace&lt;/a&gt;</code><br>



<br>



<img src="../imagenes/atencion.gif" height="25" hspace="5" width="28"> Para
facilitar la accesibilidad puede resultar conveniente que al pasar el
rat&oacute;n sobre un enlace se despliegue un mensaje con la
descripci&oacute;n del destino. Para hacerlo habr&aacute; que
incluir el atributo title, con lo que la etiqueta quedar&iacute;a:<br>



<code>&lt;a href="destino.htm"
title="Descripci&oacute;n del destino"&gt;Texto del
enlace&lt;/a&gt;</code> y
el efecto ser&iacute;a el siguiente: <a href="javascript:void()" title="Este enlace no apunta a ning&uacute;n destino. Es para probar el efecto del atributo title.">probar</a></p>



<p>Si quieres introducir el atributo title
mientras
est&aacute;s creando el enlace con los asistentes
gr&aacute;ficos, sin escribir el c&oacute;digo, el
procedimiento ser&aacute; diferente
seg&uacute;n el enlace est&eacute; soportado por una imagen o
por un texto.&nbsp;</p>



<p><img style="width: 418px; height: 336px;" alt="Introducci&oacute;n de t&iacute;tulo emergente y texto alternativo" title="Introducci&oacute;n de t&iacute;tulo emergente y texto alternativo" src="imagenes/titleimagen.png" class="recuadroimg flotder">En
el caso de que el enlace
se apoye en una imagen tienes la posibilidad de introducir el atributo
title incluso antes de crear el v&iacute;nculo, ya que en el
momento de seleccionar la imagen dispondr&aacute;s de una zona para
hacerlo.</p>



<p>Lo que tendr&aacute;s que tener en
cuenta es que
el texto
que aparece para indicar el campo en el que hay que introducirlo no
aparece marcado y recibe la denominaci&oacute;n de <span class="refmenu">t&iacute;tulo emergente</span>. No
debes confundirlo con lo que se denomina
<span class="refmenu">texto alternativo</span> que
corresponde a la
opci&oacute;n para accesibilidad.</p>



<p>Comprobar&aacute;s que, mientras que el&nbsp;<span class="refmenu">t&iacute;tulo emergente</span>
no se
considera imprescindible, el&nbsp;<span class="refmenu">texto
alternativo</span> es un elemento muy
importante y si insertas la imagen sin especificar ninguno
aparecer&aacute; una ventana que te recordar&aacute; la
conveniencia
de hacerlo.</p>



<p>No ser&aacute;s la primera persona que se sorprende ante
la insistencia de este mensaje a pesar que que hayas pulsado el
bot&oacute;n <img style="width: 67px; height: 24px;" alt="Aceptar" title="Aceptar" src="../imagenes/botonaceptar.png"> cada vez que aparece el
mensaje: salvo que marques el bot&oacute;n de radio <span class="refmenu">no usar texto alternativo</span> ese
mensaje seguir&aacute; mostr&aacute;ndose de forma constante
hasta que introduzcas algo en la caja de <span class="refmenu">texto
alternativo</span>.</p>



<img style="width: 487px; height: 50px;" alt="Aviso con explicaci&oacute;n de la funci&oacute;n del texto alternativo" title="Aviso con explicaci&oacute;n de la funci&oacute;n del texto alternativo" src="imagenes/avisotextoalt.png" class="recuadroimg">
<div class="aviso avisos">
<p><img src="../imagenes/atencion.gif" height="25" hspace="5" width="28">El
recordatorio que presenta N|VU es muy claro en cuanto a la
funci&oacute;n que
desempe&ntilde;a el texto alternativo. Sin embargo, una mala
pr&aacute;ctica tradicional a la que ha colaborado la
interpretaci&oacute;n que hace Internet Explorer del atributo <code>alt</code>
ha confundido su funci&oacute;n: Internet Explorer presenta el
texto alternativo como t&iacute;tulo emergente que se muestra al
colocarse
sobre una imagen, cuando si queremos conseguir ese efecto lo correcto
es utilizar el atributo <code>title</code>. Otros
navegadores, como Mozilla, Firefox u Opera se
ajustan a las especificaciones del <acronym title="World Wide Web Consortium">W3C</acronym> y
s&oacute;lo muestra texto
emergente cuando se ha utilizado <code>title</code>,
reservando el contenido <code>alt</code>
para la funci&oacute;n que se ha creado.<br>



</p>



</div>



<p class="flotizq" align="center"><img style="width: 436px; height: 335px;" alt="Edicion avanzada: atributo title en un enlace de texto" title="Edicion avanzada: atributo title en un enlace de texto" src="imagenes/titletexto.png"></p>



<p>Si nuestro enlace est&aacute; soportado
por un
texto no
tendremos una opci&oacute;n directa para incluir el atributo <code>title
</code>desde el panel de construcci&oacute;n del enlace, sino
que
habr&aacute; que pulsar el bot&oacute;n <img style="width: 110px; height: 24px;" alt="Edici&oacute;n avanzada" title="Edici&oacute;n avanzada" src="../imagenes/botonedicionavanzada.png">,
seleccionar
<code>title</code> en el desplegable rotulado <span class="refmenu">atributo</span> y teclear el texto
explicativo o de ampliaci&oacute;n que
deseamos que aparezca cuando el rat&oacute;n pase sobre el enlace
en la caja de <span class="refmenu">valor</span>. </p>



<div class="codigo2">
<p>El ejemplo que se muestra se ver&iacute;a de
la
siguiente forma
en la pesta&ntilde;a <img style="width: 99px; height: 21px;" alt="C&oacute;digo fuente" title="C&oacute;digo fuente" src="../imagenes/pestanacodigofuente.png">:
</p>



<p><code> &lt;a
title="Tutorial de
modificaci&amp;oacute;n del color
de una selecci&amp;oacute;n"
href="sacarloscolores.html"&gt;Modificar
colores&lt;/a&gt;</code></p>



<p>Puedes comprobar que el programa ha cambiado
autom&aacute;ticamente los caracteres acentuados <strong>&oacute;</strong>
por la entidad <code>&amp;oacute;</code>
que es la que
garantiza que dichos caracteres se ver&aacute;n correctamente en
todos los navegadores independientemente de la codificaci&oacute;n
por defecto que est&eacute;n utilizando.<br clear="all">
 </p>



</div>



<div class="practicas"><img class="numact" style="width: 29px; height: 29px; float: left;" alt="Actividad 46" title="Actividad 46" src="../imagenes/numeracion/cuarentayseis.gif">
<ul>



  <li>Abre la p&aacute;gina <strong>actividad45.html</strong>
si la
hab&iacute;as cerrado.&nbsp;</li>



  <li> A&ntilde;ade el atributo <code>title</code>
al vinculo textual que enlazaba con la p&aacute;gina del CNICE.</li>



  <li>Inserta una imagen que enlace al buscador
Google y
a&ntilde;adele a la misma <span class="refmenu">texto
alternativo</span> y <span class="refmenu">t&iacute;tulo
emergente</span> (<code>alt</code>
y <code>title</code>) utilizando un texto diferente
para cada uno de ellos.</li>



  <li>Guarda la p&aacute;gina como<strong> actividad46.html</strong> y &aacute;brela en el navegador.</li>



  <li>Comprueba como aparece el texto
correspondiente a
los
atributos&nbsp;<code>title</code><strong> </strong>
de los enlaces cuando
pasas sobre ellos. </li>



  <li>Si quieres comprobar la forma en que se
muestra el
texto <code>alt </code>sin
necesidad de desactivar la presentaci&oacute;n de
im&aacute;genes en todas las p&aacute;ginas puedes recurrir a
un
peque&ntilde;o truco: modifica manualmente el nombre de la imagen
para que no corresponda con una imagen disponible y guarda la
p&aacute;gina, con lo que conseguir&aacute;s que se reserve el
espacio de la imagen antigua y puedas ver el texto alternativo a la vez
que se muestra el consejo al colocar el rat&oacute;n sobre el hueco
vac&iacute;o. (Para que puedas ver el texto alternativo es
necesario
que la imagen tenga un tama&ntilde;o suficiente, por lo que si era
muy
peque&ntilde;a puedes modificar sus dimensiones para que se le
reserve
un espacio mayor)</li>



</ul>



</div>



<p class="estilo">Cualquier creador de
un sitio
WEB
tiene que respetar una norma b&aacute;sica: ninguna de sus
p&aacute;ginas deber&iacute;a carecer de, al menos, un enlace
que devuelva al visitante al punto de origen. <br>



<br>



Veremos que hay diferentes formas de llevar a la pr&aacute;ctica
este principio, pero, si se hace necesario recurrir a las flechas de
vuelta atr&aacute;s del navegador est&aacute; claro que hemos
cometido un fallo en el dise&ntilde;o de la navegaci&oacute;n. </p>



<div class="practicas"><img class="numact" style="width: 29px; height: 29px; float: left;" alt="Actividad 47" title="Actividad 47" src="../imagenes/numeracion/cuarentaysiete.gif">
<ul>



  <li>Crea un par de p&aacute;ginas nuevas (<strong>actividad47a.html </strong>y <strong>actividad47b.html</strong>)
o utiliza
alguna
de las que ya tienes almacenadas.&nbsp;</li>



  <li>Crea en una de ellas un
v&iacute;nculo que te
lleve a
la otra.</li>



  <li>Ahora crea en la otra p&aacute;gina
un
v&iacute;nculo de vuelta a la p&aacute;gina inicial.</li>



  <li>Pasa al
navegador para
comprobar que has establecido correctamente el recorrido de ida y
vuelta entre ellas. </li>



</ul>



</div>
<br>
</div>
</body>
</html>
