<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html lang="es-es">
<head>


  


  
  
  
  <title>V&iacute;nculos internos</title>
  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">



  
  
  <link rel="stylesheet" type="text/css" href="../nvu2005.css">
<!-- compliance patch for microsoft browsers --><!--[if lt IE 7]>
<script src="../ie7/ie7-standard-p.js" type="text/javascript"></script>
<![endif]-->
</head>


<body>

<div id="localizador">
<p>V&iacute;nculos&gt;&gt;Internos</p>

</div>
<div id="flechadcha">
<a href="vinculos2b.htm" title="avanzar"><img src="../Images/flechadcha.gif" border="0"></a>
</div>
<div id="flechaizq">
<a href="vinculos1.htm" title="retroceder"><img src="../Images/flechaizq.gif" border="0"></a>
</div>


<div id="contenido">

<h2>&iquest;Qu&eacute;
es un
enlace interno?</h2>



<p>La pantalla de un monitor no es desde luego el soporte
m&aacute;s adecuado para un texto largo. A pesar de ello hay
momentos en los que es necesario mostrar un texto de cierta longitud. </p>



<p>Normalmente no suelen ser las p&aacute;ginas principales
ni las que se encuentran en el primer nivel de ramificaci&oacute;n
las que recogen los textos largos. Suele ser m&aacute;s bien en el
segundo nivel de profundidad donde se incluye el desarrollo textual de
los conceptos e ideas principales que se hab&iacute;an apuntado en
los niveles previos.</p>



<p class="estilo">Si tienes experiencia previa de
escritura de textos...&iexcl;olv&iacute;dala! Tal vez suene
demasiado impactante, pero tendr&aacute;s que habituarte a un nuevo
estilo de escritura.<br>



<br>



La influencia del soporte va a condicionar la construcci&oacute;n
de los mensajes: tendr&aacute;s que utilizar frases m&aacute;s
cortas, y procurar que la organizaci&oacute;n visual del texto
refleje la distribuci&oacute;n conceptual. </p>



<p>Si tenemos en cuenta la observaci&oacute;n que se acaba de
formular habr&aacute; que considerar, en aquellos casos en los que
el texto lo permita, su fragmentaci&oacute;n en
ep&iacute;grafes con una cierta unidad de contenido. Una vez
llevada a cabo esta tarea habr&aacute; que facilitar al visitante
la localizaci&oacute;n de cada uno de los ep&iacute;grafes, por
lo que el m&eacute;todo recomendable puede incluir los siguientes
rasgos caracter&iacute;sticos:</p>



<ol>



  <li>Adjudicar a cada ep&iacute;grafe o bloque conceptual
del texto un t&iacute;tulo significativo y resaltarlo visualmente.</li>



  <li>Crear un &iacute;ndice de los ep&iacute;grafes
desarrollados a lo largo del texto y situarlo al principio de la
p&aacute;gina.</li>



  <li>Crear enlaces entre cada punto del &iacute;ndice y el
inicio del texto correspondiente al mismo.</li>



  <li>Crear enlaces de vuelta al &iacute;ndice al final de
cada ep&iacute;grafe (Es m&aacute;s que probable que el
visitante tenga su propio criterio acerca de cu&aacute;les son los
apartados que le interesa leer).</li>



</ol>



<p>Una vez establecido el procedimiento l&oacute;gico veamos
cu&aacute;les son los pasos t&eacute;cnicos para su puesta en
pr&aacute;ctica seg&uacute;n el editor que estemos utilizando.
Pero, antes de hacerlo realizaremos una comparaci&oacute;n que nos
permita entender claramente lo que vamos a hacer: al crear enlaces
dentro de la p&aacute;gina voy a indicarle al navegador del
visitante que se desplace hasta un punto determinado de una
p&aacute;gina que se desarrolla a lo largo de varias pantallas
consecutivas. De alguna manera es como si le indicara a un caminante
que tiene que ir hasta un punto en el que encuentre un cartel con
determinada indicaci&oacute;n. El orden en que realice la secuencia
de acciones para lograr mi objetivo puede ser pues de dos tipos:</p>



<ol type="a">



  <li>Colocar primero los carteles en cada punto de destino y
redactar luego las instrucciones de desplazamiento.</li>



  <li>Redactar primero las instrucciones y poner
despu&eacute;s los carteles indicadores de cada destino.</li>



</ol>



<p>Aunque el orden que adoptemos es indiferente de cara al
resultado hay un detalle que me lleva a sugerir el mencionado en primer
lugar. Ambos editores son capaces de mostrarme una lista con todos los
"carteles de destino" cuando quiera especificar las instrucciones para
el desplazamiento. Eso hace que no tenga que estar recordando como
llam&eacute; a cada destino en las instrucciones que
ser&iacute;a lo que me ocurrir&iacute;a si optara por la
segunda posibilidad.</p>



<h2><span>Enlaces
internos </span></h2>



<p><img style="width: 246px; height: 164px;" alt="Panel para introducir nombre de enlace interno" title="Panel para introducir nombre de enlace interno" class="flotizq" src="imagenes/enlaceinterno.png">Siguiendo
el m&eacute;todo a)
habr&aacute; que desplazarse hasta el punto en el que deseamos que
se inicie cada uno de los ep&iacute;grafes. Una vez all&iacute;
se seleccionar&aacute; la opci&oacute;n de men&uacute; <span class="refmenu">i</span><span class="refmenu">nsertar
</span><img class="refmenu" src="../imagenes/flechamenu.png" height="13" width="14"><span class="refmenu">
enlace interno</span>
y el programa preguntar&aacute; el nombre que quiero darle a ese
destino. <img style="width: 398px; height: 324px;" alt="Selecci&oacute;n de un destino interno" title="Selecci&oacute;n de un destino interno" class="flotder" src="imagenes/destinos.png">Tambi&eacute;n podemos
utilizar el icono <img style="width: 77px; height: 40px;" alt="Enlace interno - Ancla" title="Enlace interno - Ancla" src="imagenes/icoenlaceinterno.png">.
Observar&aacute;s que, si dejas espacios entre las palabras, el
programa los sustituye por un gui&oacute;n bajo ( _ ) para que se
puedan localizar los destinos sin que se produzcan errores cuando la
p&aacute;gina est&eacute; publicada en Internet. Por otra
parte, pare evitar problemas con la codificaci&oacute;n es
preferible que no utilices en los nombres de los enlaces caracteres
acentuados, e&ntilde;es ni ning&uacute;n tipo de signo de
puntuaci&oacute;n.</p>



<p>Una vez creados todos los destinos, sin olvidar colocar uno al
principio del &iacute;ndice de apartados para que los visitantes
puedan volver a &eacute;l cuando lo necesiten, volver&eacute;
al principio de la p&aacute;gina para crear los enlaces.</p>



<p>Como puede observarse en la imagen de la derecha, al iniciar
la creaci&oacute;n del v&iacute;nculo igual que lo
hac&iacute;a para crear enlaces externos comprobamos que, al pulsar
el desplegable, aparece una lista con los destinos que tengo definidos
en la p&aacute;gina.</p>



<p>Merece la pena que prestes atenci&oacute;n a la imagen de
la derecha: aparecen cuatro posibles destinos, pero realmente
s&oacute;lo se hab&iacute;a creado un enlace interno. Esta es
una interesante prestaci&oacute;n del programa para facilitar la
creaci&oacute;n de un &iacute;ndice de contenidos ya que, sin
que intervengamos, toma los textos de todos los encabezados&nbsp;(<code>h1</code>
a <code>h6</code>) y los convierte en posibles destinos
internos. Sin embargo presenta una dificultad que seguramente ya
habr&aacute;s descubierto: cuando el encabezado&nbsp;incluye
caracteres acentuados&nbsp;el programa los incorpora como nombre
del enlace,
lo cual provocar&aacute; los problemas que hemos comentado antes ya
que se codifican de forma diferente en el texto de la p&aacute;gina
y en el nombre del enlace, con lo cual no se consigue que se
correspondan.</p>





<div class="avisos"><img class="flotizq" src="../imagenes/atencion.gif" height="25" hspace="5" width="28">Si
necesitamos enlazar con un anclaje de otra p&aacute;gina diferente
necesitaremos conocer el nombre y especificarlo tal como se indica en
la anotaci&oacute;n de c&oacute;digos que se muestra a
continuaci&oacute;n. </div>



<p class="codigo">Si le echas un vistazo al
c&oacute;digo comprobar&aacute;s que los nombres de los
destinos aparecen como en el siguiente ejemplo<br>



<code>
&lt;a
name="resolucion_de_pantalla"&gt;&lt;/a&gt;</code><br>



<br>



Cuando creas un v&iacute;nculo que apunta a ese destino aparece un
signo # que indica que se trata de un punto espec&iacute;fico
dentro de la p&aacute;gina.<br>



<code>
&lt;a
href="#indice_particular"&gt;Volver&lt;/a&gt;</code><br>



<br>



Como ves se ha evitado incluir caracteres&nbsp;especiales a pesar
de que en ambos se incluyen palabras que deber&iacute;an llevar una
tilde.<br>



<br>



Si el enlace apunta a un anclaje situado en otra p&aacute;gina
diferente a la actual figurar&aacute; primero la
identificaci&oacute;n de la p&aacute;gina y luego, sin
separaci&oacute;n, el&nbsp;nombre del enlace interno
incluyendo, como siempre,&nbsp;el signo #.<br>



<code>
&lt;a
href="imagen.htm#ejemplos"&gt;Ver&lt;/a&gt;</code></p>





<div class="practicas"><a name="vuelta"></a><img class="numact" style="width: 29px; height: 29px; float: left;" alt="Actividad 48" title="Actividad 48" src="../imagenes/numeracion/cuarentayocho.gif">
Para evitarte el trabajo de teclear un par de p&aacute;ginas te
ofrecemos una p&aacute;gina de ejemplo ya preparada. Para
utilizarla puedes <a href="#vuelta" onclick="window.open('../estilos/prensa.htm','auxiliar','menubar=1,scrollbars=1,top=0,left=0,width=450,height=400')">abrir</a>
este peque&ntilde;o art&iacute;culo sobre prensa escolar, guardarlo en la carpeta de
pr&aacute;cticas, y
empezar la modificaci&oacute;n del mismo utilizando la
opci&oacute;n de men&uacute; <span class="refmenu">archivo</span><b class="refmenu"> <img src="../imagenes/flechamenu.png" height="13" width="14"> abrir
archivo</b>.
<ul>



  <li>El texto no tiene pr&aacute;cticamente formato: apenas
las separaciones de p&aacute;rrafo necesarias y una lista de
ep&iacute;grafes al inicio. Si lo consideras necesario lo primero
que habr&iacute;a que hacer ser&iacute;a dar formato a los
elementos del texto para resaltar visualmente los que consideres
necesarios. Puedes optar por hacer que el resaltado sea
&uacute;nicamente visual, pero tambi&eacute;n puedes pensar
qu&eacute; etiquetas te permitir&aacute;n modificar el aspecto
visual y, a la vez, estructurar el contenido del texto.</li>



  <li>Introduce los anclajes con nombre que consideres necesarios
nombr&aacute;ndolos de forma que sea f&aacute;cilmente
identificable el
texto al que corresponden. No olvides crear un <strong>enlace&nbsp;</strong>o
    <strong> anclaje</strong> en
el principio del documento.</li>



  <li>Ve al &iacute;ndice inicial y crea los
v&iacute;nculos con cada uno de los ep&iacute;grafes del
documento.</li>



  <li>Introduce una palabra o una imagen que te sirva para volver
al &iacute;ndice despu&eacute;s de cada ep&iacute;grafe.
Puedes guardar con el bot&oacute;n derecho la siguiente <img alt="Flecha" title="Flecha" style="width: 19px; height: 13px;" src="imagenes/farriba.png"></li>



  <li>Crea los enlaces de vuelta al &iacute;ndice.<br>



    
    
    <div class="avisos"><img class="flotizq" src="../imagenes/atencion.gif" height="25" width="28">Teniendo en cuenta que todos
los enlaces de vuelta atr&aacute;s apuntan al mismo lugar puedes
crear el primero, copiarlo, e irlo pegando en cada uno de los sitios en
los que deba aparecer.</div>

  </li>



</ul>



<ul>



  <li>Guarda el trabajo como <strong>actividad48.html</strong>
y comprueba que los enlaces funcionan correctamente.&nbsp;</li>



</ul>



<ul>



</ul>



</div>



<p>&nbsp;</p>



<h2>Situaciones especiales</h2>



<p>En ocasiones puede resultarte necesario que un determinado
enlace no se abra en la ventana activa, sino en una nueva ventana. Para
hacerlo habr&iacute;a que tratar el enlace como si
estuvi&eacute;ramos en una p&aacute;gina con marcos, e indicar
que deseamos que el destino se muestre en una nueva ventana. Aunque el
tema de marcos forma parte del nivel de profundizaci&oacute;n
puedes lograr el efecto perseguido mediante estas simples instrucciones:</p>



<p>Pulsa el bot&oacute;n <strong>Avanzadas</strong>
y all&iacute; seleccionar el atributo target y el valor <strong>_blank</strong>,
tal como se muestra en la siguiente imagen</p>



<div class="centrado"><img style="width: 436px; height: 398px;" alt="Panel de propiedades avanzadas" title="Panel de propiedades avanzadas" src="imagenes/targetblank.png">.</div>



<p class="codigo">Si prefieres utilizar directamente el
c&oacute;digo tendr&iacute;as que hacerlo a&ntilde;adiendo
el atributo tal como se muestra<br>



<br>



<code>
&lt;a href="destino.htm"
target="_blank"&gt;texto del enlace&lt;/a&gt;</code></p>



<div class="practicas"><img class="numact" style="width: 29px; height: 29px; float: left;" alt="Actividad 49" title="Actividad 49" src="../imagenes/numeracion/cuarentaynueve.gif">&nbsp;Puedes utilizar el archivo <strong>actividad48.html </strong>para hacer que alguno de los
destinos se abra en una ventana diferente
<ul>



  <li>Crea un enlace que apunte al <a href="http://www.prensajuvenil.org/registro/espana.htm">Registro de publicaciones de prensa juvenil en Espa&ntilde;a</a> (http://www.prensajuvenil.org/registro/espana.htm)&nbsp;</li>



  <li>Haz que dicho enlace se abra en una nueva
ventana.</li>



  <li>Guarda el archivo como <strong>actividad49.html</strong></li>



</ul>



</div>



<h2>Un panel sorprendente</h2>



<p><img class="flotder" style="width: 262px; height: 169px;" alt="Panel abrir enlace en..." title="Panel abrir enlace en..." src="imagenes/abreennuevaventana.png">Es posible que ya
hayas pulsado el bot&oacute;n <img style="width: 128px; height: 24px;" alt="M&aacute;s propiedades" title="M&aacute;s propiedades" src="imagenes/botonmaspropiedades.png">.
Si es as&iacute; te habr&aacute;s preguntado por qu&eacute;
no he comentado antes que all&iacute; existe una posibilidad
r&aacute;pida para indicar que los enlaces deben abrirse en otra
ventana o, cuando se trabaja con marcos, especificar d&oacute;nde
deber&aacute; abrirse el enlace.</p>



<p>Adem&aacute;s, dado que el programa "recuerda" como hemos
abierto cada uno de los paneles, si decidimos desplegar este panel de
propiedades lo tendremos disponible para ocasiones sucesivas.</p>



<p>Bien, el motivo de no haberlo explicado antes es que,
adem&aacute;s de esta posibilidad, el panel incluye un par de
secciones que podr&iacute;an haber resultado un tanto
desconcertantes en una primera toma de contacto.</p>



<p><img class="flotizq" style="width: 519px; height: 422px;" alt="M&aacute;s propiedades para los enlaces" title="M&aacute;s propiedades para los enlaces" src="imagenes/enlacesxfn.png">La primera secci&oacute;n
se refiere a marcar el enlace como etiqueta Technorati que, a pesar de
lo lioso que puede ser esto del <acronym title="Hypertext Markup Language">html</acronym>, es
probable que a&uacute;n&nbsp;te suene a <span style="font-style: italic;">"palabro"</span> de los
que usa Forges en sus vi&ntilde;etas. &iexcl;Pues no!
Utilizando la definici&oacute;n que de s&iacute; mismos hacen
en su sitio web,&nbsp;<a href="http://technorati.com" target="_blank">Technorati</a> es&nbsp;<q>un
motor de b&uacute;squeda en tiempo real que realiza el seguimiento
de lo que sucede en la blogosfera (el mundo de los weblogs o
bit&aacute;coras)</q><span style="font-style: italic;"></span><cite></cite>.
Dado que es poco probable que utilices N|VU para trabajar sobre los
contenidos de un weblog no parece que esta opci&oacute;n vaya a ser
de mucha utilidad.</p>



<p>Tambi&eacute;n se aplica principalmente a los weblogs el
bloque que aparece en la zona inferior relativo a etiquetas <acronym title="XHTML Friends Network">XFN</acronym>. Se trata
de una red social en la que etiquetamos los enlaces indicando la
relaci&oacute;n que mantenemos con el autor o autora del sitio
enlazado. Aunque su utilidad en sitios&nbsp; web que no sean
bit&aacute;coras puede quedar algo m&aacute;s restringida.
Adem&aacute;s, ser&iacute;a interesante que el documento en el
que se incluyeran dichas etiquetas&nbsp;se ajustara a las
especificaciones <acronym title="eXtensible HyperText Markup Language">XHTML</acronym>.
Esta especificaci&oacute;n ser&aacute; la que
sustituir&aacute; en el futuro al HTML con la intenci&oacute;n
de avanzar en el camino de la web sem&aacute;ntica, donde todos los
contenidos estar&iacute;an categorizados y f&aacute;cilmente
localizables en funci&oacute;n de su significado y su
estructura.&nbsp;N|VU permite generar documentos acordes con esta
especificaci&oacute;n aunque no se ha hecho referencia para no
tener que ahondar en explicaciones sobre algunas funcionalidades que no
estar&iacute;an activas si se opta por este modelo de documento.</p>



<p>Para probar lo que ocurre cuando se utilizan las
etiquetas&nbsp;<acronym title="XHTML Friends Network">XFN</acronym>
aqu&iacute; tienes un ejemplo:&nbsp;</p>



<div class="codigo">
<p><a href="http://platea.pntic.mec.es/aperez4" rel="friend met colleague" target="_blank">P&aacute;gina
de Antonio P&eacute;rez</a>, profesor de
matem&aacute;ticas,
al que conozco personalmente y que es amigo m&iacute;o. </p>



<p>Si intentamos ver cual
es el c&oacute;digo que se ha generado al utilizar las
etiquetas&nbsp;<acronym title="XHTML Friends Network">XFN</acronym>
veremos
lo siguiente:</p>



<p> <code>&lt;a
href="http://platea.pntic.mec.es/aperez4"
rel="friend met colleague" target="_blank"&gt;P&aacute;gina de
Antonio
P&eacute;rez&lt;/a&gt; </code></p>



</div>



<p><code></code> </p>



<div class="practicas"><img class="numact" style="width: 29px; height: 29px; float: left;" alt="Actividad 50" title="Actividad 50" src="../imagenes/numeracion/cincuenta.gif">Puedes
realizar esta pr&aacute;ctica voluntaria para experimentar el
efecto de los enlaces de amistad <acronym title="XHTML Friends Network">XFN</acronym>
<ul>



  <li>Crea una p&aacute;gina en la que aparezca
un enlace a la hipot&eacute;tica&nbsp;p&aacute;gina de un
compa&ntilde;ero o compa&ntilde;era de trabajo.&nbsp;</li>



  <li>Si quieres diferenciar las diferentes
posibilidades crea otros enlaces que apunten p&aacute;ginas de
familiares, vecinos, etc.</li>



  <li>Comprueba en la pesta&ntilde;a de <img style="width: 99px; height: 21px;" alt="C&oacute;digo fuente" title="C&oacute;digo fuente" src="../imagenes/pestanacodigofuente.png">
la forma en la que se han incorporado estos atributos a la etiqueta
b&aacute;sica del enlace.</li>



</ul>



</div>



<!-- <p>Efecto roll-over</p> <p> Uno de los efectos que habr&aacute;s visto en muchas p&aacute;ginas es el conocido como rollover que consta de dos pasos:</p> <ul> <li>al pasar el cursor sobre una o m&aacute;s im&aacute;genes de nuestra p&aacute;gina aparece una nueva imagen en su lugar</li> <li>cuando el cursor deja de estar sobre la imagen esta vuelve a su estado inicial, mostr&aacute;ndose la imagen original.</li> </ul> <p> El rollover suele utilizarse para dar un mayor dinamismo a los v&iacute;nculos soportados por im&aacute;genes. Para su creaci&oacute;n es necesaria la aplicaci&oacute;n de un c&oacute;digo javascript que vamos a explicar a continuaci&oacute;n por si alguna vez quieres crear un rollover</p> <a href="cincel.html"><img src="imagenes/flechaderecha.png" border="0" height="29" width="29" alt="ejemplo de rollover" title="Ejemplo de rollover" onmouseout="this.src='imagenes/flechaderecha.png'" onmouseover="this.src='imagenes/flechaderecha2.png'"></a><br> <p>&lt;a href="cincel.html"&gt;&lt;img onmouseout="this.src=flechaderecha.jpg'" <br> onmouseover="this.src='minibases.jpg'" alt="" src="minibasesgris.jpg" <br> border="0" height="127" width="50"&gt;&lt;/a&gt; </p> <p>Si se quieren precargar las im&aacute;genes: consultar http://www.tierradenomadas.com</p> <p> function Precargar() { </p> <p>for (var i=0; i&lt;Precargar.arguments.length; i++) { Imagenes[i]=new Image; Imagenes[i].src=Precargar.arguments[i]; } } Imagenes = new Array(); Precargar('uno_ac.png', 'uno_in.png', 'dos_ac.png', 'dos_in.png', 'tres_ac.png', 'tres_in.png'); </p> -->
</div>
</body>
</html>
