<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html lang="es-es">
<head>

  


  
  <title>Enlaces de correo</title>
  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">


  
  <link rel="stylesheet" type="text/css" href="../nvu2005.css">
<!-- compliance patch for microsoft browsers --><!--[if lt IE 7]>
<script src="../ie7/ie7-standard-p.js" type="text/javascript"></script>
<![endif]-->
</head>


<body>

<div id="localizador">
<p>V&iacute;nculos&gt;&gt;Correo</p>

</div>
<div id="flechadcha">
<a href="vinculos4.htm" title="avanzar"><img src="../Images/flechadcha.gif" border="0"></a>
</div>
<div id="flechaizq">
<a href="vinculos2c.htm" title="retroceder"><img src="../Images/flechaizq.gif" border="0"></a>
</div>


<div id="contenido">

<h2>&iquest;Qu&eacute; es un
enlace de correo? </h2>


<p>Habr&aacute;s visto que son muchas las p&aacute;ginas
en las que aparece alg&uacute;n enlace, textual o
ic&oacute;nico, que, al pulsarlo arranca la aplicaci&oacute;n
de correo electr&oacute;nico y coloca en ella una determinada
direcci&oacute;n como destinatario de la p&aacute;gina. Esos
enlaces son los que denominamos enlaces de correo. Su utilidad es
evidente, ya que brindan al visitante una forma inmediata de ponerse en
contacto con la persona responsable de la p&aacute;gina.</p>


<p class="estilo">Si abres una v&iacute;a de
comunicaci&oacute;n con el exterior te comprometes a atender los
mensajes que recibas por esa v&iacute;a. Si no es as&iacute; es
preferible que no pongas enlaces de correo. <br>


<br>


Es un fen&oacute;meno muy corriente en instituciones que se utilice
un buz&oacute;n de correo gen&eacute;rico sin que nadie se
responsabilice de consultarlo.</p>


<p>La &uacute;nica variaci&oacute;n que vamos a encontrar
con respecto a los otros enlaces que hemos creado hasta el momento es
la forma de escribir el destino. As&iacute; pues, una vez
seleccionado el texto o imagen que soportar&aacute; el
v&iacute;nculo pulsaremos el icono <img style="width: 47px; height: 42px;" alt="Enlace" title="Enlace" src="imagenes/icoenlace.png"> para
crearlo.</p>


<p class="centrado"><img style="width: 398px; height: 319px;" alt="Panel para introducir la direcci&oacute;n del enlace de correo" title="Panel para introducir la direcci&oacute;n del enlace de correo" src="imagenes/mailto.png"></p>


<p>Como puedes comprobar, el panel de introducci&oacute;n de
datos es el mismo que hemos utilizado hasta el momento y lo
&uacute;nico que tenemos que hacer es marcar la casilla que indica
que lo escrito es una direcci&oacute;n de correo
electr&oacute;nico</p>


<p class="codigo">Al comprobar el c&oacute;digo de la
p&aacute;gina veremos que el enlace de correo aparece de la
siguiente forma <b><br>


<br>


</b><code>
&lt;a
href="mailto:persona@servidor.correo"&gt;Texto del
enlace&lt;/a&gt;</code><br>


<br>


<img class="flotizq" src="../imagenes/atencion.gif" height="25" width="28">Si alguna vez intentas
introducir el c&oacute;digo manualmente ten cuidado con uno de los
errores frecuentes,
especialmente entre quienes saben ingl&eacute;s: es escribir <code>mailto</code>separando
las palabras mail y to, cuando&nbsp;se debe escribir
todo junto. Tambi&eacute;n, como puedes observar en el c&oacute;digo
que se muestra, el resto del enlace aparece escrito de forma
continua, sin intercalar espacios.</p>


<p><img class="flotder" style="width: 398px; height: 319px;" longdesc="mailtoescondido.html" alt="Disimulando la direcci&oacute;n con unas may&uacute;sculas" title="Disimulando la direcci&oacute;n con unas may&uacute;sculas" src="imagenes/mailtoescondido.png" hspace="10">El
problema que lleva aparejada la inclusi&oacute;n de la
direcci&oacute;n de correo en una p&aacute;gina tiene que ver
con la publicidad no deseada ya que los enlaces de correo son una de
las fuentes de las que beben los programas de miner&iacute;a de
datos para localizar direcciones a las que poder enviar spam.</p>


<p>Aunque todas nuestras direcciones figuran en muchas bases de
datos est&aacute; claro que puede ser recomendable no presentarla
de forma p&uacute;blica para que cualquiera pueda almacenarla. El
problema es que esta postura es dif&iacute;cilmente conciliable con
la creaci&oacute;n de una p&aacute;gina de un centro educativo
que pretende abrir un nuevo canal de comunicaci&oacute;n para toda
la comunidad educativa.</p>


<p>Una soluci&oacute;n, no demasiado elegante, pero que puede
ser sencilla y efectiva consiste en disfrazar la direcci&oacute;n
como se hace habitualmente al configurar las cuentas de acceso a news.
L&oacute;gicamente este sistema tiene el inconveniente de que un
usuario que no preste atenci&oacute;n al mensaje que indica
c&oacute;mo eliminar el "disfraz" puede enviarlo a una
direcci&oacute;n que no existe. Para minimizar este inconveniente
podemos utilizar la etiqueta <code>title</code>. Para
hacerlo pulsa&nbsp;el bot&oacute;n <img style="width: 109px; height: 23px;" alt="Edici&oacute;n avanzada" title="Edici&oacute;n avanzada" src="../imagenes/botonedicionavanzada.png"> , selecciona <code>title</code>&nbsp;en
el desplegable de <span class="refmenu">atributos</span>
y teclea el texto correspondiente en la caja de <span class="refmenu">valor</span>&nbsp; de forma que
resulte un efecto similar al que se muestra en el siguiente ejemplo: <a href="mailto:BORRALASMAYUSCULASrluna@platea.cnice.mecd.es" title="Aparece direcci&oacute;n disfrazada para evitar spam. Para corregirla borra las may&uacute;sculas.">Escr&iacute;benos</a></p>


<br clear="all">


<div class="practicas"><img class="numact" style="width: 29px; height: 29px; float: left;" alt="Actividad 53" title="Actividad 53" src="../imagenes/numeracion/cincuentaytres.gif">&nbsp; Crea una nueva
p&aacute;gina y teclea un texto en el que puedas incluir un enlace
de correo a tu propia direcci&oacute;n.
<ul>


  <li>Guarda la p&aacute;gina como <strong>actividad53.html</strong> y
c&aacute;rgala en el navegador para comprobar que el enlace pone en
marcha el programa de correo.</li>


  <li>Vuelve a la p&aacute;gina que estabas editando e
incorpora en ella cualquiera de estas im&aacute;genes para que te
sirvan de soporte al enlace de correo.<br>


    <img src="../imagenes/correo2.gif" height="21" hspace="10" width="22"><img src="../imagenes/correo.gif" height="59" hspace="10" width="60"></li>


  <li>Disimula la direcci&oacute;n e incluye un atributo <code>title</code>
en el enlace que sirva de aviso. Comprueba el efecto que se
consigue. </li>


</ul>


</div>


<p>&nbsp;</p>


<div class="practicas">
<p><img class="numact" style="width: 29px; height: 29px; float: left;" alt="Actividad 54" title="Actividad 54" src="../imagenes/numeracion/cincuentaycuatro.gif">&nbsp; Vamos a continuar
con alg&uacute;n peque&ntilde;o truco v&aacute;lido para
los v&iacute;nculos de correo. </p>


<p><b><img src="../imagenes/atencion.gif" align="left" height="25" width="28"></b>Tienes
que considerar una cuesti&oacute;n importante: este truco no se
ajusta a las especificaciones generales sobre el formato de las
direcciones de correo por lo que, aunque en este momento lo admiten la
mayor&iacute;a de los navegadores, puede ocurrir que deje de ser
v&aacute;lido en el futuro o que no funcione con alg&uacute;n
navegador </p>


<ul>


  

  <li>Crea una nueva p&aacute;gina en la que incluyas un
enlace de correo o bien abre la que hab&iacute;as guardado como&nbsp;<strong>actividad53.html&nbsp;</strong></li>
  <li><strong></strong>Activa las propiedades del enlace para incluir una
peque&ntilde;a modificaci&oacute;n </li>


  <li>Teclea a continuaci&oacute;n de la
direcci&oacute;n, <b>sin dejar ning&uacute;n espacio
tras lo que hab&iacute;a escrito, </b>el texto que figura a
continuaci&oacute;n en negrita <b>?Subject=Mensaje desde la
p&aacute;gina WEB de pruebas </b>(<b>S&iacute;</b>
puedes
dejar espacio entre las palabras que van tras el signo igual aunque
dependiendo del programa de correo que utilices es posible que los
espacios se sustituyan por un signo +)</li>


  <li>Guarda la p&aacute;gina como&nbsp;<strong>actividad54.html&nbsp;</strong>
y c&aacute;rgala en el navegador. Pulsa el enlace que has
modificado y comprueba lo que ocurre.</li>


  <li>Puedes seguir haciendo pruebas a&ntilde;adiendo, sin
dejar espacio despu&eacute;s de la &uacute;ltima palabra
escrita, <b>&amp;CC=direccion@de.correo</b> </li>


  <li>Guarda y comprueba el efecto.</li>


  <li>Y a&uacute;n m&aacute;s. A&ntilde;ade ahora <b>&amp;BCC=otra@direccion.de.correo</b></li>


  <li>Y, por &uacute;ltimo, <b>&amp;BODY=Un texto
que quieras que aparezca en el cuerpo del mensaje.</b></li>


  <li>Guarda el archivo de forma definitiva.<br>


  </li>


</ul>


</div>


<br>


&nbsp;
<div class="avisos">
<p><img src="../imagenes/atencion.gif" align="left" height="24" width="28">El signo <b>?</b>
que has utilizado en los enlaces anteriores no va necesariamente unido
a <b>subject</b>, pero si pretendemos escribir
modificadores en el enlace de correo debe ser el que
acompa&ntilde;e al primer modificador, sea el que sea. Los
siguientes ir&aacute;n precedidos por el signo <b>&amp;</b></p>


<p> En la pr&aacute;ctica se ha puesto en primer lugar el
modificador del asunto (subject) porque es el que nos puede resultar
verdaderamente &uacute;til, ya que nos permitir&iacute;a una
clasificaci&oacute;n autom&aacute;tica de todos los mensajes
recibidos desde la p&aacute;gina WEB utilizando un filtro o regla
de correo.</p>


</div>

</div>
</body>
</html>
