<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html lang="es-es">
<head>
  <title>Mapas</title>


  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">

  <link rel="stylesheet" type="text/css" href="../nvu2005.css">

<!-- compliance patch for microsoft browsers --><!--[if lt IE 7]>
<script src="../ie7/ie7-standard-p.js" type="text/javascript"></script>
<![endif]-->
</head>


<body>
<div id="localizador">
<p>V&iacute;nculos&gt;&gt;Mapas sensibles</p>

</div>
<div id="flechadcha">
<a href="vinculos5.htm" title="avanzar"><img src="../Images/flechadcha.gif" border="0"></a>
</div>
<div id="flechaizq">
<a href="vinculos3.htm" title="retroceder"><img src="../Images/flechaizq.gif" border="0"></a>
</div>


<div id="contenido">

<p>Una vez que conoces los procedimientos para crear los
diferentes tipos de v&iacute;nculos es momento de dar un paso
m&aacute;s y buscar un nuevo soporte para los mismos.</p>

<p><img style="width: 377px; height: 356px; float: right;" alt="Imagen de un reloj anal&oacute;gico" title="Imagen de un reloj anal&oacute;gico" src="../imagenes/reloj.png" hspace="10">Recordar&aacute;s
que, con motivo de la explicaci&oacute;n de los enlaces internos,
se coment&oacute; que es necesario reaprender a escribir para la
WEB. Una de las habilidades que habr&aacute; que desarrollar
ser&aacute; la capacidad para integrar la imagen y texto escrito,
de forma que no nos perdamos en descripciones que se har&iacute;an
innecesarias si hubi&eacute;ramos usado una imagen adecuada.</p>

<p>Vamos pues a imaginar que en nuestra p&aacute;gina WEB del
centro pretendemos hacer una descripci&oacute;n de las diferentes
salas que lo componen y la forma de acceder de una a otra. Es posible
que, en un primer momento, no caigamos en la cuenta de que la mejor
forma de describir los espacios de un edificio y la forma de ir de unos
a otros es con un plano. Al fin y al cabo, &iquest;qu&eacute;
hay como
indicaci&oacute;n de salida de emergencia en un cuarto de hotel,
una descripci&oacute;n literaria o un plano?</p>

<p>En la WEB podemos hacer que una imagen, con suficiente calidad
descriptiva y de discriminaci&oacute;n de zonas, sirva como mapa
gu&iacute;a que nos lleve a los diferentes enlaces del sitio en el
que nos encontramos. Sobre esa imagen construiremos un mapa cuyas
diferentes zonas vincular&aacute;n a otros lugares de la WEB.</p>

<p>Como el ejemplo del plano del centro puede limitar por
asociaci&oacute;n con el t&eacute;rmino mapa la
comprensi&oacute;n del concepto vas a
disponer de una imagen diferente para hacer la pr&aacute;ctica. </p>

<p>El ejercicio que se propone es crear una p&aacute;gina que
haga las veces de agenda de planificaci&oacute;n diaria en la que
los enlaces principales est&eacute;n soportados por un mapa
sensible.</p>

<p>Una vez propuesta la idea vamos a comentar brevemente las
tareas que hay que hacer para generar el mapa.</p>

<p>El primer paso ser&aacute; crear la p&aacute;gina.</p>

<div class="practicas">
<p><img class="numact" style="width: 29px; height: 29px; float: left;" alt="Actividad 55" title="Actividad 55" src="../imagenes/numeracion/cincuentaycinco.gif"> Crea una
p&aacute;gina con el editor que
reuna las siguientes caracter&iacute;sticas:</p>

<ul>

  <li>En la zona superior debe aparecer, centrada, la imagen del
reloj.</li>

  <li>En la zona inferior ir&aacute;n apareciendo una
hipot&eacute;tica jornada de 8 a 3 en la que se ir&aacute;n
poniendo, en cada una de las horas, un par de actividades (la idea es
conseguir una p&aacute;gina que ocupe m&aacute;s de una
pantalla de longitud)</li>

  <li>La imagen del reloj ir&aacute; precedida por un ancla o
enlace interno con nombre al que llamaremos ... como cada uno desee.</li>

  <li>Al principio de cada una de las horas habr&aacute;
tambi&eacute;n un enlace interno con nombre (lo normal
ser&iacute;a llamarla con el nombre de cada hora &iquest;no?)</li>

  <li>Detr&aacute;s de las tareas de cada una de las horas
incluiremos el icono <img style="width: 19px; height: 13px;" alt="Flecha hacia arriba" title="Flecha hacia arriba" src="../imagenes/farriba.png"> para la
vuelta al reloj. De hecho podr&iacute;amos incluirlo
s&oacute;lo entre las 8 y las 9, crear el enlace de vuelta al reloj
y copiarlo para ir peg&aacute;ndolo entre cada par de horas, ya que
siempre ser&aacute; el mismo enlace.</li>

  <li>Ahora que ya tienes creada la base gu&aacute;rdala con
el nombre&nbsp;<strong>actividad55.html</strong></li>

</ul>

</div>

<p>Abriremos ahora Gimp, la utilidad que nos va a permitir
construir nuestro mapa sensible aprovechando el reloj. Lo primero
ser&aacute; utilizar la opci&oacute;n de
men&uacute; <span class="refmenu">archivo <img src="../imagenes/flechamenu.png" height="13" width="14">
abrir</span><strong>
</strong> para seleccionar el archivo de imagen. La ventana en la
que se abre
la imagen mostrar&aacute; una barra de men&uacute; en la zona
superior y en ella
elegiremos <span class="refmenu">filtros <img class="refmenu" src="../imagenes/flechamenu.png" height="13" width="14"> web
<img src="../imagenes/flechamenu.png" height="13" width="14"> mapa
de imagen</span> que dar&aacute; paso a una nueva ventana
en la que iremos trabajando
para delimitar las zonas sensibles que servir&aacute;n como
v&iacute;nculos. </p>

<p class="centrado"><img src="../gimp/mapa1.png" height="426" width="641">
</p>

<p>El procedimiento consta de dos pasos: </p>

<ol>

  <li>Seleccionar la zona de la imagen que quiero que sirva de
soporte al enlace. <br>

  </li>

  <li>Crear un v&iacute;nculo en esa zona, estableciendo el
destino al que nos llevar&aacute; la pulsaci&oacute;n sobre la
misma.</li>

</ol>

<p>La selecci&oacute;n que se ha hecho en la imagen es
circular, pero se podr&iacute;a haber realizado una rectangular o
una poligonal en la que ir&iacute;a marcando cada uno de los
v&eacute;rtices que delimitar&aacute;n la zona.</p>

<p>La forma de cerrar la zona es ligeramente diferente
seg&uacute;n el tipo: asi, para las zonas circulares el primer clic
marca el centro, el desplazamiento del rat&oacute;n el radio y el
segundo clic el final de la selecci&oacute;n. Muy similar es el
caso de los paralelogramos, donde el segundo clic tambi&eacute;n
supone el cierre de la selecci&oacute;n. Para las zonas poligonales
cada clic izquierdo es un v&eacute;rtice hasta que hacemos un doble
clic que
cierra la zona.</p>

<p><img class="flotder" src="../gimp/mapa2.png" height="463" hspace="10" width="379">La
&uacute;nica precauci&oacute;n que deber&iacute;amos
adoptar es procurar que las zonas no se solapenpara no crear
situaciones que den lugar a errores, aunque en ese caso
tendr&aacute; preferencia para la delimitaci&oacute;n de la
zona la &uacute;ltima que se haya creado </p>

<p>Cada vez que cierres la selecci&oacute;n de una zona
aparecer&aacute; autom&aacute;ticamente una ventana para
introducir el destino. Como en nuestro caso se trata de enlaces a la
propia p&aacute;gina bastar&iacute;a con poner lo que ves en la
ilustraci&oacute;n, ya que el signo <b># </b> es el
que sirve para indicar un destino interno dentro
de una p&aacute;gina. </p>

<p>La primera vez que creamos un enlace el tipo&nbsp;enlace
aparece autom&aacute;ticamente marcado
como <span class="refmenu">sitio web</span>, aunque
en cuanto no introduzcamos el protocolo correspondiente http://
cambiar&aacute; autom&aacute;ticamente al tipo <span class="refmenu">otro</span> lo cual nos facilita el
trabajo
a la hora de enlazar con p&aacute;ginas de nuestra propia web o con
enlaces internos con nombre dentro de la propia p&aacute;gina como
hacemos en este ejemplo. Si necesit&aacute;ramos cualquier otro
tipo de enlace basta con teclear el URL y pulsar el selector
correspondiente para que el programa a&ntilde;ada el protocolo
necesario para completar la <b>ruta absoluta</b></p>

<p>En la imagen se ha rellenado tambi&eacute;n el campo
correspondiente al texto alternativo de forma que, al pasar por encima
de esa zona con el rat&oacute;n, aparezca un texto que indique lo
que ocurrir&aacute; cuando se haga clic. Recuerda que este uso del
atributo <code>alt</code> no es el establecido por el <acronym title="World Wide Web Consortium">W3C</acronym> por lo
que realmente
deber&iacute;as duplicarlo utilizando la el atributo <code>title</code>
</p>

<p>El campo de nombre o ID del marco ser&aacute; de gran
utilidad cuando trabajes en p&aacute;ginas creadas utilizando
marcos, a las cuales les dedicaremos un apartado espec&iacute;fico
del curso.</p>

<p>Cuando hemos completado el mapa obtendremos algo similar a lo
que se muestra en la imagen:</p>

<p style="padding-top: 5px;" class="centrado"><img src="../gimp/mapa1b.png" height="426" width="641">
</p>

<p>Ahora lo &uacute;nico que nos queda es obtener el
c&oacute;digo que se ha generado para pegarlo en nuestra
p&aacute;gina. Para conseguirlo utilizamos el men&uacute; <span class="refmenu">ver <img src="../imagenes/flechamenu.png" height="13" width="14"> fuente</span>,
marcaremos el c&oacute;digo mediante arrastrar y lo copiaremos
mediante la combinaci&oacute;n de teclas <img src="../imagenes/teclactrl.png" height="26" width="36">
+ <img src="../imagenes/teclac.png" height="27" width="26"> para pegarlo en el c&oacute;digo de nuestra
p&aacute;gina. </p>

<div class="avisos">
<p><img class="flotizq" src="../imagenes/atencion.gif" height="25" width="28">El mapa se genera tomando como
referencia que la imagen est&aacute; almacenada en la misma carpeta
que la p&aacute;gina. Si no fuera as&iacute; tendr&aacute;s
que corregir manualmente el c&oacute;digo para que apunte a la
localizaci&oacute;n correcta. Por ejemplo, si el programa ha
generado el c&oacute;digo siguiente:</p>

<p class="codigo"><code>&lt;img src="reloj.jpg"
width="377" height="356" border="0" usemap="#map" /&gt;</code>
</p>

<p>y nuestra imagen est&aacute; guardada en la carpeta
"imagenes", que cuelga de la carpeta en la que est&aacute; la
p&aacute;gina, habr&iacute;a que modificarlo para que quedara:</p>

<div class="codigo2 codigo">
<p><code>&lt;img src="imagenes/reloj.jpg" width="377"
height="356" border="0" usemap="#map" /&gt;</code></p>

</div>

<p>Es posible que te haya llamado la atenci&oacute;n el final
de
la&nbsp;etiqueta que establece el origen de la imagen en el que
aparece
una barra de divisi&oacute;n antes del cierre. Esto se debe a que
el
c&oacute;digo que genera Gimp para los mapas es compatible con la
especificaci&oacute;n <acronym title="eXtensible HyperText Markup Language">XHTML</acronym>
en la que una etiqueta no puede ir sin su correspondiente cierre, por
lo que las etiquetas que escribimos en&nbsp;<acronym title="HyperText Markup Language">HTML</acronym> sin
cierre, tales como <code>&lt;br&gt;</code> o <code>&lt;img&gt;</code>
pasan a convertirse en <code>&lt;br /&gt;</code> o
<code>&lt;img /&gt;</code> que es el convenio
sint&aacute;ctico establecido por la
especificaci&oacute;n&nbsp;<acronym title="eXtensible HyperText Markup Language">XHTML</acronym>
para indicar que una etiqueta se encuentra cerrada. </p>

</div>

<div class="practicas">
<p><img class="numact" style="width: 29px; height: 29px; float: left;" alt="Actividad 56" title="Actividad 56" src="../imagenes/numeracion/cincuentayseis.gif"> Abre en el
editor la p&aacute;gina que
hab&iacute;as creado en el ejercicio previo.</p>

<ul>

  <li>Arranca Gimp y elige la imagen del reloj</li>

  <li>Crea una zona circular y enl&aacute;zala con uno de los
destinos que ten&iacute;as creados en la p&aacute;gina. (Como
Gimp no te muestra el nombre puedes comprobar los nombres en el propio
editor)</li>

  <li>Crea otra zona poligonal que coincida con un sector horario
y crea el v&iacute;nculo correspondiente.</li>

  <li>Crea por &uacute;ltimo una zona cuadrada o rectangular.
Ten cuidado para que las zonas no se solapen.</li>

  <li>Prueba a crear alg&uacute;n enlace de correo o a una
p&aacute;gina externa, bien sea de tu sitio o de Internet.</li>

  <li>Utiliza <span class="refmenu">ver <img src="../imagenes/flechamenu.png" height="13" width="14">
fuente </span>para
acceder al c&oacute;digo generado y c&oacute;pialo. </li>

  <li>Vete a N|VU y pega el c&oacute;digo dentro de la
pesta&ntilde;a <img style="width: 99px; height: 21px;" alt="C&oacute;digo fuente" title="C&oacute;digo fuente" src="../imagenes/pestanacodigofuente.png">
en la
posici&oacute;n en la que hab&iacute;as colocado originalmente
la imagen del reloj.<br>

    <img src="../imagenes/atencion.gif" align="left" height="25" width="28"> Si la imagen se encuentra en
una carpeta diferente modifica la ruta para que sea correcta y el
navegador pueda localizarla.<br clear="all">
 </li>

  <li>Retoca los elementos que consideres necesarios, o bien
guarda la p&aacute;gina como <strong>actividad56.html</strong>, y pasa al navegador para comprobar el
resultado.</li>

</ul>

</div>

</div>
</body>
</html>
