<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>
<head>
  <title>&iquest;Que son los marcos?</title>


  <link rel="stylesheet" type="text/css" href="../nvu2005.css">

<!-- compliance patch for microsoft browsers --><!--[if lt IE 7]>
<script src="../ie7/ie7-standard-p.js" type="text/javascript"></script>
<![endif]-->
</head>
 

<body>
<div id="localizador">
<p>Marcos&gt;&gt;¿Qu&eacute; son?</p>

</div>
<div id="flechadcha">
<a href="marcos2.htm" title="avanzar"><img src="../Images/flechadcha.gif" border="0"></a>
</div>
<div id="flechaizq">
<a href="../formularios/formularios4.html" title="retroceder"><img src="../Images/flechaizq.gif" border="0"></a>
</div>


<div id="contenido">
<h2>&iquest;Qu&eacute; son los marcos?</h2>
<p>Si tuvi&eacute;ramos que definir los marcos es probable
que hubiera que empezar por hacerlo por un criterio de
reacci&oacute;n m&aacute;s que de descripci&oacute;n: los
marcos han sido uno de los recursos para el dise&ntilde;o WEB que
m&aacute;s pol&eacute;micas han generado.</p>

<p>Curiosamente, en este caso, la pol&eacute;mica no se
produce porque sean compatibles con uno de los navegadores mayoritarios
y no con el otro, sino por su propia naturaleza, que hizo que surgieran
en la red p&aacute;ginas cuya raz&oacute;n de ser era oponerse
a la utilizaci&oacute;n de marcos. As&iacute; pues, para que no
te prives y puedas participar en la pol&eacute;mica con
conocimiento de causa ya va siendo hora de explicar en qu&eacute;
consisten exactamente los marcos y empezar a utilizarlos para
experimentar sus pros y sus contras.</p>

<p>Te iba a sugerir que, para que visualizaras la apariencia de
una p&aacute;gina realizada con marcos pensaras en la
distribuci&oacute;n de ... pero al final me parece mucho
m&aacute;s sencillo que te fijes en la pantalla que tienes delante.
S&iacute;, s&iacute;,... la propia pantalla del curso. </p>

<p>A estas alturas ya te habr&aacute;s dado cuenta de que hay
tres zonas en la pantalla: </p>

<ul>

  <li>Zona izquierda en la que aparece&nbsp;el
men&uacute;.</li>

  <li>Zona superior en la que aparece el motivo gr&aacute;fico del curso.</li>

  <li>Zona principal en la que se presentan las explicaciones y
pr&aacute;cticas.</li>

</ul>
Podr&iacute;amos decir que una estructura de marcos es una
artima&ntilde;a que hace posible dividir la pantalla en varias
zonas que nos permiten presentar en cada una de ellas una
p&aacute;gina independiente. Seguramente podr&iacute;as
argumentar que un efecto muy similar se podr&iacute;a obtener
organizando una buena tabla y, en parte, tendr&iacute;as
raz&oacute;n. Pero, si hici&eacute;ramos la
distribuci&oacute;n del espacio utilizando tablas se
tratar&iacute;a de una &uacute;nica p&aacute;gina y, cada
vez que quisi&eacute;ramos renovarla tendr&iacute;amos que
volver a escribir toda la zona que pretendemos que se vuelva a repetir.
<p>Adem&aacute;s, al tratarse de p&aacute;ginas
independientes podr&eacute; hacer que una zona de la pantalla se
mantenga fija mostrando el contenido de una de las p&aacute;ginas
mientras que en otra zona se van produciendo variaciones.</p>

<p>&iquest;Has observado que, aunque la zona principal de la
pantalla presente unos contenidos que equivalen a varias
p&aacute;ginas escritas y me obligan a utilizar la barra de
desplazamiento la zona de men&uacute; permanece fija? </p>

<p>Si el recurso para disribuir los espacios de la
p&aacute;gina hubiera sido una tabla ese comportamiento no hubiera
sido posible: al fin y al cabo una tabla es un contenedor dividido en
compartimentos en los que voy depositando el texto. Si alguno de los
compartimentos supera las dimensiones de la pantalla no es posible
moverlo de forma independiente, sino que hay que arrastrar todo el
contenedor para que aparezcan las zonas que estaban invisibles, ... y
desaparezcan las que estaban visibles.</p>

<p class="trucosyestilo">Algunas de las ventajas de la
utilizaci&oacute;n de marcos ya han aparecido con estos breves
apuntes. <br>

<br>

Pero es posible que ya hayas intuido alguno de los inconvenientes: si
no queremos que nuestra p&aacute;gina acabe por parecer un cuadro
de Piet Mondrian habr&aacute; que utilizar los marcos con un cierto
criterio de efectividad. <br>

<br>

Si prima nuestro af&aacute;n por presentar una gran cantidad de
informaci&oacute;n de forma simult&aacute;nea es probable que
lo &uacute;nico que obtengamos sea una colecci&oacute;n de
espacios peque&ntilde;os que muestran fragmentos de
informaci&oacute;n irrelevantes por su escasa extensi&oacute;n,
acompa&ntilde;ados, para aumentar la confusi&oacute;n, de sus
correspondientes barras de desplazamiento horizontales y verticales (En
los cuadros de Mondrian se pod&iacute;a aprovechar algo
m&aacute;s el espacio porque no ten&iacute;an que incluir las
barras de desplazamiento <img style="width: 24px; height: 24px;" alt="sonrisa" title="sonrisa" src="../imagenes/smile.png"> <font size="3">)</font></p>

<p>Si seguimos observando continuaremos encontrando
caracter&iacute;sticas, tanto positivas como negativas, de una
estructura organizada a base de marcos, pero tal vez sea mejor hacerlo
de forma un poco m&aacute;s activa a trav&eacute;s de las
pr&aacute;cticas propuestas en los siguientes ep&iacute;grafes.</p>

<p>&nbsp;</p>
</div>
</body>
</html>
