<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>
<head>
  <title>El marco fantasma</title>


  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">

  <link rel="stylesheet" type="text/css" href="../nvu2005.css">

<!-- compliance patch for microsoft browsers --><!--[if lt IE 7]>
<script src="../ie7/ie7-standard-p.js" type="text/javascript"></script>
<![endif]-->
</head>


<body>

<div id="localizador">
<p>Marcos&gt;&gt;El marco fantasma</p>

</div>
<div id="flechadcha">
<a href="marcos3.htm" title="avanzar"><img src="../Images/flechadcha.gif" border="0"></a>
</div>
<div id="flechaizq">
<a href="marcos2.htm" title="retroceder"><img src="../Images/flechaizq.gif" border="0"></a>
</div>


<div id="contenido">

<h2>El marco fantasma</h2>

<p>Hay ocasiones, cuando la estructura de la WEB sigue una
secuencia l&oacute;gica y de exposici&oacute;n lineal, en las
que la trayectoria que va a seguir la navegaci&oacute;n es muy
previsible. </p>

<p>En otras ocasiones, hay partes de la WEB que tienen una alta
probabilidad de ser visitadas en uno u otro momento, pero presentan la
dificultad de incluir im&aacute;genes u otros recursos que
incrementan su tama&ntilde;o y hacen que su descarga sea trabajosa.</p>

<p>En ambos casos, la descarga ser&aacute; mucho
m&aacute;s r&aacute;pida la segunda vez que visitemos la
p&aacute;gina, puesto que en esa ocasi&oacute;n los componentes
de la misma no se descargar&aacute;n directamente de Internet sino
que se extraer&aacute;n de la memoria cach&eacute; del
navegador.</p>

<p>Una buena ayuda, para facilitar la navegaci&oacute;n,
ser&iacute;a disponer de un recurso que permitiera que esas
p&aacute;ginas que se van a visitar estuvieran ya cargadas en la
memoria cach&eacute; del navegador y as&iacute; se pudiera
agilizar la descarga para que el visitante tuviera una
sensaci&oacute;n de que todo va mucho m&aacute;s
r&aacute;pido.</p>

<p>&iquest;Qu&eacute; te parece crear una estructura de
marcos en uno de los cuales se presentara la p&aacute;gina que
estamos visitando y en el otro la que vamos a visitar? Seguro que has
pensado que no es una idea con mucho sentido, porque
&iquest;qu&eacute; ocurre si ambas p&aacute;ginas no tienen
nada que ver entre s&iacute;?</p>

<p>Vamos a verlo de otra manera. Seguro que recuerdas que los
marcos se pueden definir a trav&eacute;s de porcentajes de la
pantalla y que puedes utilizar el signo * para indicar el espacio
restante. &iquest;Qu&eacute; te parece entonces esta
definici&oacute;n: <code>&lt;frameset
cols="100%,*"&gt;</code>?
</p>

<p>Probablemente pensar&aacute;s que es absurdo adjudicar a
una columna el 100% de la ventana y a la otra el resto, puesto que no
le hemos dejado nada, pero precisamente ah&iacute; est&aacute;
el truco. Si en el marco que ocupa el 100% ponemos la p&aacute;gina
que el visitante est&aacute; viendo en este momento y en el otro la
que pretendemos precargar, quien est&aacute; viendo la WEB no
ver&aacute; esta segunda p&aacute;gina, pero cuando vaya a
visitarla ya la tendr&aacute; en la memoria cach&eacute; de su
navegador y se cargar&aacute; muy r&aacute;pidamente.</p>

<p>S&oacute;lo hay un peque&ntilde;o detalle
m&aacute;s: aunque al crear una p&aacute;gina pongamos unas
dimensiones para los marcos, quien la visita puede cambiar las
dimensiones si pincha y arrastra la divisi&oacute;n entre los
mismos. Si pretendemos evitar que el visitante "corra la cortina" y
vea el marco fantasma tendremos que utilizar el atributo <code>noresize</code><b>.
</b>El c&oacute;digo quedar&iacute;a como sigue.</p>

<div class="codigo">
<p><code>&lt;frameset
cols="100%,*" framespacing="0" frameborder="0"&gt;<br>

&lt;frame src="paginavisible.htm" name="izquierda" noresize&gt;<br>

&lt;frame src="paginafantasma.htm" name="derecha"&gt;<br>

&lt;/frameset&gt;</code> </p>

<p>El mismo efecto se habr&iacute;a conseguido
creando una estructura en filas en lugar de columnas.&nbsp;</p>

</div>


<p class="estilo">Ten en cuenta que el ancho de
banda es un bien limitado. Cada vez que empleamos la t&eacute;cnica
comentada estamos incrementando el uso de la red, ya que el visitante
descarga una p&aacute;gina que no hab&iacute;a solicitado en
ese momento. <br>

<br>

Procura utilizar este recurso de forma racional y s&oacute;lo en
aquellos casos en los que pienses que va a ser realmente
&uacute;til.</p>

<br>

<div class="practicas">
<p>Crea una estructura con un marco fantasma. Una posible
utilidad ser&iacute;a acelerar la carga de im&aacute;genes de
un peque&ntilde;o &aacute;lbum.</p>

<p>En la zona visible pon las miniaturas de las
im&aacute;genes. En el marco fantasma crea una p&aacute;gina
con todas las im&aacute;genes a tama&ntilde;o real.</p>

<p>Crea una p&aacute;gina para cada una de las fotos que
contenga la imagen y un enlace para volver al panel de miniaturas.</p>

<p>Comprueba el funcionamiento del sistema. (Para comprobar
realmente la posible aceleraci&oacute;n obtenida la
p&aacute;gina deber&iacute;a estar publicada, ya que en modo
local el aumento de velocidad puede resultar imperceptible)</p>

</div>

</div>
</body>
</html>
