<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html lang="es-es">
<head>


  
  <meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">

  


  
  <title>CSS: dise&ntilde;o visual</title>
  <meta name="author" content="Ra&uacute;l Luna">
<!-- parche de compatibilización con CSS 2 para navegadores microsoft --><!--[if lt IE 7]>
<script src="../ie7/ie7-standard-p.js" type="text/javascript"></script>
<![endif]-->



  
  <link href="../nvu2005.css" type="text/css" rel="stylesheet">

<link href="../multi1.css" type="text/css" rel="stylesheet">
  
  <link rel="stylesheet" href="css10.css" type="text/css">
</head>


<body>

<div id="localizador">
<p>Estilos&gt;&gt;Dise&ntilde;o visual</p>

</div>

<div id="flechadcha">
<a href="absolutamenterelativo.html" title="avanzar"><img src="../Images/flechadcha.gif" border="0"></a>
</div>
<div id="flechaizq">
<a href="css9.html" title="retroceder"><img src="../Images/flechaizq.gif" border="0"></a>
</div>


<div class="solapas">
<ul>


  <li class="activo"><a href="css10.html">Diseño visual</a></li>


 <li><a href="absolutamenterelativo.html">Absolutamente relativo</a></li>


</ul>


</div>

<div class="principal">	


<h2>Dise&ntilde;o visual</h2>


<p> Bajo el ep&iacute;grafe de dise&ntilde;o visual se
incluyen propiedades referidas a la forma en que podemos controlar
c&oacute;mo
se muestra un elemento,&nbsp;c&oacute;mo aparecer&aacute;
una imagen en
relaci&oacute;n a otro elemento, el posicionamiento de un elemento
respecto a su posici&oacute;n habitual o con una
posici&oacute;n fija dentro de la p&aacute;gina, la
determinaci&oacute;n de la visibilidad de un elemento y el orden en
el que se mostrar&aacute;n las capas si estas se superponen, la
creaci&oacute;n de recortes para mostrar la informaci&oacute;n
y c&oacute;mo mostrarla cuando supera el espacio asignado.</p>


<h3>C&oacute;mo se muestran los elementos</h3>


<div>
<p>Ya hemos visto que hay elementos en bloque y en
l&iacute;nea y que su forma de construir el cuadro contenedor
difiere bastante. Mediante el uso de CSS podemos indicarle al navegador
que debe mostrar un elemento creando un tipo de cuadro distinto al que
le corresponder&iacute;a por su naturaleza.&nbsp;En el editor
de CSS de N|VU podr&aacute;s acceder a esta propiedad dentro de la
pesta&ntilde;a caja.</p>


</div>


<p><strong>Propiedad: </strong><code>display</code></p>


<p><strong>Valores:</strong> aunque
podr&iacute;amos considerar otros recogidos en la
especificaci&oacute;n vamos a tener en cuenta s&oacute;lo <code>inline</code>
y <code>block</code> para intercambiar la forma de
presentaci&oacute;n de las dos principales disposiciones.&nbsp;</p>


<div class="ejemplo">
<p> <strong>Ejemplo 1</strong></p>


<p>Si utilizo el selector span para marcar una palabra de una
frase y aplicarle un estilo lo normal es que ese estilo genere un
cuadro de elemento en l&iacute;nea ya que esa es la <span style="border: 1px dotted orange;">presentaci&oacute;n</span>
predeterminada para los fragmentos de texto. A continuaci&oacute;n
se repite este mismo texto aplic&aacute;ndole la propiedad
<code>display:block</code> a la palabra
presentaci&oacute;n. </p>


<p><strong>Resultado</strong></p>


<p>Si utilizo el selector span para marcar una palabra de una
frase y aplicarle un estilo lo normal es que ese estilo genere un
cuadro de elemento en l&iacute;nea ya que esa es la <span style="border: 1px dotted orange; display: block;">presentaci&oacute;n</span>
predeterminada para los fragmentos de texto. A continuaci&oacute;n
se repite este mismo texto aplic&aacute;ndole la propiedad
display:block a la palabra presentaci&oacute;n.</p>


<p><strong>Ejemplo 2 </strong></p>


<p>En el segundo ejemplo marcaremos los p&aacute;rrafos con
<code>display:inline</code></p>


<p>Este es el segundo p&aacute;rrafo. Ahora repetimos los dos
p&aacute;rrafos correspondientes a este ejemplo y
aparecer&aacute;n uno a continuaci&oacute;n de otro como si no
hubiese salto de p&aacute;rrafo.</p>


<p><strong>Resultado</strong></p>


<p style="display: inline;">En el segundo ejemplo
marcaremos el segundo p&aacute;rrafo con <code>display:inline</code></p>


<p style="display: inline;">Este es el segundo
p&aacute;rrafo. Ahora repetimos los dos p&aacute;rrafos
correspondientes a este ejemplo y aparecer&aacute;n uno a
continuaci&oacute;n de otro como si no hubiese salto de
p&aacute;rrafo.</p>


</div>


<p>&nbsp;</p>


<h3>Posici&oacute;n flotante</h3>


<p>Se trata de una propiedad que encuentra su principal
aplicaci&oacute;n en las im&aacute;genes, aunque
tambi&eacute;n nos permitir&aacute; situar elementos textuales
y conseguir interesantes efectos de inclusi&oacute;n, especialmente
si utilizamos como complemento los fondos.&nbsp;En el editor de CSS
de N|VU podr&aacute;s acceder a esta propiedad dentro de la
pesta&ntilde;a caja. </p>


<p><b>Propiedad:</b> <code>float</code> </p>


<p><b>Valores:</b> <code>left</code>
har&aacute; flotar el elemento afectado en la zona izquierda, <strong><code>right</code>
</strong> en la derecha y <strong><code> none</code>
</strong>impedir&aacute; la flotaci&oacute;n haciendo que
el elemento se
muestre en la posici&oacute;n que le corresponde en el flujo de la
p&aacute;gina.&nbsp;</p>


<div class="ejemplo">
<p><b>Ejemplos:</b> En el ejemplo que se muestra se
han creado dos identificadores a los que se les ha aplicado la
propidedad <code>float</code> y algunas m&aacute;s de
fondos,
m&aacute;rgenes y rellenos para que su presentaci&oacute;n
visual tenga "aire" entre las diferentes zonas. <a href="javascript:void(0)" onclick="window.open('muestra12.htm','','statusbar=0,menubar=0,toolbar=0,top=0,left=0,width=690,height=400')">Ver
ejemplo </a></p>


</div>


<h2>Zonas de flotaci&oacute;n prohibidas</h2>


<p>Si no nos interesa que a un determinado elemento se le
a&ntilde;adan zonas flotantes
podemos indicarlo mediante una propiedad
espec&iacute;fica.&nbsp;En el editor de CSS de N|VU
podr&aacute;s acceder a esta propiedad dentro de la
pesta&ntilde;a caja. </p>


<p><b>Propiedad:</b> <code>clear</code></p>


<p><b>Valores: </b><code>left</code><strong>
</strong>impedir&aacute; la flotaci&oacute;n de un
elemento a la
izquierda del que lleva la propiedad, <code>right</code><strong>
</strong>har&aacute; lo propio a la derecha y <code>
both</code><strong>
</strong>afectar&aacute; a ambos lados.</p>


<div class="ejemplo">
<p><b>Ejemplos:</b> Se repite el ejemplo anterior
pero se ha evitado la flotaci&oacute;n de la zona a la que
hab&iacute;amos llamado mancheta. <a href="javascript:void(0)" onclick="window.open('muestra13.htm','','statusbar=0,menubar=0,toolbar=0,top=0,left=0,width=690,height=500')">Ver
ejemplo </a></p>


</div>


<p>Antes de continuar recordemos cual es el proceso habitual de
generaci&oacute;n de p&aacute;ginas en una ventana de
ordenador. Es lo que se denomina <strong>flujo normal</strong>:</p>


<ul>


  <li>Los elementos de bloque generan cajas de bloque que se
sit&uacute;an verticalmente, una a continuaci&oacute;n de otra
en su orden de aparici&oacute;n en la p&aacute;gina, comenzando
por la parte superior de la ventana. El espaciado vertical entre un
elemento y el siguiente se calcula tomando el mayor valor de margen
superior o inferior de los elementos implicados.<br>


&nbsp; </li>


  <li>Los elementos en l&iacute;nea generan cajas de
l&iacute;nea que se disponen horizontalmente uno a
continuaci&oacute;n de otro en su orden de aparici&oacute;n en
la p&aacute;gina, desde el inicio del bloque que las contiene. Si
hay dos cajas de l&iacute;nea contiguas sus espaciados horizontales
se mantienen, sum&aacute;ndose sus anchuras. Cuando una caja de
l&iacute;nea ocupa m&aacute;s del espacio disponible se rompe
autom&aacute;ticamente generando una nueva caja en el
rengl&oacute;n inferior. En ese caso, los bordes,
m&aacute;rgenes y rellenos no tienen aplicaci&oacute;n en el
borde de ruputura ni en el de inicio de la siguiente caja.</li>


</ul>


<div class="practicas">
<img style="width: 29px; height: 29px; float: left;" alt="Actividad 92" title="Actividad 92" src="../imagenes/numeracion/noventaydos.gif">
<p>Vamos a
comprobar con un ejercicio pr&aacute;ctico lo que acabamos de
comentar.</p>


<ul>


  <li>Crea una p&aacute;gina nueva con dos
p&aacute;rrafos y apl&iacute;cales a cada uno de ellos un
estilo en l&iacute;nea que recoja las siguientes propiedades:
    
    <ul>


      <li><code>margin:50px</code> y <code>border:thin
solid blue</code> para el primero </li>


      <li><code>margin:10px</code> y <code>border:thin
dotted red</code> para el segundo</li>


      <li>tambi&eacute;n ser&iacute;a conveniente que al
selector <code>body</code> le a&ntilde;adieras el
estilo <code>margin:0px</code> </li>


    
    </ul>


  </li>


  <li>A&ntilde;ade un nuevo p&aacute;rrafo sin
caracter&iacute;sticas especiales.</li>


  <li>Modifica los valores de los m&aacute;rgenes en la
pesta&ntilde;a <img style="width: 99px; height: 21px;" alt="C&oacute;digo fuente" src="../imagenes/pestanacodigofuente.png">
y
alterna con <img style="width: 103px; height: 20px;" alt="Vista preliminar" src="../imagenes/pestanavistapreliminar.png">
para
comparar los efectos visuales obtenidos.</li>


  <li>Selecciona una palabra del primer p&aacute;rrafo
encerr&aacute;ndola entra el delimitador <code>&lt;span&gt;</code>
y su
cierre <code>&lt;/span&gt;</code>.
Apl&iacute;cale al delimitador el
estilo <code>border:thin solid red</code>.</li>


  <li>Haz exactamente lo mismo con la palabra anterior o
posterior a la que acabas de trabajar.</li>


  <li>Como tienes a la vista el resultado selecciona un grupo de
palabras que incluyan un salto de l&iacute;nea y
enci&eacute;rralas entre <code>&lt;span&gt;</code>
y <code>&lt;/span&gt;</code> para aplicarles el
mismo estilo de antes y ve a
la pesta&ntilde;a&nbsp;<img style="width: 103px; height: 20px;" alt="Vista preliminar" src="../imagenes/pestanavistapreliminar.png">
para comprobar la ausencia
de los bordes al final y al principio de l&iacute;nea.</li>


  <li>Si quieres puedes guardar la p&aacute;gina como <strong>actividad92.html</strong></li>


</ul>


</div>


<p>Para poder modificar la apariencia visual disponemos en CSS2
de la posibilidad de alterar el flujo normal especificando la
posici&oacute;n de los elementos. Se trata de una propiedad muy
potente y, aunque podemos aplicarla directamente sobre cualquier
elemento, la recomendaci&oacute;n ser&iacute;a que lo hicieras
creando contenedores de bloque con la etiqueta <code>&lt;div&gt;</code>
y
especificando en
ellos la posici&oacute;n. </p>


<img class="flotder" alt="Capa creada con N|VU" src="imagenes/imagendecapa.png" style="width: 302px; height: 155px;">As&iacute;
pues, antes de ver los valores y los efectos de los mismos comentemos
que N|VU dispone de un icono que nos permite generar una capa, que
no es m&aacute;s que un contenedor en bloque, con una simple
pulsaci&oacute;n sobre el icono <img alt="Icono de capa" style="width: 25px; height: 24px;" src="imagenes/icocapa.png">
que crear&aacute; una capa
vac&iacute;a
que se ir&aacute; rellenando con el contenido que vayamos
tecleando.&nbsp; <br>


<p>Si lo que pretendemos es crear una capa a partir de contenidos
que ya estaban incluidos en la p&aacute;gina basta con que los
se&ntilde;alemos arrastrando y pulsemos el mismo icono para que se
genere el contenedor para englobarlos a todos. Tanto en uno como en
otro caso la capa generada lo es con posici&oacute;n absoluta, por
lo que si lo &uacute;nico que pretend&iacute;amos era insertar
una etiqueta div puede resultar m&aacute;s c&oacute;modo
hacerlo utilizando el selector desplegable de tipo de
p&aacute;rrafo o tecleando las etiquetas de apertura y cierre tras
haber marcado el texto que queremos convertir en div y elegido <span class="refmenu">insertar<img class="imgcentr" style="width: 14px; height: 13px;" alt="submen&uacute;" title="submen&uacute;" src="flechamenu.png">html</span>.&nbsp;</p>


<p>Cuando nos situemos sobre una capa posicionada absolutamente
el programa lo
indicar&aacute; haciendo aparecer sus l&iacute;mites y
modificando el icono de las capas que aparecer&aacute; como <img style="width: 24px; height: 26px;" alt="Icono de capa activa" title="Icono de capa activa" src="imagenes/icocapaactiva.png">.
Podremos moverla de un sitio
a otro si pulsamos sobre <img alt="Tirador para mover capas" title="Tirador para mover capas" style="width: 16px; height: 16px;" src="imagenes/tiradordecapa.png"> y
arrastramos hasta la nueva posici&oacute;n o bien modificar su
tama&ntilde;o utilizanod los tiradores de los v&eacute;rtices y
el centro de los lados. </p>


<p>Para modificar los estilos que afectan a la capa
bastar&aacute; con hacer doble clic sobre su interior y modificar o
a&ntilde;adir las propiedades que necesitemos.</p>


<div class="practicas">
<img style="width: 29px; height: 29px; float: left;" alt="Actividad 93" title="Actividad 93" src="../imagenes/numeracion/noventaytres.gif">
<ul>


  <li>Crea una p&aacute;gina nueva con dos
p&aacute;rrafos y selecci&oacute;nalos </li>


  <li>Pulsa&nbsp;<img alt="Icono de capa" style="width: 25px; height: 24px;" src="imagenes/icocapa.png">
para
crear una capa que los incluya.</li>


  <li>Desplaza la capa hacia otra posici&oacute;n y haz clic
para situar el cursor fuera de la capa.</li>


  <li>Pulsa nuevamente&nbsp;<img alt="Icono de capa" style="width: 25px; height: 24px;" src="imagenes/icocapa.png">
para
crear una capa vac&iacute;a y teclea un p&aacute;rrafo para
darle contenido. </li>


  <li>Haz un doble clic en el interior de una de las capas y
utiliza la propiedad <code>background-color</code> para
adjudicarle un color de
fondo.</li>


  <li>Arrastra la nueva capa de forma que se superponga sobre la
anterior. </li>


  <li>Utiliza los iconos <img style="width: 48px; height: 25px;" alt="Iconos para ordenar el apilamiento de capas" title="Iconos para ordenar el apilamiento de capas" src="imagenes/icoordendecapas.png">
para modificar el orden en
que se apilan. Puedes realizar todo el trabajo sobre la
pesta&ntilde;a <img style="width: 103px; height: 20px;" alt="Vista preliminar" src="../imagenes/pestanavistapreliminar.png">,
pero
para ver el efecto deber&aacute;s pulsar sobre una zona fuera de
las capas, de forma que no est&eacute; se&ntilde;alada ninguna
de ellas.</li>


</ul>


</div>


<h3>Posici&oacute;n de un elemento</h3>


<p>Habr&aacute;s comprobado que al crear las capas N|VU ha
introducido unos c&oacute;digos de estilo. Como las hemos movido
hasta situarlas en un punto concreto de la p&aacute;gina ha
utilizado el valor <code>absolute</code> que es uno de
los posibles.&nbsp;En el editor de CSS de N|VU podr&aacute;s
acceder a esta propiedad dentro de la pesta&ntilde;a caja. El tema
del posicionamiento es uno de los de mayor repercusi&oacute;n para
el dise&ntilde;o de p&aacute;ginas con CSS. Puedes consultar
una <a href="absolutamenterelativo.html">ampliaci&oacute;n
de conceptos</a> que te ayudar&aacute; a comprender este tema
en profundidad.</p>


<p><strong>Propiedad</strong>: <code>position</code></p>


<p><strong>Valores:</strong> Esta propiedad
indicar&aacute; la forma de calcular la posici&oacute;n del
elemento utilizando los valores <code>absolute</code>,
<code><strong>relative</strong></code>, <code>fixed</code>
y <code>static</code>, que es el valor por
defecto,&nbsp;pero para completar el c&aacute;lculo
ser&aacute; necesario
a&ntilde;adir luego las propiedades <code>left</code>,
<code>top</code><strong>, </strong><code>bottom</code><strong>
</strong> o <code>right</code>
indicando las distancias en cualquiera de las unidades admitidas
respecto a la caja contenedora. Estas distancias habra que indicarlas
en el editor de CSS de N|VU dentro de la pesta&ntilde;a caja en la
secci&oacute;n desplazamientos.</p>


<div class="ejemplo">
<p><b>Ejemplos:</b> </p>


<p><code>Absolute</code>. <a href="javascript:void(0)" onclick="window.open('muestra14.htm','','statusbar=0,menubar=0,toolbar=0,top=0,left=0,width=690,height=400,resizable=yes')">Ver
ejemplo</a></p>


<p><code>Relative</code>. La posici&oacute;n
relativa se calcula a partir
de la posici&oacute;n que ocupar&iacute;a un elemento si
siguiera el flujo normal. El resto de los elementos no se ajustan a la
posici&oacute;n modificada por lo que puede ocurrir que el elemento
se superponga sobre otros. <a href="javascript:void(0)" onclick="window.open('muestra15.htm','','statusbar=0,menubar=0,toolbar=0,top=0,left=0,width=760,height=350,scrollbars=auto,resizable=yes')">Ver
ejemplo</a></p>


<p><code>Fixed</code>. Se trata de una variante de la
posici&oacute;n
absoluta cuyo efecto es similar al de las im&aacute;genes de fondo
que se mantienen en una posici&oacute;n fija independientemente del
desplazamiento de la p&aacute;gina. Cuando se aplican a un medio
impreso, formando algo similar a una cabecera, se repiten en todas las
p&aacute;ginas. <a href="javascript:void(0)" onclick="window.open('muestra16.htm','','statusbar=0,menubar=0,toolbar=0,top=0,left=0,width=760,height=350')">Ver
ejemplo</a></p>


<p><code>Static</code>
es el valor por defecto y no produce ninguna modificaci&oacute;n en
el posicionamiento del elemento, por lo que su misi&oacute;n puede
ser m&aacute;s bien la de restablecer el flujo de la
p&aacute;gina despu&eacute;s de haber situado alg&uacute;n
elemento posicionado. </p>


</div>


<div class="avisos"><img style="width: 28px; height: 25px;" alt="Atenci&oacute;n" src="../imagenes/atencion.gif">Internet Explorer
6&nbsp;no soporta la posici&oacute;n <code>fixed. </code>Para
poder utilizarla y que se vea en este navegador hay que aplicar un
parche que veremos en la secci&oacute;n de recursos.</div>


<h3>Visibilidad</h3>


<p>Como el nombre de la propiedad sugiere se refiere a la
posibilidad de hacer que un elemento resulte visible o invisible. Su
utilidad reside en la combinaci&oacute;n con scripts que permitan
mostrar u ocultar capas al realizar determinadas acciones con el
rat&oacute;n, pero este tema excede los contenidos de este curso,
aunque puedes realizar alguna b&uacute;squeda sobre "javascript
para mostrar y ocultar capas" para encontrar referencias.&nbsp;En
el editor de CSS de N|VU podr&aacute;s
acceder a esta propiedad dentro de la pesta&ntilde;a caja.</p>


<p><strong>Propiedad:</strong> <code>visibility</code>
</p>


<p><strong>Valores: </strong>Visible<strong> </strong>
que es el
valor por defecto o <code>hidden</code> para ocultarla</p>


<p><strong>Ejemplos:</strong> Ver el
c&oacute;digo del ejemplo</p>


<ul>


  <li><a href="javascript:void(0)" onclick="window.open('muestra17.htm','','statusbar=0,menubar=0,toolbar=0,top=0,left=0,width=450,height=250')">Ver
un ejemplo en funcionamiento </a><br>


&nbsp; </li>


  <li><a href="javascript:void(0)" onclick="window.open('muestra18.htm','','statusbar=0,menubar=0,toolbar=0,scrollbar=1,top=0,left=0,width=800,height=630,resizable=yes')">Ver
el c&oacute;digo</a><br>


&nbsp; </li>


</ul>


<h2>Recortes</h2>


<p>Tenemos la posibilidad de "encerrar" un elemento dentro de un
recuadro con unas dimensiones determinadas. El resto del contenido
quedar&aacute; recortado y no
se mostrar&aacute;. Esta propiedad no est&aacute; incluida en
el editor CSS de N|VU por lo que habr&aacute; que insertar el
c&oacute;digo manualmente. </p>


<p><strong>Propiedad:</strong> <code>clip</code>
</p>


<p><strong>Valores: </strong>Para definir la zona de
recorte estableceremos las coordenadas de un rect&aacute;ngulo que
har&aacute; de ventana visible del documento. Los valores que se
aplican indican la posici&oacute;n de los v&eacute;rtices
superior izquierdo, superior derecho,
inferior derecho&nbsp;e inferior izquierdo respecto a los bordes
superior e izquierdo del contenedor en el que se encuentra la
imagen, y se anotan en la forma <code>rect (valor, valor,
valor, valor)</code>donde el primer valor sirve para calcular la
distancia hasta el borde superior, el segundo la distancia de ese
v&eacute;rtice hasta el borde izquierdo, el tercero se calcula de
nuevo respecto al borde superior y el &uacute;ltimo se calcula
respecto al borde izquierdo y sirve para determinar la distancia del
&uacute;ltimo vertice (y tambi&eacute;n del primero del que
s&oacute;lo conoc&iacute;amos su distancia al borde superior)<strong>&nbsp;
<a href="javascript:void(0)" onclick="window.open('muestra19.htm','','statusbar=0,menubar=0,toolbar=0,top=0,left=0,width=790,height=450')">Ver
ejemplo</a></strong></p>
<div class="avisos"><img style="width: 28px; height: 25px;" alt="Atenci&oacute;n" src="../imagenes/atencion.gif">Internet Explorer
6&nbsp;no soporta la propiedad <code>clip.&nbsp;</code></div>
<p>
</p>


<h3>&nbsp;Desbordamiento</h3>


<p>&iquest;Qu&eacute; ocurre cuando definimos unas
dimensiones exactas para un elemento y el contenido del mismo desborda
los l&iacute;mites establecidos? Depender&aacute; de los
valores que adopte la propiedad que controla el
desbordamiento.&nbsp;En
el editor de CSS de N|VU podr&aacute;s
acceder a esta propiedad dentro de la pesta&ntilde;a caja.</p>


<p><strong>Propiedad:</strong> <code>overflow</code>
</p>


<p><strong>Valores: </strong>Si no se especifica
valor de <code>overflow</code> los navegadores
utilizar&aacute;n <code>visible</code>
como valor por defecto. Los valores posibles son:</p>


<ul>


  <li><code>Visible</code>: Se desprecia la
altura establecida, ampli&aacute;ndola hasta el tama&ntilde;o
necesario para que se pueda mostrar todo el contenido. Hay una
diferencia importante en el modo de realizar este ajuste
autom&aacute;tico de la altura: Internet Explorer desplaza hacia
abajo el resto de los elementos, mientras que Mozilla, Konqueror o
Gale&oacute;n hacen la ampliaci&oacute;n pero mantienen la
referencia de la altura original para mostrar los siguientes elementos,
con lo que el resultado es que el contenido del elemento que se
autoamplia se superpone al de los siguientes.<br>


  </li>


  <li><code>Hidden</code>: Se recorta el
contenido mostrando lo que cabe en las dimensiones establecidas, pero
no se muestran barras de desplazamiento para poder acceder al resto del
contenido <br>


  </li>


  <li><code>Scroll</code><strong>:</strong>
Se incorporan al
bloque barras de desplazamiento horizontal y vertical, incluso si no
son necesarias porque el contenido ocupe menos espacio que el
establecido en las dimensiones del elemento. Igual que en el caso
anterior se recorta el contenido, pero ahora s&iacute; que podremos
visualizarlo al disponer de barras de desplazamiento. <br>


  </li>


  <li><code>Auto</code><strong>:</strong>
Si el contenido no puede
mostrarse completo en las dimensiones marcadas se incorpora una barra
de desplazamiento vertical para poder acceder a lo que no queda
visible. Si existe alg&uacute;n elemento que desborde las
dimensiones horizontales tambi&eacute;n se incluir&iacute;a una
barra de desplazamiento horizontal. </li>


</ul>


<p><a href="javascript:void(0)" onclick="window.open('muestra20.htm','','statusbar=0,menubar=0,toolbar=0,top=0,left=0,width=690,height=700')">Ver
ejemplo </a></p>


<h3> Alineamiento vertical </h3>


<p>Es una propiedad que tiene su principal aplicaci&oacute;n
para las im&aacute;genes, cosa que ya se pod&iacute;a hacer con
HTML, pero puede aplicarse a cualquier elemento en
l&iacute;nea.&nbsp;Esta propiedad no est&aacute; incluida
en
el editor CSS de N|VU por lo que habr&aacute; que insertar el
c&oacute;digo manualmente.</p>


<p><strong>Propiedad:</strong> <code>vertical-align</code></p>


<p><strong>Valores y ejemplos: </strong></p>


<p>Se utiliza la imagen <img src="../imagenes/atencion.gif" height="25" width="28"> para
mostrar el efecto de cada valor </p>


<ul>


  <li><code>baseline</code><strong> </strong>
el elemento
afectado alinea su borde inferior con el borde inferior del elemento
padre. <strong><img src="../imagenes/atencion.gif" alt=" " style="vertical-align: baseline;" height="25" width="28"></strong></li>


  <li><strong> </strong><code>sub</code><strong>
    </strong>el elemento afectado
alinea su borde inferior como si fuera un sub&iacute;ndice<strong><img src="../imagenes/atencion.gif" alt=" " style="vertical-align: sub;" height="25" width="28"></strong></li>


  <li><strong> </strong><code>super</code><strong>
    </strong>el elemento afectado
alinea su borde inferior como si fuera un super&iacute;ndice <img src="../imagenes/atencion.gif" alt=" " style="vertical-align: super;" height="25" width="28"></li>


  <li><strong> </strong><code>top</code><strong>
    </strong>el elemento afectado
alinea su borde superior con el borde superior del elemento
m&aacute;s alto de la l&iacute;nea, independientemente de que
sea <span class="grande">texto</span> o imagen<img src="../imagenes/flechaarriba.gif" height="29" width="29">
    <strong><strong><img src="../imagenes/atencion.gif" style="vertical-align: top;" alt=" " height="25" width="28"></strong></strong></li>


  <li><code> text-top</code><strong> </strong>el
elemento
afectado alinea su borde superior con el borde superior de la fuente
base del elemento padre<strong> </strong>(n&oacute;tese
que no toma en cuenta las modificaciones del <span class="muygrande">tama&ntilde;o</span>
    <strong><strong><img src="../imagenes/atencion.gif" style="vertical-align: text-top;" alt=" " height="25" width="28"></strong></strong>de
la fuente) </li>


  <li><strong> </strong><code>middle</code><strong>
    </strong>el elemento afectado
alinea su l&iacute;nea central con con medio del elemento padre <strong><strong><img src="../imagenes/atencion.gif" alt=" " style="vertical-align: middle;" height="25" width="28"></strong></strong></li>


  <li><code>bottom</code><strong> </strong>el
elemento afectado
alinea su borde inferior con el elemento m&aacute;s <span class="grande">bajo</span> de la l&iacute;nea<strong>
    <strong><img src="../imagenes/atencion.gif" alt=" " style="vertical-align: bottom;" height="25" width="28"></strong></strong>(en
este caso se toma en cuenta la modificaci&oacute;n de
tama&ntilde;o de la fuente que ha desplazado el borde inferior de
la letra j) </li>


  <li><code> text-bottom</code> el elemento
afectado alinea su borde inferior con el borde inferior de la fuente
base del elemento padre (n&oacute;tese que no toma en cuenta el
elemento m&aacute;s <span class="muygrande">bajo</span>)
    <img src="../imagenes/atencion.gif" alt=" " style="vertical-align: text-bottom;" height="25" width="28"></li>


  <li><code> longitud</code> expresada en
cualquiera de las unidades v&aacute;lidas, tomando como referencia
el borde inferior del elemento afectado e indicadas en positivo (.3cm)<img src="../imagenes/atencion.gif" style="vertical-align: 0.3cm;" height="25" width="28"> o en negativo (-10px)<strong>
    <img src="../imagenes/atencion.gif" alt=" " style="vertical-align: -10px;" height="25" width="28"></strong></li>


  <li><code> porcentaje</code><strong> </strong>
donde la
posici&oacute;n 0% <strong><img src="../imagenes/atencion.gif" alt=" " style="vertical-align: 0%;" height="25" width="28"></strong>equivaldr&iacute;a
a <code>baseline</code>, pudiendo expresarlo en negativo
(-50%)<strong><img src="../imagenes/atencion.gif" style="vertical-align: -50%;" height="25" width="28"></strong>o
positivo
(100%)<strong><img src="../imagenes/atencion.gif" alt=" " style="vertical-align: 100%;" height="25" width="28"></strong></li>


</ul>


<h3>Apariencia del cursor</h3>


<p>El navegador modifica de forma autom&aacute;tica la forma
en que muestra el cursr&nbsp;en funci&oacute;n de la
posici&oacute;n del rat&oacute;n sobre
los elementos de la p&aacute;gina, pero tambi&eacute;n podemos
especificarlo mediante estilos.&nbsp;Esta propiedad no
est&aacute; incluida
en
el editor CSS de N|VU por lo que habr&aacute; que insertar el
c&oacute;digo manualmente.</p>


<p><strong>Propiedad:</strong> <code>cursor</code></p>


<p><strong>Valores y ejemplos: </strong>Pasando el
rat&oacute;n sobre cada uno de los valores ver&aacute;s cambiar
el cursor de acuerdo a cada uno de ellos: <code><span style="cursor: crosshair;">crosshair,</span><span style="cursor: default;">default</span>, <span style="cursor: pointer;">pointer</span>, <span style="cursor: move;">move</span>, <span style="cursor: e-resize;">e-resize</span>, <span style="cursor: ne-resize;">ne-resize,</span> <span style="cursor: nw-resize;">nw-resize</span>, <span style="cursor: n-resize;">n-resize</span>, <span style="cursor: se-resize;">se-resize</span>, <span style="cursor: sw-resize;">sw-resize</span>, <span style="cursor: s-resize;">s-resize</span>, <span style="cursor: w-resize;">w-resize</span>, <span style="cursor: text;">text</span>, <span style="cursor: wait;">wait</span>, <span style="cursor: help;">help</span></code>
. </p>


<h3>Apilar capas</h3>


<p>Adem&aacute;s de poder colocar las capas en la
posici&oacute;n que se desee, tambi&eacute;n se puede decidir
el orden en el que se ir&aacute;n apilando, de forma que unas zonas
se superpongan a otras. Esta propiedad s&oacute;lo puede aplicarse
a capas que tengan establecido el atributo position.&nbsp;En
el editor de CSS de N|VU podr&aacute;s
acceder a esta propiedad dentro de la pesta&ntilde;a caja.</p>


<p><strong>Propiedad:</strong> <code>z-index</code></p>


<p><strong>Valor:</strong> Se aplican valores
num&eacute;ricos, de forma que un valor m&aacute;s alto indica
que el elemento est&aacute; por encima de los dem&aacute;s que
tengan valor m&aacute;s bajo o que no tengan establecida propiedad
de profundidad</p>


<div class="ejemplo" id="ejemploapilarcapas">
<p><strong>Ejemplo:</strong></p>


<div id="rosa" style="border: thin solid rgb(0, 51, 102); position: relative; background-color: rgb(255, 204, 204); width: 220px; height: 200px; z-index: 1;">
<div id="naranja" style="border: thin solid rgb(255, 170, 102); position: absolute; margin-left: 40px; margin-top: 40px; background-color: rgb(255, 221, 119); width: 340px; height: 170px; z-index: 2;"></div>


</div>


<div class="codigo2" style="position: relative; top: -150px; z-index: 3;">
<p><code>&lt;div id="salmon" style="position:relative;
background-color: rgb(255, 204, 204); border: thin solid rgb(0, 51,
102); width:220px;
height:200px; z-index:1"&gt;<br>


<br>


&lt;div id="naranja" style="position:absolute; margin-left:40px;
margin-top: 40px; background-color: rgb(255, 221, 119); border: thin
solid rgb(255, 170, 102);
width:340px; height:170px; z-index:2"&gt;&lt;/div&gt;<br>


&lt;/div&gt; </code>
<br>


</p>


</div>


</div>


<p>&nbsp;</p>


<div class="practicas">
<img style="width: 29px; height: 29px; float: left;" alt="Actividad 94" title="Actividad 94" src="../imagenes/numeracion/noventaycuatro.gif">
<ul>


  <li>Experimenta con las propiedades para el dise&ntilde;o
visual con CSS e incorpora aquellas que necesites a tus documentos o a
tu hoja de estilo.</li>


</ul>


</div>

</div>

</body>
</html>
